[
    {
        "event": {
            "type": "Overtake",
            "timestamp": 34.238,
            "description": "Driver 11 overtakes Driver 55 to position 4"
        },
        "commentary": "\"BY THE BOARDWALK! Sergio Perez has pulled off an absolute stunner! He's been all over the gearbox of Carlos Sainz for the past lap, and finally, he's made the move stick! A daring dive down the inside at Turn 3, and Perez has got the better of the Ferrari! Sainz had no answer to that one, folks! Perez is now up to P4, and he's got his sights set on the podium! The Mexican maestro has got the momentum on his side, and he's not giving up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 35.985,
            "description": "Driver 55 overtakes Driver 22 to position 5"
        },
        "commentary": "\"¡TORO, TORO, TORO! Carlos Sainz has pulled off a stunning move on Yuki Tsunoda! The Ferrari's superior pace and Sainz's masterful driving have paid off, as he slips past the AlphaTauri on the inside of the turn! That's some silky-smooth skill right there, folks! The Spanish sensation has muscled his way into P5, and he's now firmly in the mix for a strong points haul! Tsunoda put up a valiant defense, but Sainz was always going to find a way past - he's been snake-charming that Ferrari all weekend! This is getting good, folks, the midfield battle is heating up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 35.985,
            "description": "Driver 22 overtakes Driver 27 to position 10"
        },
        "commentary": "\"OH, WHAT A MOVE! Yuki Tsunoda, the young Japanese sensation, PULLS OFF A STUNNER! He's been hunting down Nico Hülkenberg for laps, and finally, he's made the pass stick! A beautifully judged move around the outside of Turn 3, and Tsunoda's Toro Rosso is ahead of the Haas! He's up to 10th place, and the crowd is going wild! Hülkenberg didn't make it easy, but Tsunoda's precision and bravery have paid off! This kid's got talent pouring out of every pore!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 36.152,
            "description": "Driver 27 overtakes Driver 18 to position 11"
        },
        "commentary": "\"UNBELIEVABLE! THE HULK HAS STRUCK! Nico Hülkenberg, the German ace, has pulled off a daring move on Lance Stroll around the outside of turn 7! He's been hounding the Canadian for laps, and finally, he's made it stick! Hülkenberg's lightning-quick reflexes and precision driving have earned him the pass, and he's catapulted himself into 11th place! Stroll didn't give it up easily, but Hülkenberg's persistence has paid off! The crowd is on the edge of their seats as Hülkenberg celebrates this hard-fought overtake!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 36.152,
            "description": "Driver 23 overtakes Driver 18 to position 11"
        },
        "commentary": "\"OH, WHAT A MOVE! Alex Albon, the Thai sensation, is on the charge! He's been stalking Lance Stroll for laps, and finally, he's made his move stick! A daring dive down the inside, and Albon emerges in 11th place, leaving Stroll to ponder what could've been! The Red Bull junior is making a name for himself, and this pass is going to get the team buzzing! That was a textbook execution, folks, Albon's got the skills, and he's not afraid to use them! The crowd is on their feet as Albon takes 11th, and Stroll is left to regroup!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 36.152,
            "description": "Driver 23 overtakes Driver 27 to position 11"
        },
        "commentary": "\"AND THERE IT IS! ALBON SEES THE OPENING AND TAKES IT! Alex Albon has got the better of Nico Hülkenberg, snatching 11th place from the German! That's a beautifully executed move, folks! Albon's been lurking, waiting for the perfect moment to strike, and when Hülkenberg's Williams drifted wide, he pounced! The Thai driver's Williams is looking lively out there, and he's not afraid to get his elbows out! That's a crucial pass for Albon, he's now right in the mix for points! Hülkenberg, on the other hand, will be ruing that slight mistake, but he's got to get back on it if he wants to stay in contention! WHAT A MOVE, ALBON!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 36.507,
            "description": "Driver 27 overtakes Driver 3 to position 12"
        },
        "commentary": "\"WHOA! HÜLKENBERG WITH THE MOVE OF THE MOMENT! The German veteran slips past Ricciardo at Turn 7, taking the 12th spot! That's a beautifully crafted overtake, folks! Nico's been hunting down Daniel for laps, waiting for the perfect opportunity to strike, and he's seized it with both hands! The crowd is on their feet as Hülkenberg wheels his car around the outside of Ricciardo, making it stick with inches to spare! A masterclass in late-braking, that! Ricciardo didn't stand a chance, outfoxed by the wily Hülkenberg! We've got a new player in 12th, and it's Nico Hülkenberg, upping the ante in this midfield melee!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 36.507,
            "description": "Driver 18 overtakes Driver 3 to position 14"
        },
        "commentary": "\"BOOM! UP THE INSIDE! LANCE STROLL MAKES THE MOVE! HE'S GOT THE PASS ON DANIEL RICCIARDO! The Canadian takes no prisoners, cutting back to the inside of the Aussie at the apex, and it's a masterclass in braking! Stroll's got the momentum now, and he's up to 14th place! That's some serious wheel-to-wheel action, folks! Ricciardo didn't see it coming, but Stroll's been building up the pace all lap and pounced on the opportunity! This kid's got some SERIOUS cojones!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 36.507,
            "description": "Driver 20 overtakes Driver 18 to position 12"
        },
        "commentary": "\"BY THE HORN OF THE BULL! Kevin Magnussen has pulled off a stunning move on Lance Stroll! He's been sizing him up for laps, and finally, he's made his move stick! Magnussen's lightning-quick reflexes and sheer bravery have paid off, as he dives down the inside to snatch 12th place! The Danish dynamo is on a mission today, folks! That's the kind of aggressive driving that gets the fans on their feet! Stroll didn't know what hit him, and Magnussen's taken full advantage! A beautifully executed overtake, and the crowd is going WILD!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 36.507,
            "description": "Driver 20 overtakes Driver 27 to position 12"
        },
        "commentary": "\"OH, THE DANISH DYNAMO STRIKES AGAIN! Kevin Magnussen, the Haas charger, sees an opening and SEIZES IT! He's been looming large in the mirrors of Nico Hülkenberg, and now he's made the move stick! A beautifully executed pass around the outside of Turn 7, and Magnussen steals 12th place from the under-pressure German! Hülkenberg was struggling to keep the pace, and Magnussen pounced, taking advantage of the slightest whiff of hesitation! The Haas is FLYING now, folks, and Magnussen's got his sights set on the next scalp! Unbelievable stuff from the Dane, who's been quietly building momentum all race long!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 37.616,
            "description": "Driver 27 overtakes Driver 3 to position 13"
        },
        "commentary": "\"OH, THE HULK HAS STRUCK! Nico Hülkenberg, the experienced German, has pulled off a masterclass move on Daniel Ricciardo! He's been sizing up the Australian for laps, studying his every move, and finally, he's made the pass stick! Hülkenberg's got the pace, he's got the skills, and now he's got 13th place! Ricciardo didn't put up much of a fight, but you can't say Hülkenberg didn't earn it! The Renault-powered car of Hülkenberg is on the march, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 37.616,
            "description": "Driver 18 overtakes Driver 3 to position 15"
        },
        "commentary": "\" OH, THE CANADIAN CONNECTION COMES ALIVE! Lance Stroll, the young charger from the GREAT WHITE NORTH, pulls off a stunner on the seasoned Aussie, Daniel Ricciardo! Stroll's been lurking in the shadows, waiting for the perfect moment to pounce, and POUNCE HE DID! That's a beautiful piece of driving, folks! He's got the momentum, he's got the pace, and he's got the confidence! Ricciardo, caught sleeping for just a split second, and Stroll capitalized! The pass is made, and Stroll takes 15th place! This could be the spark he needs to kickstart his race! Meanwhile, Ricciardo's got some work to do to get that spot back... THE BATTLE IS ON, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 37.616,
            "description": "Driver 24 overtakes Driver 18 to position 13"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS! ZHOU GUANYU MAKES THE MOVE STICK! HE'S BEEN LURKING IN THE SHADOWS FOR LAPS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE DID! Lance Stroll, caught napping, and Zhou takes advantage! The Chinese youngster is on a mission to salvage a difficult weekend, and this overtaken is just what the doctor ordered! He's up to 13th now, and you can bet your bottom dollar he's not done yet! The Shanghai sensation is making waves, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 37.616,
            "description": "Driver 24 overtakes Driver 27 to position 13"
        },
        "commentary": "\"BLUE FLAG, BLUE FLAG! Zhou Guanyu on the move! He's been sizing up Nico Hülkenberg for what feels like an eternity, and finally, he makes his move! A beautiful dive down the inside, using every inch of the track! Hülkenberg leaves the door open, and Zhou Guillotines him! What a pass, what a pass! The Chinese sensation slots into 13th, and Hülkenberg is relegated to 14th! The battle for the midfield is heating up, folks! Can Zhou keep the momentum going and climb further up the order?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 37.616,
            "description": "Driver 27 overtakes Driver 77 to position 14"
        },
        "commentary": "\"OH, THE HULK SMASHES THROUGH! Nico Hülkenberg has got the better of Valtteri Bottas, muscling his way past the Alfa Romeo on the outside of Turn 5! What a finely judged move from the German ace, he's been stalking Bottas for the past few laps, waiting for the perfect opportunity to pounce! And now he's taken 14th place, the crowd is on its feet! Hülkenberg's pace has been blistering all weekend, and he's wasting no time in making up for lost ground. Bottas, on the other hand, will be rueing that mistake - he's got his work cut out to reel Hülkenberg back in now!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 38.677,
            "description": "Driver 3 overtakes Driver 77 to position 14"
        },
        "commentary": "\"OH, THE HONEYBADGER STRIKES AGAIN! Daniel Ricciardo, the master of late braking, has pulled off a stunner! He's got the Australian grit and determination, and he's not afraid to get his elbows out! He's gone side by side with Valtteri Bottas, and the Finn couldn't hold him off! THAT'S THE WAY TO DO IT, DAN! From 15th to 14th, Ricciardo's on the move! The McLaren fans are going wild, and why not? That was a textbook pass! Bottas didn't stand a chance!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 38.677,
            "description": "Driver 3 overtakes Driver 18 to position 14"
        },
        "commentary": "\"UNBELIEVABLE MOVE! Daniel Ricciardo SEIZES THE OPPORTUNITY! He's been lurking, waiting for the perfect moment to strike, and STRIKE HE HAS! The Australian ace dives down the inside of Lance Stroll, and IT'S A MASTERCLASS OF BRAVERY AND SKILL! He's got the pace, he's got the precision, and he's got the guts! Ricciardo takes the position, and he's up to 14th! The Honey Badger is on the prowl, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 38.677,
            "description": "Driver 27 overtakes Driver 18 to position 15"
        },
        "commentary": "\"BLINDING MOVE! Nico Hülkenberg has PULLED THE RABBIT OUT OF THE HAT! He's snatched 15th place from Lance Stroll in a daring dive down the inside! The German driver has been riding the coattails of the Canadian for laps, waiting for the perfect moment to strike... AND HE'S TAKEN IT! Hülkenberg's got the bit between his teeth now, folks! Can he carry this momentum forward and make further gains?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.28,
            "description": "Driver 2 overtakes Driver 18 to position 15"
        },
        "commentary": "\"OH, WHAT A MOVE! Logan Sargeant, the rookie sensation, slices past Lance Stroll on the outside of Turn 7! He's been stalking him for laps, waiting for the perfect opportunity, AND HE'S TAKEN IT! The crowd is on their feet as Sargeant slips into 15th place, and Stroll is forced to yield! That's the kind of aggression we've grown accustomed to from the American youngster, and it's paying off in his debut season! Stroll didn't make it easy, but Sargeant was determined to make the pass stick, and now he's got his sights set on the cars ahead!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.28,
            "description": "Driver 27 overtakes Driver 18 to position 16"
        },
        "commentary": "\"OH, THE HULK IS ON THE LOOSE! Nico Hülkenberg, the experienced German, has just pulled off a masterclass move on Lance Stroll! He's been sizing him up for laps, and finally, he's made his move stick!\n\nHülkenberg dives down the inside, getting a brilliant run out of the previous turn, and Stroll can't do anything to defend it! The Aston Martin driver is left to watch as Hülkenberg sweeps past him, stealing 16th place in the process!\n\nThis is vintage Hülkenberg, folks! He's got the bit between his teeth, and he's gunning for more! The midfield battle is heating up, and Hülkenberg is right in the thick of it!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.28,
            "description": "Driver 27 overtakes Driver 77 to position 16"
        },
        "commentary": "\"UNBELIEVABLE! HÜLKENBERG WITH THE MOVE OF THE RACE SO FAR! He's been sizing up Bottas for laps, and finally, he's made his move stick! A daring dive down the inside at Turn 3, and Nico's got the job done! He's up to 16th place, and Bottas is forced to yield!\n\nThat's a massive Statement of Intent from the Hulk, folks! He's been quietly building momentum all race, and now he's making his presence felt. That's the kind of drive that gets you noticed, and sets the paddock abuzz! Valtteri Bottas, on the other hand, is going to be wondering how he let that one slip away...\n\nWhat a pass, what a drive, what a Nico Hülkenberg! He's on the march, and we can't wait"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.544,
            "description": "Driver 27 overtakes Driver 18 to position 17"
        },
        "commentary": "\"UNBELIEVABLE! HÜLKENBERG WITH THE MOVE OF THE RACE SO FAR! THE GERMAN FLYER DIVES DOWN THE INSIDE OF LANCE STROLL AND MAKES IT STICK! FROM 18th TO 17th, THE HÜLKENBERG EXPRESS IS GAINING MOMENTUM! THE CROWD IS ON ITS FEET AS NICO TAKES THE FIGHT TO THE REST OF THE FIELD! WHAT A DRIVE FROM THE HÜLKENBERG CAMP, THEY'VE BEEN WORKING TIRELESSLY TO GET THE CAR UP TO SPEED AND IT'S PAYING OFF! Stroll didn't put up too much of a fight, but you can't take away from Hülkenberg's bravery and skill, THAT WAS A MASTERCLASS OVERTAKE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.544,
            "description": "Driver 31 overtakes Driver 27 to position 16"
        },
        "commentary": "\"OH, THE FRENCH FURY STRIKES! Esteban Ocon, the man from Normandy, pulls off a masterclass move around the outside of Nico Hülkenberg! He's been sniffing around the German's gearbox for laps, and finally, he makes his move stick! Ocon's got the better exit out of Turn 3, and he squeezes past Hülkenberg on the run to Turn 4! The Renault's got the pace, and Ocon's got the skill - that's a top-notch overtake, folks! From 17th to 16th, Ocon's on the march! Can he keep this momentum going and make further inroads into the top 10?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.544,
            "description": "Driver 31 overtakes Driver 77 to position 16"
        },
        "commentary": "\"OH, THE FRENCH FLAIR! Esteban Ocon, the cunning veteran, has finally found a way past Valtteri Bottas! He's been stalking the Finn for laps, waiting for the perfect moment to pounce. AND THERE IT IS! Ocon slices down the inside, carrying phenomenal pace out of the turn, and takes position 16 from Bottas! What a beautiful, bold move! The Renault is flying today, and Ocon is making the most of it! The crowd is on their feet as he takes the chequered flag, 16th place is his! Meanwhile, Bottas will be left wondering what could've been, as he slips back to 17th.\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.731,
            "description": "Driver 10 overtakes Driver 77 to position 17"
        },
        "commentary": "\"Oh, MON DIEU! Pierre Gasly has pulled off the impossible! He's snatched 17th place from Valtteri Bottas with a daring move on the outside of turn 3! The Frenchman has been pushing hard all race, and that patience has finally paid off! A masterclass in braking and a sprinkle of aggression have allowed Gasly to sneak past the Finn and steal the spot! That's the kind of bravery that gets the crowd on their feet, folks! The Gasly express is gaining speed, and you can't count him out of a points finish just yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.731,
            "description": "Driver 10 overtakes Driver 18 to position 17"
        },
        "commentary": "\"OH, THE FRENCH CONNECTION STRIKES AGAIN! Pierre Gasly, the master of midfield mayhem, has just pulled off a stunning move on Lance Stroll! The AlphaTauri driver has been lurking in the shadows, waiting for the perfect opportunity to pounce, and that's exactly what he's done! Stroll was caught napping, and Gasly seized the chance to slipstream past him on the outside of Turn 12! The crowd is on the edge of their seats as Gasly wheelspins his way past the Aston Martin, taking 17th place and leaving Stroll to ponder what could've been! THAT'S THE KIND OF AGGRESSION WE'VE COME TO EXPECT FROM GASLY!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.731,
            "description": "Driver 27 overtakes Driver 18 to position 18"
        },
        "commentary": "\"BY THE HORN, HÜLKENBERG'S GOT THE MOVE! Nico Hülkenberg, the experienced German, has slipped past Lance Stroll on the inside of Turn 5! What a lovely bit of driving, folks! He's been hounding Stroll for the past couple of laps, studying his every move, and now he's made the pass stick! Stroll didn't put up much of a fight, but you can't blame him, Hülkenberg's got the pace today! The German's now up to 18th, and he'll be looking to make further progress in this midfield melee! What a drive, Nico!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 39.731,
            "description": "Driver 27 overtakes Driver 77 to position 18"
        },
        "commentary": "\"OH, WHAT A MOVE! Nico Hülkenberg, the wily veteran, sees an opportunity and SEIZES IT! He's been stalking Valtteri Bottas for laps, waiting for the perfect moment to pounce, and NOW HE'S DONE IT! Cutting back to the inside, using all the track and all his experience to slip past the Finn and claim 18th place! That's the kind of driving that's got Hülkenberg back on the grid, folks! Bottas didn't know what hit him, and now the German is looking to make further progress up the order!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 41.268,
            "description": "Driver 77 overtakes Driver 18 to position 19"
        },
        "commentary": "\"BLASTING BY! Valtteri Bottas has got the job done! He's been sizing up Lance Stroll for laps, and finally, he's made the move stick! A cleverly crafted overtaking maneuver, using the slipstream to perfection and then making the pass around the outside of turn 7! Stroll didn't know what hit him! Bottas is up to 19th now, and Stroll is relegated to 20th! What a drive from the Finnish flyer!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 109.193,
            "description": "Driver 77 overtakes Driver 27 to position 18"
        },
        "commentary": "\"WHAT A MOVE! Valtteri Bottas is on the prowl, and he's pounced! The Finnish flyer has snatched 18th place from Nico Hülkenberg in a beautifully executed pass! Bottas had been stalking the German for several laps, waiting for the perfect moment to strike, and boy, did he deliver! A daring dive down the inside, and he's through! Hülkenberg didn't know what hit him! Bottas is now up to 18th, and he's got the bit between his teeth! Can he keep this momentum going and start to carve his way through the field?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 110.877,
            "description": "Driver 77 overtakes Driver 18 to position 18"
        },
        "commentary": "\"UNBELIEVABLE MOVE! Valtteri Bottas has got the pace, he's got the skill, and he's got the bottle to make it stick! He's swooped past Lance Stroll, taking the inside line, and now he's claiming 18th position for himself! That's a masterclass in overtaking, folks! Bottas, the wily veteran, is back in the thick of it! The Finn has shown us why he's a multiple-time Grand Prix winner, and Stroll will be kicking himself for letting that one slip away!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 110.877,
            "description": "Driver 18 overtakes Driver 27 to position 19"
        },
        "commentary": "\"OH, THE CANADIAN CANNONBALL STRIKES AGAIN! Lance Stroll, the young charger from Montreal, has just pulled off a daring move on Nico Hülkenberg at Turn 11! The crowd is on their feet as Stroll sneaks up the inside, out-braking the German veteran and stealing 19th place!\n\nHülkenberg had been struggling to find pace all morning, but Stroll was relentless in his pursuit, sensing an opportunity to gain a crucial position. And what a move it was! Stroll's Aston Martin danced around the outside of Hülkenberg's Haas, the rear tires wiggling in protest as he nailed the brake point and snatched the gap!\n\nThat's the kind of confidence-boosting pass that can spark a driver's entire weekend, folks! Stroll's got the bit between his teeth now -"
    },
    {
        "event": {
            "type": "CarEvent",
            "timestamp": 116.0,
            "description": "CAR 18 (STR) SPUN AND CONTINUED AT TURN 1"
        },
        "commentary": "\"OH, THE DRAMA ALREADY! Turn 1, and Lance Stroll's day has taken a drastic turn... LITERALLY! The Aston Martin of Car 18 has spun out of control, and the crowd is on the edge of their seats! He's managed to recover, but not without a few nerves, I'm sure! That's a wild ride, folks! Stroll was pushing hard, maybe a bit too hard, and it nearly ended in disaster. He's got it together now, but he's lost a few places. The question is, can he claw his way back up the order?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 205.169,
            "description": "Driver 2 overtakes Driver 27 to position 14"
        },
        "commentary": "\"OH, THE YOUNG GUN STRIKES AGAIN! Logan Sargeant, the American rookie, is making a name for himself here in Formula 1! He's been closing in on Nico Hülkenberg for laps, and finally, he's made the move stick! Sargeant dives down the inside, gets the job done, and takes 14th place away from the experienced German! The crowd is on their feet, and we've got a new player in the game! Sargeant's got the momentum now, can he keep it going?!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 205.169,
            "description": "Driver 2 overtakes Driver 3 to position 14"
        },
        "commentary": "\"OH, THE BATTLE FOR 14th PLACE INTENSIFIES! Logan Sargeant, the rookie sensation, is on the move! He's been hassling Daniel Ricciardo for laps, and FINALLY, he makes the move stick! A daring dive down the inside, and Sargeant takes the position! The crowd is on their feet as the American youngster claims 14th place, leaving the Honey Badger to regroup. This kid's got skills, folks! He's not afraid to get his elbows out and fight for every inch of track!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 293.058,
            "description": "Driver 16 overtakes Driver 3 to position 3"
        },
        "commentary": "\"OH, THE MONACAN MAGIC IS BACK, FOLKS! Charles Leclerc, the Monegasque maestro, has pulled off a stunning move on Daniel Ricciardo! He's been lurking, waiting for the perfect opportunity, and BAM! He's pounced! Leclerc slips up the inside, and Ricciardo can't respond! THE FERRARI IS THROUGH! Leclerc takes the final podium spot, and this crowd is going absolutely BANANAS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 293.058,
            "description": "Driver 63 overtakes Driver 16 to position 2"
        },
        "commentary": "\"BLASTING PAST! George Russell is the master of the move! He's been sniffing around Charles Leclerc's gearbox for laps, and finally, he's made his way past! The Williams is hooked up, and Russell's got the bit between his teeth! He's taken the inside line, and Leclerc's been caught napping! FROM ZERO TO HERO, RUSSELL TAKES P2!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 298.628,
            "description": "Driver 63 overtakes Driver 4 to position 2"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS! GEORGE RUSSELL PULLS OFF A STUNNING MOVE! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT LETTING GO! Russell senses the opportunity and seizes it, diving down the inside of Lando Norris at the apex! The Williams is sideways, but George has got it nailed! HE'S THROUGH! RUSSELL TAKES SECOND PLACE! The crowd is on its feet as Russell celebrates his move with a little bit of wheelspin out of the corner! Norris had no answer to that one, and now Russell sets his sights on the leader, Max Verstappen!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 298.628,
            "description": "Driver 4 overtakes Driver 14 to position 6"
        },
        "commentary": "\"OH, THE McNUTTY MOVE! Lando Norris has pulled off an absolute stunner! He's been hounding Fernando Alonso for laps, and finally, he's made his move! Norris has got the better of the veteran Spaniard, slipping down the inside at Turn 7! The McLaren's pace has been evident all race, and now he's capitalized on it, snatching 6th place from Alonso! The crowd is on their feet, folks! Norris is on a charge, and that's the kind of driving that'll get him noticed by the big guns!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 495.638,
            "description": "Driver 81 overtakes Driver 14 to position 7"
        },
        "commentary": "\"OH, WHAT A MOVE! OSCAR PIASTRI, THE AUSSIE YOUNGSTER, HAS PULLED OFF A STUNNER! HE'S GOT THE BETTER OF FERNANDO ALONSO, THE WISE OLD FOX, AROUND THE OUTSIDE OF TURN 5! Piastri's been sizing him up for laps, waiting for the perfect moment to strike, AND STRIKE HE HAS! He's got the momentum, he's got the pace, AND NOW HE'S GOT THE POSITION! Alonso's been struggling with tyre degradation all race, and Piastri's seized the opportunity! The McLaren driver is now up to 7th, and he's got the bit between his teeth! CAN HE KEEP THIS CHARGE GOING?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 504.338,
            "description": "Driver 81 overtakes Driver 18 to position 7"
        },
        "commentary": "\"OH, THE AUSSIE ASSAULT CONTINUES! Oscar Piastri is on the charge! He's been stalking Lance Stroll for laps, and finally, he makes his move! A beautifully timed dive down the inside, and the Toro Rosso rookie takes seventh place! Piastri's got the bit between his teeth, and he's not letting up! That's two positions in as many laps for the young gun, can he keep this momentum going?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 504.338,
            "description": "Driver 18 overtakes Driver 77 to position 18"
        },
        "commentary": "\"OH, WHAT A MOVE! Lance Stroll has pulled off a stunning pass on Valtteri Bottas! The Canadian flyer has been lurking in the shadows, waiting for the perfect opportunity to strike, and STRIKE HE HAS! He's got the inside line, he's got the pace, and he's taken it! Bottas didn't stand a chance! Stroll's precision and bravery have paid off, and he's now moved up to 18th place! Bottas, on the other hand, drops down to 19th. The Finn will be ruing that one, but Stroll's got the momentum now! Unbelievable!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 686.075,
            "description": "Driver 11 overtakes Driver 77 to position 3"
        },
        "commentary": "\"TORO ROSSO TORNADO! Sergio Perez has pulled off a STUNNING move on Valtteri Bottas! He's been stalking the Mercedes for laps, waiting for the perfect opportunity to strike, AND STRIKE HE HAS! Perez has muscled his way past the Finn, grabbing third place in the process! The momentum is building, the crowd is on the edge of their seats, and Perez is FEELING THE FURY! What a drive from the Mexican maestro!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 686.075,
            "description": "Driver 11 overtakes Driver 16 to position 3"
        },
        "commentary": "\"OH, THE MEXICAN MASTERMIND STRIKES AGAIN! Sergio Perez, the wily veteran, has pulled off a stunning move on Charles Leclerc! He's been sizing him up for laps, waiting for the perfect opportunity to strike, and STRIKE HE HAS! Perez gets a better exit out of the hairpin, and with DRS enabled, he's got the speed to make the pass stick! Leclerc tries to defend, but Perez is having none of it! He's got the momentum, the skill, and the determination to take that third spot! THE CROWD IS ON ITS FEET AS PEREZ TAKES THE POSITION! What a drive from the Red Bull man! He's making a habit of these daring moves, and it's paying off big time!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 897.989,
            "description": "Driver 16 overtakes Driver 2 to position 4"
        },
        "commentary": "\"MON DIEU! The Monegasque maestro has done it again! Charles Leclerc, driving like a man possessed, pulls off an audacious move on Logan Sargeant! He's been lurking in the shadows, waiting for the perfect moment to strike, and NOW HE'S DONE IT! Leclerc swoops past Sargeant on the outside, taking the apex beautifully, and Claims P4 for himself! The Ferrari engine roaring to life as he takes the place! What a drive, Charles, WHAT A DRIVE! Sargeant didn't stand a chance, and Leclerc's Ferrari is now right in the mix, ready to take on the top three! This is turning out to be a GRAND PRIX TO REMEMBER, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 897.989,
            "description": "Driver 2 overtakes Driver 24 to position 13"
        },
        "commentary": "\"OH, WHAT A MOVE! Logan Sargeant, the rookie sensation, is on the charge! He's been sizing up Zhou Guanyu for laps, and finally, he's made his move stick! Sargeant dives down the inside, and Zhou can't hold on! The American youngster takes the position, and he's up to 13th place! What a confidence booster for Sargeant, and he's got the bit between his teeth now! The crowd is on their feet as he takes the spot!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 898.795,
            "description": "Driver 3 overtakes Driver 24 to position 14"
        },
        "commentary": "\"OH, THE HONEY BADGER STRIKES AGAIN! Daniel Ricciardo, the master of late-braking maneuvers, has pulled off a stunner! He's been lurking in the shadows, waiting for the perfect opportunity, and it's come! He's dived down the inside of Zhou Guanyu, and the Chinese rookie couldn't hold on! Ricciardo's got the spot, and he's up to 14th! What a move, what a driver! The pit wall must be buzzing with excitement, this could be the start of a charge up the order for the Australian!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 899.34,
            "description": "Driver 31 overtakes Driver 24 to position 15"
        },
        "commentary": "\"OH, THE FORCE IS WITH OCONE NOW! Esteban Ocon, the Frenchman, has pulled off an absolute peach of an overtake on Zhou Guanyu! He's been lurking, waiting for the perfect moment, and BAM! He's made his move, sticking it up the inside of the Chinese youngster at Turn 12! The Alpine car really looks hooked up today, and Ocon's got the bit between his teeth! He's muscled his way past Zhou, and now he's promoted to 15th place! What a drive from Ocon, the crowd is going WILD!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 901.373,
            "description": "Driver 31 overtakes Driver 18 to position 15"
        },
        "commentary": "\"OH, THE FRENCH FURY UNLEASHED! Esteban Ocon has finally made his move, and what a move it is! He's been sizing up Lance Stroll for laps, waiting for the perfect opportunity to strike. AND STRIKE HE HAS! Ocon's got the better of the Canadian around the outside of Turn 7, and he's muscled his way into 15th position! The Renault-powered machine is looking fierce today, folks! Stroll didn't put up much of a fight, but Ocon was not to be denied. He's been quietly going about his business all race, and now he's making his presence known. This could be the spark Ocon needs to launch a late-race charge!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 901.373,
            "description": "Driver 77 overtakes Driver 18 to position 18"
        },
        "commentary": "\"VALTERRI BOTTAS WITH THE MOVE OF THE DAY! THE FINNISH FLYER GETS AROUND LANCE STROLL ON THE OUTSIDE OF TURN 7! THAT WAS A MASTERCLASS IN BRAKING AND AGGRESSION! Bottas has been sniffing around the gearbox of Stroll for the past few laps, waiting for the perfect moment to pounce. AND WHAT A TIME IT WAS! He's got the momentum, he's got the pace, and he's got the position! 77 goes to 18, and the Iceman celebrates another well-executed overtake! That's pure class, folks!\""
    },
    {
        "event": {
            "type": "CarEvent",
            "timestamp": 978.0,
            "description": "CAR 2 (SAR) OFF TRACK AND CONTINUED AT TURN 4"
        },
        "commentary": "\"Oh, what's this?! Logan Sargeant's got it all sideways! The American rookie's gone wide at Turn 3 and he's struggling to gather it up! He's dancing on the edge, and... OH! He's off! SARGEANT'S OFF TRACK!\n\nWait, wait, wait... he's not giving up! He's trying to rejoin, and he's managed to get back on track at Turn 4! That's a brave move, but was it the right one? The question is, has he damaged that car? We need to keep an eye on him, folks, this could be a game-changer!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 987.948,
            "description": "Driver 14 overtakes Driver 77 to position 9"
        },
        "commentary": "\"OH, THE SPANISH MAESTRO STRIKES AGAIN! Fernando Alonso, the wily veteran, has pulled off a masterclass move on Valtteri Bottas! He's been sizing him up for laps, waiting for the perfect opportunity, and NOW HE'S MADE HIS MOVE! Alonso dives down the inside of Bottas at Turn 3, and it's a beautifully judged pass! The Finn didn't stand a chance! Alonso's got the bit between his teeth, and he's now up to 9th place! The Renault's pace is looking strong, and Alonso's experience is starting to pay dividends! Bottas, meanwhile, will be disappointed to have lost that position, but he's still got plenty of work to do if he wants to get back into the points!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 987.948,
            "description": "Driver 44 overtakes Driver 14 to position 8"
        },
        "commentary": "\"OH, THE KING OF COMEBACKS STRIKES AGAIN! Lewis Hamilton, the seven-time world champion, has pulled off a masterclass move on Fernando Alonso! He's been sizing him up for laps, waiting for the perfect moment to strike, and STRIKE HE HAS! Hamilton's got the momentum, he's got the pace, and he's got the position! He's up to 8th place now, and Alonso's got to settle for 9th!\n\nThat's the kind of move that gets the crowd on its feet, folks! Hamilton's been in this situation before, and he knows exactly what it takes to get the job done. Alonso, on the other hand, was doing everything he could to hold on, but Hamilton's superior pace and aggression won out in the end. What a drive by the Briton! He's on a mission to get to"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 997.592,
            "description": "Driver 44 overtakes Driver 2 to position 8"
        },
        "commentary": "\"OH, WHAT A MOVE! LEWIS HAMILTON IS ON THE CHARGE! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT LETTING UP! HE'S ALL OVER THE REAR WING OF LOGAN SARGEANT, AND HE'S SEEN HIS CHANCE... AND TAKEN IT! HAMILTON AROUND THE OUTSIDE, SARGEANT CAN'T DEFEND, AND THE SEVEN-TIME CHAMPION IS THROUGH TO EIGHTH! THE CROWD IS ON ITS FEET AS HAMILTON MAKES IT STICK! THAT'S THE KIND OF DRIVING THAT'S WON HIM ALL THOSE TITLES, FOLKS! \""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 997.592,
            "description": "Driver 3 overtakes Driver 2 to position 13"
        },
        "commentary": "\"And here comes Daniel Ricciardo, the Honey Badger is on the prowl! He's been sizing up Logan Sargeant for laps, and finally, he makes his move! A lightning-quick shift to the inside at Turn 7, and Ricciardo gets the better of Sargeant! The Australian takes 13th place, and what a drive it's been so far from the Renault man! He's been making progress through the field all afternoon, and this is just the boost he needed. Sargeant didn't put up much of a fight, but you can't blame him – Ricciardo was on a mission! The crowd is on their feet as the Aussie celebrates his latest conquest!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 998.748,
            "description": "Driver 3 overtakes Driver 2 to position 13"
        },
        "commentary": "\"FLASHPOINT ON THE TRACK! Daniel Ricciardo is on the hunt, and he's got his sights set on Logan Sargeant! The Aussie ace is all over the back of the Williams, and HE'S GOT THE PASS! Ricciardo slips up the inside, and Sargeant can't defend! The McLaren man takes 13th place, and what a move that is! The crowd is on their feet as Ricciardo celebrates a fantastic overtaking maneuver! This is what we love about Formula 1, folks - the thrill of the pass, the skill of the driver, and the sheer excitement of the race! Daniel Ricciardo, the Honey Badger, is on the prowl, and he's not done yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 998.748,
            "description": "Driver 10 overtakes Driver 2 to position 14"
        },
        "commentary": "\"Oh, what a move! Pierre Gasly, the French phenomenon, is on the charge! He's been hounding Logan Sargeant for laps, and finally, he's made the pass stick! Gasly gets around the outside of Sargeant at turn 7, and he's now up to 14th place! That's a beautifully executed move, using all the track and all his skill to get the job done! Sargeant didn't make it easy, but Gasly's pace and determination have paid off! He's now got his sights set on the next car in front, and you can bet he'll be pushing hard to keep that momentum going! What a drive from Gasly, absolutely fantastic!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 998.748,
            "description": "Driver 10 overtakes Driver 24 to position 14"
        },
        "commentary": "\"OH, GASLY'S GOT THE BIT BETWEEN HIS TEETH! HE'S BEEN LURKING IN THE SHADOWS OF ZHOU FOR LAP AFTER LAP, WAITING FOR THAT PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! GASLY TAKES THE INSIDE LINE, GETS A BETTER EXIT OUT OF THE PREVIOUS TURN, AND NOW HE'S GOT THE MOMENTUM TO PULL OFF THIS STUNNING OVERTAKE ON THE OUTSIDE OF TURN 7! ZHOU DEFENDS VALIANTLY, BUT GASLY'S GOT THE FASTER CAR AND THE DETERMINATION TO MAKE IT STICK! AND THERE IT IS, FOLKS! GASLY TAKES 14TH PLACE, ZHOU DROPS TO 15TH! THE FRENCHMAN IS ON THE MARCH!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 998.748,
            "description": "Driver 31 overtakes Driver 24 to position 16"
        },
        "commentary": "\"OH, WHAT A MOVE! Esteban Ocon sees the opportunity and SEIZES IT! He's been lurking in the shadows, waiting for the perfect moment to strike, and NOW HE'S DONE IT! He's swooped past Zhou Guanyu, taking the inside line, and claiming 16th place for himself! That's a masterclass in execution, folks! The Frenchman's got the bit between his teeth and he's not letting go! Ocon's on a roll, and the crowd is going WILD!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1000.466,
            "description": "Driver 2 overtakes Driver 24 to position 16"
        },
        "commentary": "\"LOGAN SARGEANT, THE YANK IN A BLANK, PULLS OFF A STUNNER! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT LETTING GO! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE, AND STRIKE HE HAS! ZHOU GUANYU, THE CHINESE SENSATION, HAD NO ANSWER TO THE AMERICAN'S MOVE! SARGEANT SLIPS STREAMLINE PAST THE ALFA ROMEO AND TAKES THE 16TH SPOT! THAT'S THE KIND OF MOVE THAT GETS THE CROWD ON THEIR FEET, FOLKS! THE YOUNG GUN IS ON THE MARCH!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1000.466,
            "description": "Driver 31 overtakes Driver 24 to position 17"
        },
        "commentary": "\"UNBELIEVABLE! Esteban Ocon is on a mission! He's been stalking Zhou Guanyu for laps, waiting for the perfect opportunity to pounce, AND HE'S TAKEN IT! A daring move around the outside of Turn 7, Ocon gets the job done and leaps up to 17th place! The Frenchman's pace is electric today, and he's not done yet! That overtake is pure class, folks! Ocon's got the bit between his teeth, and we can't wait to see what's next!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1000.466,
            "description": "Driver 77 overtakes Driver 31 to position 15"
        },
        "commentary": "\"OH, WHAT A MOVE! Valtteri Bottas, the Iceman, has pulled off a stunning pass on Esteban Ocon! He's been lurking in the shadows, waiting for the perfect opportunity, and he's seized it with both hands! Bottas gets a better exit out of the hairpin, and he's got the momentum to make the move stick! Ocon tries to defend, but Bottas is having none of it! He's got the Finnish flair, and he's flashed past Ocon on the inside to take 15th place! That's a masterclass in overtaking, folks! Bottas is on the march, and he's not stopping anytime soon!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1000.824,
            "description": "Driver 77 overtakes Driver 2 to position 15"
        },
        "commentary": "\"OH, THE FINNISH FLYER STRIKES! Valtteri Bottas, the Iceman, slices past Logan Sargeant with a daring late-braker into Turn 3! The Williams defense was valiant, but Bottas' experience and guile told in the end. He's up to 15th position now, and Sargeant drops to 16th! That's the kind of move that gets the pulse racing, folks! Bottas is on a mission to make up for lost ground, and he's not messing around!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1000.824,
            "description": "Driver 31 overtakes Driver 2 to position 16"
        },
        "commentary": "\"Esteban Ocon is on the move! He's been sizing up Logan Sargeant for laps, and FINALLY, he makes his move! Ocon dives down the inside of Turn 13, and Sargeant can't hold him off! The Frenchman takes the spot, and moves up to 16th place! That's a beautifully executed pass, folks! Ocon's been quietly making progress all race, and now he's in the midst of the midfield battle! Sargeant, meanwhile, will be disappointed to have lost out, but he can't afford to dwell - he's got a charging Nico Hülkenberg right behind him!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1019.091,
            "description": "Driver 31 overtakes Driver 2 to position 16"
        },
        "commentary": "\"Oh, Merci, Monsieur! Esteban Ocon, the Frenchman, pulls off a beauty of a move on Logan Sargeant! He's been stalking him for laps, waiting for the perfect opportunity, and now he makes his way past! Ocon, the master of patience, gets it done with a daring dive down the inside! Sargeant tried to defend, but Ocon was having none of it! The Renault, looking mighty, takes the scalp of the rookie and claims 16th place! That's the kind of driving that'll get the French fans on their feet, I tell you!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1019.091,
            "description": "Driver 24 overtakes Driver 2 to position 17"
        },
        "commentary": "\"OH, THE CHINESE CHARGES! Zhou Guanyu has pulled off a stunner! He's been all over the gearbox of Logan Sargeant for the past few laps, and finally, he's made his move! A great dive down the inside, and he's THROUGH! Sargeant had no answer for the might of the Alfa Romeo! Zhou's got the bit between his teeth now, he's on a mission! He's up to 17th, and you can't count him out of this race just yet! That's the kind of drive that gets the crowd on their feet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1020.802,
            "description": "Driver 24 overtakes Driver 2 to position 17"
        },
        "commentary": "\"OH, WHAT A MOVE! Zhou Guanyu, the young Chinese sensation, has pulled off an absolute stunner! He's been sizing up Logan Sargeant for laps, waiting for that perfect opportunity, AND HE'S TAKEN IT! A daring dive down the inside, Sargeant had no chance to react! Guanyu's Alfa Romeo is glued to the track, carrying so much speed through the corner! That's the kind of driving that gets the fans on their FEET! Sargeant tried to hold the line, but Guanyu was HAVING NONE OF IT! He's up to 17th now, the momentum is building! Can he keep this charge going? The crowd is BUZZING!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1020.802,
            "description": "Driver 18 overtakes Driver 2 to position 18"
        },
        "commentary": "\"UNBELIEVABLE! LANCE STROLL IS ON THE MOVE! He's been hounding Logan Sargeant for lap after lap, and finally, he's made the pass! That was a masterclass of patience and precision! Stroll sees his opportunity and seizes it, outbraking Sargeant into the hairpin and taking the spot! The Canadian is on a mission today, folks! He's got his sights set on the top 15 and he's not going to let anyone get in his way! Logan Sargeant drops to 19th, but Lance Stroll is up to 18th! The crowd is on their feet here, what a move!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1027.151,
            "description": "Driver 18 overtakes Driver 2 to position 18"
        },
        "commentary": "\"OH, THE STROLL TRAIN IS ROLLING! Lance Stroll, the Canadian charger, is on the move! He's been sizing up Logan Sargeant for laps, and finally, he makes his move! A precise, clinical pass on the inside of Turn 3, and Stroll is through! Sargeant didn't stand a chance! That's the kind of aggressive driving that gets the fans on their feet! Stroll is now up to 18th, and Sargeant drops to 19th. What a clever, opportunistic overtake by the Aston Martin driver!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1027.151,
            "description": "Driver 27 overtakes Driver 2 to position 19"
        },
        "commentary": "\"AND THERE IT IS! HÜLKENBERG MAKES THE MOVE! The German veteran has been stalking Sargeant for laps, waiting for the perfect opportunity to pounce! AND HE'S TAKEN IT! Hülkenberg dives down the inside of Turn 5, and Sargeant can't hold on! The Renault's pace is too much, and Hülkenberg takes 19th place! That's a beautifully executed overtake, folks! The crowd is on their feet as Hülkenberg celebrates his well-deserved scalp!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1076.999,
            "description": "Driver 11 overtakes Driver 27 to position 2"
        },
        "commentary": "\"OH, THE MEXICAN MASTRO STRIKES AGAIN! Sergio Perez, the Ice Man, has pulled off a daring move on Nico Hülkenberg! He's been lurking in third, sizing up the German, and BAM! He's made his move stick! The crowd is on their feet as Perez slots into second place! \n\nHülkenberg was struggling to maintain pace, and Perez pounced on the opportunity, using all his experience to makes the pass stick! That's the kind of move that wins championships, folks! Perez is now right on the tail of the leader, Max Verstappen, and we've got a real battle on our hands!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1076.999,
            "description": "Driver 11 overtakes Driver 63 to position 2"
        },
        "commentary": "\"OH, THE SILVER ARROW STRIKES! Sergio Perez, the man on the move, has pulled off a MASTERCLASS overtaking maneuver on George Russell at the high-speed Turn 12! The Mexican maestro has been lurking in the shadows, waiting for the perfect opportunity to pounce, and boy, did he take it! Russell, caught sleeping, didn't stand a chance as Perez swooped in with the precision of a surgeon! The crowd is on its feet, folks! Perez has leapfrogged Russell to take the coveted P2 spot, and the Red Bull pit wall is ERUPTING in celebration! This is turning out to be a RACE FOR THE AGES!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1078.496,
            "description": "Driver 63 overtakes Driver 16 to position 3"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS, GEORGE RUSSELL HAS PULLED OFF A STUNNER! He's been sizing up Charles Leclerc for laps, and finally, he's made his move! Down the inside,Russell's Mercedes-powered machine is a rocket ship, and he's slotted in beautifully ahead of the Ferrari! That's a massive move, folks! From fourth to third, George Russell is now a podium contender! The crowd on their feet as Russell celebrates, what a drive, what a pass!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1078.496,
            "description": "Driver 55 overtakes Driver 16 to position 3"
        },
        "commentary": "\"OH, WHAT A MOVE! Carlos Sainz, the opportunistic Spaniard, sees his chance and TAKES IT! He's got the pace, he's got the skill, and now he's got the position! He's swooped past Charles Leclerc, who was struggling to find grip on the worn out softs, and snatched P3 from the grasp of the Monegasque!\n\nThe Ferrari ace was struggling to hold on, and Sainz was sensing blood in the water. He made his move stick on the inside of Turn 5, and now he's got the bit between his teeth! The McLaren is flying, and Sainz is right in the mix for a podium finish! Leclerc's going to have to regroup and find a way to counter, but for now, it's Sainz who's got the upper hand"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1078.496,
            "description": "Driver 55 overtakes Driver 63 to position 3"
        },
        "commentary": "\"WHAT A MOVE! CARLOS SAINZ, THE FORMER RENAULT DRIVER, WITH A STUNNING PIECE OF DRIVING! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT OPPORTUNITY, AND HE'S TAKEN IT! GEORGE RUSSELL, TRYING TO DEFEND HIS THIRD POSITION, BUT SAINZ IS HAVING NONE OF IT! HE'S GOT THE FERRARI POWERED BY, AND HE'S UNLEASHING IT ON THE TRACK! RUSSELL'S DEFENSE IS BREACHED, AND SAINZ TAKES THE SPOT! WE'VE GOT A NEW THIRD PLACEHOLDER, FOLKS! IT'S CARLOS SAINZ, AND HE'S ON THE MOVE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1082.002,
            "description": "Driver 63 overtakes Driver 4 to position 4"
        },
        "commentary": "\"OH, THE SILVER ARROW STRIKES! George Russell is on a mission, folks! He's been hounding Lando Norris for laps, and FINALLY, he makes the move stick! A daring dive down the inside, and Russell emerges ahead, snatching P4 from the McLaren driver! The crowd is on their feet as Russell gets the better of Norris, showcasing his lightning-quick reflexes and ice-cool composure under pressure! The Williams is flying, and Russell is making the most of it! Norris, on the other hand, will be wondering what might have been... but Russell was unstoppable there!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1082.002,
            "description": "Driver 4 overtakes Driver 16 to position 5"
        },
        "commentary": "\"OH, THE McLAREN MAGIC IS BACK! Lando Norris has made the move of the race so far, swooping around the outside of Charles Leclerc at Turn 3 to snatch fifth place! The Englishman has been absolutely rapid all weekend, and that's the kind of bold, daring driving that's got the crowd on its feet! Leclerc was struggling to get the tyres up to temperature, and Norris pounced, making it stick with a textbook pass! The McLaren is now right in the thick of the fight, and you can bet your bottom dollar Norris is going to keep pushing for more! This is turning out to be one hell of a Grand Prix, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1115.447,
            "description": "Driver 16 overtakes Driver 24 to position 6"
        },
        "commentary": "\"UNBELIEVABLE! Charles Leclerc with the move of the race so far! He's been stalking Zhou Guanyu for lap after lap, and FINALLY, he sees his chance! Leclerc dives down the inside, and Guanyu can't hold him off! The Monegasque maestro takes the spot, and he's up to 6th! What a drive from Leclerc, he's been lightning quick all weekend! The Ferrari is looking fierce, and Leclerc is on a mission! Guanyu tries to fight back, but Leclerc's got the pace and the skill to make it stick!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1115.447,
            "description": "Driver 24 overtakes Driver 31 to position 16"
        },
        "commentary": "\"OH, THE DRAGON'S BREATH! Zhou Guanyu, the Chinese sensation, has UNLEASHED THE BEAST! He's managed to slipstream Esteban Ocon on the outside of Turn 12, and WHAT A MOVE! The Alfa Romeo pilot has snagged 16th place, leaving Ocon to fend off the pack! The crowd is going WILD, folks! Guanyu's pace has been building all session, and he's finally made his move count! Ocon, caught sleeping, couldn't defend that position – Guanyu's taking advantage of every opportunity! The midfield battle is HEATING UP, and we're loving every minute of it!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1117.385,
            "description": "Driver 18 overtakes Driver 31 to position 17"
        },
        "commentary": "\"OH, THE SILVER ARROW SLAYER STRIKES AGAIN! Lance Stroll, the Canadian charger, has pulled off a masterclass move on Esteban Ocon! He's been sizing him up for laps, and finally, he sees his chance! A daring dive down the inside, and Stroll emerges ahead! The crowd is on the edge of their seats here, folks! Ocon didn't make it easy, but Stroll's aggression and precision have paid off. He's propelled himself up to 17th position, and you can bet he's hungry for more! This is turning out to be a thrilling mid-pack battle, and we're loving every minute of it!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1176.127,
            "description": "Driver 11 overtakes Driver 31 to position 3"
        },
        "commentary": "\"OH, THE MEXICAN MAGICIAN STRIKES AGAIN! Sergio Perez, the master of the undercut, has pulled off a stunning move on Esteban Ocon! He's been sizing him up, waiting for the perfect moment, and BOOM! He's made it stick! Perez takes the inside line, carrying immense speed out of the turn, and Ocon can't respond! The Red Bull driver is now up to THIRD PLACE! THIS IS WHAT CHAMPIONSHIP CONTENDERS ARE MADE OF, FOLKS! Perez is on fire, and he's got his sights set on the top two!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1176.127,
            "description": "Driver 55 overtakes Driver 11 to position 2"
        },
        "commentary": "\"AND THERE IT IS! CARLOS SAINZ WITH THE MOVE OF THE RACE SO FAR! HE'S GOT THE BETTER OF SERGIO PEREZ AROUND THE OUTSIDE OF TURN 7! THAT WAS A MASTERCLASS IN BRAKING AND ACCELERATION! SAINZ HAS BEEN LURKING IN THE SHADOWS FOR LAPS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! THE FERRARI DRIVER IS NOW UP INTO P2, WITH HIS EYES FIRMLY FIXED ON THE LEAD! WE'VE GOT A REAL RACE ON OUR HANDS NOW, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1180.125,
            "description": "Driver 55 overtakes Driver 4 to position 2"
        },
        "commentary": "\"CARLOS SAINZ IS ON THE MARCH! THE SPANISH FLYER IS FLYING! He's got the bit between his teeth and he's not letting go! Lando Norris, caught napping, and SAINZ SEIZES THE OPPORTUNITY! THAT'S THE MOVE OF A CHAMPION, FOLKS! From third to second, the Ferrari driver has pulled off a BLINDER of an overtake! Norris was struggling with his tires, and Sainz was all over him like a bad rash! The crowd is on its feet, and we've got a real battle on our hands for the top step of the podium! Sainz is now just ONE SECOND behind the leader, Max Verstappen! The pace is SCORCHING, and we're set for a thrilling finish to this one!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1180.125,
            "description": "Driver 4 overtakes Driver 63 to position 4"
        },
        "commentary": "\"WHOA, LIGHTNING_strike_! Lando Norris has pulled off a masterclass move! He's been sizing up George Russell for laps, and finally, he's made his move stick! Norris dives down the inside at Turn 3, and Russell can't quite close the door! The McLaren man muscles his way past, and he's up to 4th place! That's some serious skill and bravery on display, folks! Norris is on a mission today, and he's not letting anyone stand in his way!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1184.832,
            "description": "Driver 63 overtakes Driver 16 to position 5"
        },
        "commentary": "\"BY THE HOOKS OF THE SILVER ARROW! George Russell, the young Briton, has pulled off a STUNNING move on Charles Leclerc! He's been hassling the Ferrari for laps, and finally, he's made it STICK! Russell's pace has been phenomenal all race, and now he's reaped the reward, snatching 5th place from the Monegasque! This is a massive boost for the Mercedes team, and Russell's got the bit between his teeth now! The crowd is on its feet, and rightly so, what a drive from the number 63 car!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1184.832,
            "description": "Driver 63 overtakes Driver 16 to position 6"
        },
        "commentary": "\"OH, WHAT A MOVE! George Russell, the young Brit, SNEAKS UP ON THE OUTSIDE of Charles Leclerc and TAKES THE SPOT! The Williams driver has been HUNGRY FOR POINTS all weekend, and now he's got his nose in the mix! Leclerc, caught sleeping, didn't expect the pace from Russell! THAT'S THE KIND OF AGGRESSIVE DRIVING WE LOVE TO SEE! Russell's now up to 6th, and the crowd is on their feet! The Williams pitwall must be ERUPTING RIGHT NOW!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1184.832,
            "description": "Driver 81 overtakes Driver 63 to position 5"
        },
        "commentary": "\"AND WHAT A MOVE! OSCAR PIASTRI HAS GOT THE JOB DONE! HE'S SLIDING UP THE INSIDE OF GEORGE RUSSELL, THE AUSSIE YOUNGSTER HAS GOT THE MOMENTUM AND TAKES THE POSITION! Piastri's been hounding Russell for laps, waiting for the perfect opportunity to strike! AND THERE IT IS! THE NUMBER 81 CAR SLIPS STREAMED PAST THE NUMBER 63, AND PIASTRI TAKES 5th PLACE! The crowd is on their feet, this is turning out to be a thrilling battle for the top five spots! Piastri's got the pace, can he keep the momentum going and chase down the leaders?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1186.001,
            "description": "Driver 81 overtakes Driver 14 to position 5"
        },
        "commentary": "\"OH, THE AUSSIE ACE STRIKES! Oscar Piastri, the rookie sensation, pulls off a masterclass move on the wily veteran Fernando Alonso! He's been sizing him up for laps, studying his every move, and finally, the opportunity presents itself! Piastri dives down the inside at Turn 3, and Alonso, with all his experience, can't quite close the door! The 81 car slips past, and suddenly Piastri is up to 5th place! The crowd is on the edge of their seats here, folks! This kid's got talent pouring out of every pore! Alonso, meanwhile, has to regroup and reassess, but Piastri is flying!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1186.001,
            "description": "Driver 14 overtakes Driver 16 to position 6"
        },
        "commentary": "\"OH, THE FIGHTING SPIRIT OF FERNANDO ALONSO IS ON FULL DISPLAY HERE! THE TWO-TIME WORLD CHAMPION IS NOT READY TO LET CHARLES LECLERC GET AWAY! Alonso's got the DRS open, he's getting the tow, AND HE MAKES THE MOVE ON THE OUTSIDE OF TURN 7! A BEAUTIFUL, BOLD OVERTAKE BY THE SPANISH ACE! Leclerc was stuck behind a slower car, but Alonso saw the opportunity and pounced! The Renault is now in P6, just 5.5 seconds behind the top 5! Fernando's mission to score big points is well and truly underway!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1186.001,
            "description": "Driver 16 overtakes Driver 44 to position 8"
        },
        "commentary": "\"OH, WHAT A MOVE! Charles Leclerc, the Monegasque maestro, has pulled off a stunning pass on Lewis Hamilton! He's been lurking in the shadows, waiting for the perfect opportunity, and BAM! He's snatched 8th place from the seven-time champ! Leclerc's got the bit between his teeth, folks, and he's not letting go! That's the kind of drive that gets the crowds on their feet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1186.001,
            "description": "Driver 63 overtakes Driver 44 to position 7"
        },
        "commentary": "\"OH, WHAT A MOVE! George Russell, the young Brit, has just produced a STUNNING pass on Lewis Hamilton! He's been lurking in the shadows, waiting for the perfect opportunity, and BOOM! He's taken it! Russell's got the speed, he's got the skill, and he's got the confidence to take on the seven-time champ! That's a MASSIVE overtake, folks! Russell's now up to seventh, and Hamilton's left to ponder what could've been! The battle for the top ten is HEATING UP!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1187.125,
            "description": "Driver 63 overtakes Driver 16 to position 7"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS, GEORGE RUSSELL HAS PULLED OFF THE MOVE OF THE RACE SO FAR! He's been stalking Charles Leclerc for laps, waiting for the perfect opportunity to strike, AND STRIKE HE HAS! A daring dive down the inside at Turn 3, and Russell's got the pass done! The Mercedes is ahead of the Ferrari, and Russell is up to 7th! What a drive from the young Brit, he's been on a mission all race! Leclerc didn't give him an inch, but Russell was having none of it, he wanted that spot and he's taken it! The crowd is going wild here, Russell's on fire!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1187.125,
            "description": "Driver 44 overtakes Driver 16 to position 7"
        },
        "commentary": "\"UNBELIEVABLE! THE CHAMPION STRIKES! Lewis Hamilton, the master of late-braking, takes the inside line on Charles Leclerc at Turn 12, and HE'S THROUGH! The Ferrari was struggling for pace, and Hamilton sensed blood in the water! That's the 7th spot in the bag for the Mercedes man! He's on a mission, folks! The Silver Arrow is flying!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1187.125,
            "description": "Driver 44 overtakes Driver 63 to position 7"
        },
        "commentary": "\"BY THE HORN! Lewis Hamilton has pulled off a stunner! He's been lurking in the shadows, waiting for the perfect opportunity, and HE'S TAKEN IT! A daring dive down the inside, and he's snatched seventh place from George Russell! The Silver Arrow has bitten back, and the Briton is on the move! That's a massive statement from the seven-time champ, and he's not done yet! The crowd is on their feet as Hamilton inches closer to the top six, and you can bet your bottom dollar he won't stop there! Russell, meanwhile, will be left to rue what could've been, but for now, it's HAMILTON IN SEVENTH!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1188.182,
            "description": "Driver 63 overtakes Driver 16 to position 8"
        },
        "commentary": "\"UN-BE-LIEVABLE! GEORGE RUSSELL PULLS OFF THE MOVE OF THE RACE SO FAR! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT LETTING GO! CHARLES LECLERC THOUGHT HE HAD THE POSITION SEALED, BUT RUSSELL'S GOT THE FRESH TYRES AND THE FRESH CONFIDENCE TO MAKE IT STICK! THAT'S THE KIND OF MOVE THAT GETS THE CROWD ON ITS FEET! RUSSELL TAKES 8TH, LECLERC DROPS TO 9TH, WHAT A TURN OF EVENTS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1188.182,
            "description": "Driver 22 overtakes Driver 16 to position 8"
        },
        "commentary": "\"WHAT A MOVE! YUKI TSUNODA IS ON THE CHARGE! He's been hunting Charles Leclerc for laps, and finally, the Japanese sensation makes his move stick! Down the inside at Turn 3, Tsunoda gets the job done, snatching 8th place from Leclerc's grasp! That's a statement pass, folks! Tsunoda's got his eyes on the top 5, and he's not afraid to fight for it!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1188.182,
            "description": "Driver 22 overtakes Driver 63 to position 8"
        },
        "commentary": "\"TSUNODA TAKES THE CHANCE! Yuki Tsunoda, the young Japanese sensation, has pulled off a stunning move on George Russell! He's been lurking in the shadows, waiting for the perfect opportunity, and IT'S NOW! Tsunoda's got the better drive out of the hairpin, and he's not hesitating, taking the inside line and MAKING IT STICK! Russell's defensive move wasn't enough, and Tsunoda's snatched 8th place from under his nose! What a drive from the AlphaTauri man, he's on a mission out there!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1190.467,
            "description": "Driver 63 overtakes Driver 16 to position 9"
        },
        "commentary": "\"AND GEORGE RUSSELL MAKES HIS MOVE! HE'S BEEN LURKING IN THE SHADOWS OF CHARLES LECLERC FOR LAP AFTER LAP, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! He's got the inside line, he's carrying the speed, and HE'S THROUGH! Russell takes ninth place from Leclerc with a beautifully executed move! The Mercedes engine roaring to life as he accelerates past the Monegasque driver! That's the kind of driving that's got Russell fans around the world on their FEET! What a pass, what a driver! The Brit is ON THE MARCH!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1190.467,
            "description": "Driver 23 overtakes Driver 16 to position 9"
        },
        "commentary": "\"WHAT A MOVE, FOLKS! Alex Albon, the Thai sensation, has pulled off a daring pass on the Monegasque maestro, Charles Leclerc! The number 23 car slices up the inside of turn 5, and Leclerc can't hold on! Albon's got the pace, he's got the skill, and now he's got the spot! Up to 9th place, and Albon's on the charge! That's the kind of performance that'll get the Red Bull junior team buzzing! Meanwhile, Leclerc's wheels are spinning, he's dropped to 10th, and he's got to regroup quickly to stay in the hunt. The battle for the top 10 is HEATING UP, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1190.467,
            "description": "Driver 23 overtakes Driver 63 to position 9"
        },
        "commentary": "\"OH, THE THUNDEROUS ROAR OF THE CROWD AS ALEX ALBON PULLS OFF A STUNNING MOVE! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE, AND STRIKE HE HAS! George Russell, caught napping, and Albon seizes the opportunity! THAT IS ONE SMALL STEP FOR ALBON, ONE GIANT LEAP FOR HIS TEAMS' CHAMPIONSHIP HOPES! He's up to 9th now, and you can't help but wonder what else he's got up his sleeve today!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1195.402,
            "description": "Driver 3 overtakes Driver 16 to position 10"
        },
        "commentary": "\"UNBELIEVABLE! The Honey Badger's got his claws out! Daniel Ricciardo's been stalking Charles Leclerc for laps, and finally, he's made his move! A daring dive down the inside, and he's THROUGH! The Australian ace is now P10, and Leclerc's been demoted to 11th! That's a massive statement from Ricciardo, who's been struggling to find rhythm all weekend. But you can't count him out, folks! He's got the talent, the skill, and the bravery to pull off moves like that. And what a boost for McLaren, who desperately needed a shot in the arm. This could be the spark they need to turn their season around!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1195.402,
            "description": "Driver 16 overtakes Driver 20 to position 12"
        },
        "commentary": "\"OH, THE MONÉGASQUE MAGIC IS BACK, FOLKS! Charles Leclerc, the Ferrari ace, has pulled off a stunning move on Kevin Magnussen, snatching 12th place from the Haas driver! That was a masterclass of patience and precision, waiting for the perfect moment to pounce on the inside of Turn 7! The Monegasque maestro has taken it to the limit, and the crowd is going wild! Leclerc's got the bit between his teeth now, who's next on his radar?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1195.402,
            "description": "Driver 63 overtakes Driver 20 to position 11"
        },
        "commentary": "\"IT'S A STUNNING MOVE! GEORGE RUSSELL WITH THE FRESH TYRES PULLING OFF A MASTERCLASS OVERTAKE ON KEVIN MAGNUSSEN! HE SAW THE OPPORTUNITY AND TOOK IT WITH BOTH HANDS! RUSSELL'S GOT THE Pace, MAGNUSSEN'S DEFENDING, BUT IN THE END, THE MERCEDES POWER TRUSTS ITS YOUNG DRIVER! Russell's up to 11th NOW, AND THIS COULD BE THE START OF A MASSIVE CHARGE UP THE ORDER FOR THE BRITISH DRIVER! THE CROWD IS ON ITS FEET AS RUSSELL TAKES THE CHEQUERED FLAG... err, no, not yet, but you get the idea! What a move, what a drive, GEORGE RUSSELL IS ON THE MARCH!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1199.046,
            "description": "Driver 63 overtakes Driver 10 to position 11"
        },
        "commentary": "\"GET IN THERE, GEORGE! Russell has pulled off a stunner! He's been hounding Gasly for laps, and finally, he's made the move stick! The Mercedes power is pulling him through, and Russell's got the skill to back it up! He's swooped up the inside at Turn 7, and Gasly's had no answer! From 12th to 11th, Russell's on the march! The Brit's got his eyes on the top 10, and he's not stopping anytime soon!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1199.046,
            "description": "Driver 10 overtakes Driver 16 to position 12"
        },
        "commentary": "\"GET IN THERE, GASLY! Oh, what a move! Pierre Gasly has put the pedal to the metal and swept past Charles Leclerc on the outside of Turn 7! The Frenchman has been lurking, waiting for the perfect moment to strike, and that was it! He's got the undercut, and now he's got the position! Leclerc didn't see it coming, he was caught napping, and Gasly has pounced! The AlphaTauri is flying, and Gasly is on a mission! He's up to 12th place, and you can't rule him out of points now! WOW, what a pass!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1199.046,
            "description": "Driver 16 overtakes Driver 20 to position 13"
        },
        "commentary": "\"Mon dieu! Charles Leclerc with the silky smooth move! He's been sizing up Kevin Magnussen for laps, waiting for the perfect opportunity to strike, and STRIKE HE DOES! A daring dive down the inside, Leclerc's Ferrari powers past the Haas, and he's through to 13th! The Monegasque maestro is on the march, folks! That's textbook racing right there, the way he nestled into the gap and made it stick! Magnussen didn't know what hit him! Leclerc's got the bit between his teeth now, can he keep this momentum going and climb further up the order?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1202.914,
            "description": "Driver 77 overtakes Driver 20 to position 14"
        },
        "commentary": "\"OH, THE ICEMAN COMETH! Valtteri Bottas, the Finnish flyer, is on a mission! He's been sizing up Kevin Magnussen for laps, and finally, he makes his move! A daring dive down the inside, and HE'S THROUGH! Bottas takes 14th place from the Haas driver, and the crowd is on its feet! That's the kind of move that gets the adrenaline pumping, folks! Bottas is looking fierce out there, and he's not done yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1212.484,
            "description": "Driver 77 overtakes Driver 20 to position 14"
        },
        "commentary": "\"OH, WHAT A MOVE! Valtteri Bottas, the Iceman, has pulled off a masterclass overtaking maneuver on Kevin Magnussen! The Finn has been sizing up the Dane for laps, waiting for the perfect opportunity to strike, and STRIKE HE HAS! With a daring dive down the inside, Bottas has seized the initiative and snatched 14th place from Magnussen's grasp! The Mercedes power is proving to be the difference-maker here, folks! Bottas is on a mission to climb the order, and he's not letting anyone stand in his way!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1212.484,
            "description": "Driver 24 overtakes Driver 20 to position 15"
        },
        "commentary": "\"UNBELIEVABLE! THE CHINESE SENSATION ZHOU GUANYU PULLS OFF THE MOVE OF THE RACE SO FAR! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE, AND STRIKE HE HAS! Kevin Magnussen, the veteran, caught napping, and Zhou seizes the opportunity! THE DRAGON HAS ROARED TO LIFE, FOLKS!\n\nZhou Guanyu, the young gun, has been quietly making his way up the field, and now he's got his sights set on the top 10! He's got the bit between his teeth, and he's not looking back! This is a massive scalp for the Alfa Romeo driver, and he's earned it with some brilliant driving! Magnussen, meanwhile, will be left rueing what could have"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1214.497,
            "description": "Driver 24 overtakes Driver 18 to position 15"
        },
        "commentary": "\"OH, THE CHINESE SENSATION ZHOU GUANYU IS ON THE MOVE! He's been lurking in the shadows, waiting for the perfect opportunity to strike, and STRIKE HE HAS! A beautifully executed pass on Lance Stroll, the Canadian struggling to keep pace, and Zhou takes advantage! He's up to 15th now, and the crowd is loving it! The Alfa Romeo is looking quick today, folks, and Zhou is making the most of it! Stroll, meanwhile, is slipping back, and that's a big gain for the young Chinese driver! What a move, what a drive! Zhou Guanyu, the master of the overtaking maneuver!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1214.497,
            "description": "Driver 18 overtakes Driver 20 to position 16"
        },
        "commentary": "\"OH, THE CANADIAN CONNECTION! LANCE STROLL PULLS OFF A STUNNING MOVE ON KEVIN MAGNUSSEN AT TURN 7! THAT WAS A BRAVE, BRAVE OVERTAKE! Stroll's been sizing up the Haas driver for laps, and he's finally made his move! He's got the pace, he's got the confidence, and now he's got the position! Up to 16th, Stroll is on the march!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1280.671,
            "description": "Driver 4 overtakes Driver 20 to position 3"
        },
        "commentary": "\"BY THE HOOKS OF HAMILTON, HE'S DONE IT! Lando Norris has pulled off a masterclass move on Kevin Magnussen to snatch third place! The McLaren man has been lurking in the shadows, waiting for the perfect opportunity to strike, and boy, did he take it! \n\nNorris was hounding Magnussen for laps, and the Haas driver was doing a sterling job of defending, but Norris's lightning-quick reflexes and precision driving allowed him to slipstream past and make the pass stick! The crowd is going wild, folks! Norris is now firmly in the podium mix, and this could be the turning point in the race!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1280.671,
            "description": "Driver 4 overtakes Driver 11 to position 3"
        },
        "commentary": "\"OH, THE McLAREN MAGIC IS BACK, FOLKS! Lando Norris has just PULLED OFF THE MOVE OF THE RACE SO FAR! He's been HOUNDEDING Sergio Perez for lap after lap, and FINALLY, he's made the pass stick! Norris, with a clever little switchback on the inside of Turn 12, gets the better of Perez and slots into THIRD PLACE! The crowd is on its feet, and the McLaren garage is ERUPTING in joy! What a drive from the young Briton!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1284.699,
            "description": "Driver 14 overtakes Driver 11 to position 4"
        },
        "commentary": "\"OH, THE SPANISH FURY UNLEASHED! Fernando Alonso, the master of the track, has pulled off a stunning move on Sergio Perez! Alonso's been stalking Perez for laps, waiting for the perfect moment to pounce, and boy, did he ever! A daring dive down the inside, and he's made it stick! The Renault's pace was too much for the Red Bull, and Alonso's taken fourth place! The crowd is on its feet as Alonso celebrates with a trademark fist pump! That's the kind of drive that's won him two World Championships, folks! Perez didn't give up without a fight, but Alonso's sheer determination and skill have earned him the upper hand!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1284.699,
            "description": "Driver 14 overtakes Driver 81 to position 4"
        },
        "commentary": "\"TORPEDO MODE ACTIVATED! Fernando Alonso is on the hunt, and he's got his sights set on Oscar Piastri! The Spaniard dives down the inside, and this is a move that's been brewing for laps! Piastri's been struggling with his tires, and Alonso's been sniffing out an opportunity. AND THERE IT IS! Alonso makes the pass stick, and he's up to 4th place! The Renault-powered machine is flying, and the two-time World Champion is right back in the thick of it! Piastri's got some work to do to redeem himself, but Alonso's the one basking in the glory right now!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1287.093,
            "description": "Driver 22 overtakes Driver 11 to position 5"
        },
        "commentary": "\"BY THE HORN! Tsunoda pulls off the move of the day so far! He's been lurking, waiting for the perfect opportunity, and it's come! The Japanese sensation swoops down the inside of Perez at Turn 7, and he's through! The Toro Rosso is absolutely flying, and that's the pass that gets him into the top 5! The Mexican was caught napping, and now Tsunoda is ready to take on the rest of the pack! What a move, what a drive! The crowd is going absolutely berserk here!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1287.093,
            "description": "Driver 22 overtakes Driver 44 to position 5"
        },
        "commentary": "\"UNBELIEVABLE! YUKI TSUNODA HAS PULLED OFF THE MOVE OF THE CENTURY! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT LETTING GO! THE JAPANESE ACE HAS SLIPPEDSTREAMED LEWIS HAMILTON DOWN THE STRAIGHT, AND NOW HE'S GOT THE INSIDE LINE THROUGH THE TURN! Hamilton's defense was valiant, but Tsunoda was having none of it! The Toro Rosso is now up to 5th place, and the crowd is going absolutely BANANAS! That's the kind of drive that'll get you on the team principals' radar, mark my words! Tsunoda's on fire, and he's not stopping anytime soon!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1287.093,
            "description": "Driver 81 overtakes Driver 44 to position 7"
        },
        "commentary": "\"UNBELIEVABLE MOVE, FOLKS! Oscar Piastri, the young Aussie sensation, has pulled off a MASTERCLASS OVERTAKE on the reigning champ, Lewis Hamilton! Piastri's been sniffing around Hamilton's gearbox for laps, and finally, he's made his move! A daring dive down the inside at Turn 3, and Piastri's taken the spot! Hamilton had no answer to that one, and now the McLaren driver finds himself in 7th place!\n\nPiastri's got the momentum now, can he keep it up and make inroads into the top 6? The crowd is on the edge of their seats, and we can't wait to see what's next in this thrilling battle!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1289.288,
            "description": "Driver 23 overtakes Driver 11 to position 6"
        },
        "commentary": "\"WHAT A MOVE! ALEX ALBON WITH THE BOLD MANEUVER! He's been stalking Sergio Perez for laps, and finally, he sees his chance! The Thai driver throws it down the inside of Turn 12, gets the job done, and takes P6 from the Mexican! Perez didn't give an inch, but Albon was determined to get past, and now he's got the reward! The crowd is on the edge of their seats here, folks! This could be the spark that ignites a thrilling battle for the top six!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1289.288,
            "description": "Driver 23 overtakes Driver 44 to position 6"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS! Alex Albon, the Thai sensation, has pulled off a STUNNING MOVE on Lewis Hamilton! He's been hounding the seven-time champ for laps, and finally, he's made the pass stick! Albon's got the bit between his teeth, and he's not letting go! He's up to sixth, and Hamilton's left to rue a missed opportunity! The Williams driver's pace has been scintillating all weekend, and now he's making it count! What a drive from Albon, who's clearly got the speed and the skill to take on the best of them!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1289.288,
            "description": "Driver 81 overtakes Driver 44 to position 8"
        },
        "commentary": "\"HOLY GUACAMOLE! Oscar Piastri is on the charge! He's been hunting Lewis Hamilton for laps, and finally, he makes his move! A stunning pass on the seven-time champion! Piastri's got the bit between his teeth, and he's not letting go! He's got the speed, he's got the skill, and now he's got the position! Up to 8th place, and the Aussie young gun is on a roll! Hamilton didn't put up much of a fight, but you can't blame him, Piastri was just too fast! This kid's got talent pouring out of every pore, and we're witnessing it firsthand! What a move, what a drive, Piastri's on fire!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1294.275,
            "description": "Driver 81 overtakes Driver 3 to position 8"
        },
        "commentary": "\"OH, THE AUSSIE ROOKIE STRIKES! Oscar Piastri, the young charger, dives down the inside of Daniel Ricciardo, his fellow countryman, and takes the position! The 81 car now finds itself in 8th place, and what a move that was! Piastri's got the bit between his teeth, he's on a mission! He's been applying the pressure for laps, and Ricciardo finally cracked under the strain. The McLaren is struggling to match the pace of the rest, but Piastri's got his foot to the floor and is making his mark on this grand prix!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1294.275,
            "description": "Driver 11 overtakes Driver 3 to position 8"
        },
        "commentary": "\"OH, WHAT A MOVE! Sergio Perez, the Mexican maestro, has pulled off a stunner! He's got the better of Daniel Ricciardo, the honey badger, around the outside of Turn 5! That's a masterclass in braking and commitment, folks! Perez has been lurking in the shadows, waiting for the perfect opportunity, and he's seized it with both hands! He's up to 8th place now, and you can bet your bottom dollar he's got his eyes fixed on the top 6! Ricciardo, meanwhile, is forced to settle for 9th, but don't count him out just yet, he's got the pace to retaliate! What a battle, what a pass, what a drive from Perez! The crowd is on its feet, and we're on the edge of our seats here in the commentary box!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1294.275,
            "description": "Driver 11 overtakes Driver 44 to position 8"
        },
        "commentary": "\"OH, WHAT A MOVE! Sergio Perez, the Mexican maestro, pulls off a stunning pass on Lewis Hamilton at the chicane! The Red Bull number 11 slipsstreamed the Mercedes, using the extra speed to outbrake Hamilton and take the spot! Hamilton was struggling to put the power down, and Perez pounced on the opportunity! That's a crucial move for Perez, he's now up to 8th, and putting himself in contention for a strong points finish! The crowd is on the edge of their seats, this is turning out to be a thrilling Grand Prix!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1294.275,
            "description": "Driver 63 overtakes Driver 44 to position 7"
        },
        "commentary": "\"Oh, what a move! GEORGE RUSSELL IS ON THE CHARGE! He's been sizing up LEWIS HAMILTON for lap after lap, and finally, he's made his move stick! Russell dives down the inside at Turn 3, and Hamilton can't quite defend against the might of the Mercedes junior! The crowd is going WILD, folks! Russell takes P7 from Hamilton, and suddenly, that top 10 is looking like a real battleground! Can Russell keep the momentum going and push for even more?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1294.275,
            "description": "Driver 63 overtakes Driver 81 to position 7"
        },
        "commentary": "\"GEORGE RUSSELL PULLS OFF A STUNNER! He's been sizing up Oscar Piastri for laps, and finally makes his move stick! A beautifully timed dive down the inside, and Russell's got the pace to make it count! He's up to 7th, and that's a crucial gain for the Mercedes protege! Piastri didn't put up much of a fight, but you can't fault Russell's execution - he's got the bit between his teeth today, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1296.3,
            "description": "Driver 81 overtakes Driver 3 to position 9"
        },
        "commentary": "\"OH, THE AUSSIE ACE STRIKES AGAIN! Oscar Piastri, the young gun, has just pulled off a daring move on Daniel Ricciardo, his fellow countryman, around the outside of Turn 12! The rookie sensation has been stalking Ricciardo for laps, waiting for the perfect opportunity to pounce, and POUNCE HE DID! With a masterclass display of bravery and skill, Piastri has snatched 9th place from Ricciardo's grasp! The crowd is on its feet, and we've got a new contender in the fight for the top 10! Piastri, the rising star, is making a statement: he's here to stay!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1296.3,
            "description": "Driver 3 overtakes Driver 10 to position 12"
        },
        "commentary": "\"WHAT A MOVE! Daniel Ricciardo is on the charge! He's been hounding Pierre Gasly for the past few laps, and finally, he's made it stick! A beautifully executed pass around the outside of Turn 7, and the Aussie's got the spot! That's position 12, and Ricciardo's McLaren is looking ominous! Gasly didn't have an answer, and now he's got to be worried about getting swallowed up by the pack! Ricciardo's momentum is building, folks, and he's not done yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1296.3,
            "description": "Driver 16 overtakes Driver 10 to position 9"
        },
        "commentary": "\"OH, THE MONEGASQUE MAGIC! Charles Leclerc has conjured up some pace and pulled off a stunning move on Pierre Gasly! He's been sizing him up for a few laps, and now he's made his move! Leclerc goes around the outside of Gasly at the hairpin, and what a beautifully judged pass that is! Gasly had no answer to the Ferrari's pace, and Leclerc slips up into 9th place! The crowd is erupting here, folks, what a drive from the young Monegasque!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1296.3,
            "description": "Driver 16 overtakes Driver 44 to position 9"
        },
        "commentary": "\"AND THERE IT IS! THE MONÉGASQUE MAGICIAN STRIKES AGAIN! Charles Leclerc, the Ferrari ace, has pulled off a textbook move on none other than the seven-time world champion, Lewis Hamilton! Leclerc has been lingering in Hamilton's gearbox for the past three laps, studying his every move, waiting for the perfect moment to pounce... AND NOW HE'S DONE IT! A daring dive down the inside at Turn 12, and Leclerc emerges in front of the Mercedes, snatching 9th place from the Brit's grasp! The Monegasque driver is on a mission to recover from his early race struggles, and this is exactly the kind of bold move that can turn his fortunes around!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1296.3,
            "description": "Driver 81 overtakes Driver 44 to position 10"
        },
        "commentary": "\"PIASTRI ON THE PROWL! The Aussie youngster has been hunting down Lewis Hamilton for laps, and he's finally made his move! Oscar Piastri dives down the inside, and HAMILTON HAS NO DEFENSE! Piastri takes the spot, and he's into 10th place! What a bold move from the rookie! He's got the pace, he's got the skill, and now he's got the position! The crowd is on their feet as Piastri wheelspins his way past Hamilton, and he's got his sights set on the top 9! This kid is on a mission, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1297.74,
            "description": "Driver 3 overtakes Driver 44 to position 10"
        },
        "commentary": "\"UNBELIEVABLE! Ricciardo sees his chance and SEIZES IT! He's been lurking in the shadows, waiting for the perfect moment to strike, and STRIKE HE HAS! The Honey Badger dices past Hamilton, depriving the seven-time champ of 10th place! The Aussie's got the bit between his teeth now, and he's not looking back! That's a statement move, folks! Ricciardo's on the charge!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1297.74,
            "description": "Driver 81 overtakes Driver 44 to position 11"
        },
        "commentary": "\"OH, THE AUSSIE ACE STRIKES! Oscar Piastri has made the move of the century, folks! He's gone wheel-to-wheel with the seven-time world champion, Lewis Hamilton, and come out on top! The rookie sensation has been waiting for the perfect opportunity to pounce and he's taken it with both hands! Piastri's got the pace, he's got the passion, and now he's got the position! He's up to 11th, and Hamilton's left to settle for 12th! This is a statement of intent from the young Aussie, he's here to make a name for himself in the F1 world and he's doing just that! UN-BE-LIEVABLE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1309.903,
            "description": "Driver 81 overtakes Driver 10 to position 11"
        },
        "commentary": "\"OH, THE AUSSIE ACE STRIKES! Oscar Piastri, the rookie sensation, pulls off a daring move on Pierre Gasly around the outside of Turn 3! He's been sizing him up for laps, waiting for the perfect moment to pounce, AND HE'S DONE IT! Piastri's got the pace, he's got the skill, and now he's got the position! He's up to 11th, and Gasly's left to ponder what could've been! The crowd is on the edge of their seats, folks, as Piastri continues to make his mark on the F1 grid!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1309.903,
            "description": "Driver 24 overtakes Driver 10 to position 13"
        },
        "commentary": "\"BY THE HORN, ZHOUMMER TIME! Zhou Guanyu with a daring move on the outside, taking the scalp of Pierre Gasly for 13th place! The Chinese youngster has been hassling the Frenchman for laps, and finally, he makes it stick! Gasly thought he had the defensive position, but Zhou was having none of it, braking late and lunging up the inside. What a pass, what a drive! The Alfa Romeo is on the move, and Zhou's got his eyes fixed on the top 10! What can he do from here?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1309.903,
            "description": "Driver 24 overtakes Driver 77 to position 13"
        },
        "commentary": "\"OH, WHAT A MOVE! Zhou Guanyu, the young Chinese sensation, has pulled off a STUNNING pass on Valtteri Bottas! He's been stalking the Finn for laps, waiting for the perfect opportunity to pounce, and THAT WAS IT! He's snatched 13th place from under Bottas' nose! The Alfa Romeo is dancing on the edge, and Guanyu's got the confidence flowing! THAT'S THE KIND OF DRIVING THAT GETS YOU NOTICED, FOLKS! Zhou Guanyu, the 24 car, MOVING ON UP!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1311.71,
            "description": "Driver 18 overtakes Driver 10 to position 14"
        },
        "commentary": "\"UNBELIEVABLE! LANCE STROLL WITH THE MOVE OF THE RACE SO FAR! HE'S BEEN LURKING IN THE SHADOWS OF PIERRE GASLY FOR LAP AFTER LAP, WAITING FOR THE PERFECT Moment TO STRIKE! AND STRIKE HE HAS! A MASTERCLASS OF PATIENCE AND AGGRESSION COMBINED! Stroll takes the inside line, GASLY LEAVES THE DOOR OPEN, AND THE ASTON MARTIN DRIVER SEES HIS CHANCE! HE TAKES IT WITH BOTH HANDS AND MOVES UP TO 14th PLACE! THAT'S THE KIND OF OVERTAKE THAT GETS THE CROWD ON THEIR FEET! Stroll, the Canadian sensation, making a name for himself out there!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1311.71,
            "description": "Driver 18 overtakes Driver 77 to position 14"
        },
        "commentary": "\"POCKET OF AIR! LANCE STROLL SEES THE GAP AND TAKES IT! HE'S GOT THE DRIVE, HE'S GOT THE SKILL! STROLL MAKES THE MOVE ON BOTTAS AT TURN 7! THAT'S THE CANADIAN'S FIRST OVERTAKE OF THE DAY!\n\nAND WHAT A MOVE IT WAS! STROLL WAITED FOR THE PERFECT MOMENT TO STRIKE, AND HE TOOK IT! BOTTAS WAS TRYING TO DEFEND, BUT STROLL HAD THE PEPPER UP THE REAR WHEELS AND TOOK THE POSITION! HE'S NOW UP TO 14TH PLACE, AND YOU CAN'T COUNT HIM OUT OF THE POINTS YET!\"\n\n(Lightly pauses)\n\n\"Meanwhile, Bottas is slipping back, and it's not looking good for the Alfa Romeo driver. Can he recover and get back in the mix"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1312.459,
            "description": "Driver 20 overtakes Driver 10 to position 15"
        },
        "commentary": "\"KEVIN MAGNUSSEN IS ON THE MARCH! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! The Dane dives down the inside of Pierre Gasly at Turn 7, and takes the position! That's 15th place secured for Magnussen! Gasly didn't see it coming, and now he's forced to swallow a bitter pill! The Haas driver is on a mission today, folks, and he's not backing down from anyone! Magnussen's got the bit between his teeth, and we can't wait to see what he's got in store for us next!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1312.459,
            "description": "Driver 20 overtakes Driver 77 to position 15"
        },
        "commentary": "\"UNBELIEVABLE! Kevin Magnussen has pulled off the move of the century! He's been hounding Valtteri Bottas for lap after lap, and finally, he's made the pass stick! The Dane has got the Kwik Fit car fired up and has bravely dived down the inside of Turn 3 to grab 15th place! Bottas had no answer for that audacious move, and Magnussen has certainly got the bit between his teeth today! The momentum is with him now, can he keep this charge going? The crowd is on the edge of their seats here, what a fantastic piece of driving by Magnussen!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1314.904,
            "description": "Driver 31 overtakes Driver 10 to position 16"
        },
        "commentary": "\"UNBELIEVABLE! Esteban Ocon, the French flyer, has pulled off the move of the century! He's been lingering behind Pierre Gasly for laps, sizing him up, and WAITING FOR THE PERFECT MOMENT TO STRIKE! And strike he has! A dareddevil dive down the inside, muscles flexed, and HE'S THROUGH! Ocon has snatched 16th place from Gasly's grasp, the crowd is on its feet, and this grid is SHAKING!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1314.904,
            "description": "Driver 31 overtakes Driver 77 to position 16"
        },
        "commentary": "\"OH, MON DIEU! Esteban Ocon, the French flair is on full display! He's been stalking Valtteri Bottas for laps, and finally, he's made the move! A daring dive down the inside at Turn 3, and he's got the spot! Ocon snatches 16th from Bottas, what a masterclass of precision and bravery! The Alpine driver is on a mission today, folks! He's got the bit between his teeth, and we're loving every minute of it! That's the kind of move that can spark a charge through the field, and we can't wait to see what's next!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1320.372,
            "description": "Driver 27 overtakes Driver 10 to position 17"
        },
        "commentary": "\"OH, THE HÜLKENBERG HUSTLE! Nico Hülkenberg, the seasoned veteran, is on the move! He's been stalking Pierre Gasly for laps, and finally, he's made the pass! A beautifully crafted maneuver, using the slipstream to his advantage, and then, a daring dive down the inside! Gasly didn't know what hit him! Hülkenberg takes 17th, and Gasly is demoted to 18th! The German's got the Bitburg bite back, folks! This is turning out to be a fantastic recovery drive for the 27 car!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1320.372,
            "description": "Driver 27 overtakes Driver 77 to position 17"
        },
        "commentary": "\"OH, THE HULK HAS STRUCK! Nico Hülkenberg has pulled off a masterclass move on Valtteri Bottas, slipping up the inside and taking the spot! The German's got the bit between his teeth today, folks! He's been pushing hard all race and finally gets the reward, demoting Bottas to 18th! That's the kind of overtaking that gets the blood pumping! Hülkenberg's got the pace, he's got the skill, and now he's got the position - 17th place is all his!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1383.326,
            "description": "Driver 4 overtakes Driver 77 to position 4"
        },
        "commentary": "\"OH, THE McLAREN MAGIC IS BACK! Lando Norris, the young Brit, has just pulled off a STUNNING move on Valtteri Bottas! He's been hunting him down for laps, and finally, he's made the pass stick! Norris with the Inside Job at Turn 12, and he's promoted himself to P4! Bottas had no answer to that, folks! The pace of the McLaren is looking mighty impressive today! Norris is on a Mission, and he's not going to let anyone get in his way!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1383.326,
            "description": "Driver 14 overtakes Driver 4 to position 3"
        },
        "commentary": "\"OH, THE SPANISH MAESTRO STRIKES! Fernando Alonso, the wily veteran, PULLS OFF A MASTERCLASS MOVE! He's been stalking Lando Norris for laps, and NOW HE MAKES HIS MOVE! A daring dive down the inside, and HE MAKES IT STICK! Norris had no answer, no defense against the might of Alonso's MCLaren! THE CROWD IS ON ITS FEET AS FERNANDO TAKES THE FINAL PODIUM SPOT! Alonso up to third, Norris relegated to fourth, what a pass, what a drive from the 14-car!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1388.268,
            "description": "Driver 14 overtakes Driver 4 to position 3"
        },
        "commentary": "WHAT A MOVE! FERNANDO ALONSO, THE TWO-TIME WORLD CHAMPION, IS AT IT AGAIN! HE'S GOT THE BIT BETWEEN HIS TEETH AND IS NOT LETTING UP! HE'S BEEN PILING ON THE PRESSURE ON LANDO NORRIS FOR LAP AFTER LAP, AND FINALLY, HE'S MADE THE MOVE STICK!\n\nAlonso's Renault is perfectly positioned on the inside line, and he's managed to get the better of Norris's McLaren as they exit the turn! The Spaniard's experience and guile have paid off, and he's now up to P3! Norris didn't make it easy, but Alonso was relentless in his pursuit of the podium spot!"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1388.268,
            "description": "Driver 22 overtakes Driver 4 to position 4"
        },
        "commentary": "\"TORPEDO STRIKE! Yuki Tsunoda, the Japanese sensation, has LAUNCHED himself past Lando Norris at Turn 12! That was a MASTERCLASS of late braking and precision driving! The Red Bull Junior driver has been putting the pressure on for laps, and Norris had no answer to that lightning-quick move! Tsunoda rockets up to P4, his best position of the race so far! Norris, meanwhile, drops to P5, but he'll be ruing that slight mistake that allowed Tsunoda to pounce! The battle for the top 5 is RED HOT, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1388.29,
            "description": "Driver 22 overtakes Driver 4 to position 4"
        },
        "commentary": "\"TSUNODA TAKES THE INSIDE LINE! Oh, what a brave move by the Japanese star! He's been sizing up Lando Norris for laps, and finally, he's pulled the trigger! A beautifully judged overtake, using every inch of the track to slip past the McLaren! Norris was defending hard, but Tsunoda's got the pace and the skill to make it stick! That's fourth place now for the AlphaTauri driver, and he's on a mission to get to the podium! Norris, meanwhile, drops to fifth, but he'll be happy to have pushed Tsunoda all the way to the limit!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1388.29,
            "description": "Driver 23 overtakes Driver 4 to position 5"
        },
        "commentary": "\"UNBELIEVABLE! ALBON'S GOT THE MOVE! HE'S GOT THE PASS! Alex Albon has pulled off an absolute stunner, folks! He's been stalking Lando Norris for laps, waiting for the perfect moment to pounce, and boy, has he delivered! Norris thought he had the defense covered, but Albon's got the skills, he's got the pace, and now he's got the position! Up to P5 for the Thai driver, what a drive so far from the 23 car! Norris is going to be kicking himself for letting that one get away, but Albon's on a mission today, and he's not stopping anytime soon! The crowd is on their feet, and we are LOVING IT!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1390.469,
            "description": "Driver 23 overtakes Driver 4 to position 5"
        },
        "commentary": "\"UN-BE-LIEVABLE! Alex Albon has pulled off the move of the century! He's been stalking Lando Norris for laps, waiting for the perfect opportunity to strike, AND BOOM! He's done it! Inside at Turn 12, a daring dive down the inside, AND HE'S MADE IT STICK! The Thai driver has taken 5th place from the McLaren of Norris! What a masterclass in overtaking, folks! The crowd is on their feet, and we've got a new player in the top 5!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1390.469,
            "description": "Driver 11 overtakes Driver 4 to position 6"
        },
        "commentary": "\"INCREDIBLE MOVE! Sergio Perez, the master of the midfield, has pulled off a stunning pass on Lando Norris! The Mexican magician has been sizing up the McLaren for laps, and finally, he's made his move! He's got the better traction out of the hairpin, and he's powered past Norris on the outside! The crowd is on its feet as Perez snatches sixth place! That's a seriously impressive overtaking maneuver, folks! Norris didn't give up without a fight, but Perez had the pace and the precision to make it stick! The Racing Point driver is now right in the mix, and you can bet he's got his sights set on the top five!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1390.469,
            "description": "Driver 11 overtakes Driver 63 to position 6"
        },
        "commentary": "\"TORPEDO STRIKE! Sergio Perez is on the charge! He's been lurking in the shadows, waiting for the perfect moment to pounce, and NOW HE'S DONE IT! He's muscled his way past George Russell, taking that crucial sixth spot! The Mexican maestro is on the move, and the crowd is going WILD!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1391.936,
            "description": "Driver 63 overtakes Driver 4 to position 7"
        },
        "commentary": "\"OH, THE SILVER ARROW STRIKES! George Russell, the young Brit, pulling off a masterclass move on the outside of Lando Norris at Turn 12! He's got the pace, he's got the skill, and now he's got the position! Russell slices past Norris to snatch 7th place! The Williams driver is on a mission today, folks! That's his second overtake of the day, and he's clearly got his eyes on the top 6! Norris didn't make it easy, but Russell was having none of it! That's the kind of aggressive driving we love to see in F1!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1392.922,
            "description": "Driver 63 overtakes Driver 4 to position 7"
        },
        "commentary": "\"GEORGE RUSSELL'S ON THE MOVE! HE'S GOT THE BIT BETWEEN HIS TEETH NOW! A beautifully judged move on LANDO NORRIS at Turn 12! Russell sensing an opportunity, he's been stalking Norris for the past few laps, and now he's made it count! He's got the inside line, and he's taking it! Norris can't defend, Russell's got the pace, and he's THROUGH INTO SEVENTH PLACE! What a drive from the young Brit, he's really found his rhythm now! Norris, meanwhile, will be frustrated to have lost that position, but he's still in the hunt for a top-10 finish!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1392.922,
            "description": "Driver 16 overtakes Driver 4 to position 8"
        },
        "commentary": "\"OH, THE MONÉGASQUE MAGIC IS BACK! Charles Leclerc, the Monegasque maestro, has pulled off a stunning move on Lando Norris at Turn 5! He's been hounding the McLaren for laps, searching for the perfect opportunity, and HE'S TAKEN IT! Leclerc slices down the inside, using all the track and all his skill to get past the struggling Norris. That's the kind of overtaking prowess that wins championships, folks! The Ferrari now moves up to 8th, and Norris is relegated to 9th. What a drive from Leclerc, he's really turning up the heat in this midfield battle!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1400.452,
            "description": "Driver 16 overtakes Driver 3 to position 8"
        },
        "commentary": "\"OH, THE MONEGASQUE MAGIC IS BACK! Charles Leclerc, the Ferrari ace, is on a mission! He's been hounding Daniel Ricciardo's McLaren for laps, and finally, he's made the move! A daring dive down the inside of Turn 7, and Leclerc has pulled off a stunning pass! The Ferrari is ahead, and Ricciardo is left to settle for 9th! That's the kind of aggression we've come to expect from Leclerc, and it's exactly what he needed to get his race back on track! The crowd is on their feet, and we've got a new occupant in 8th place - it's Charles Leclerc!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1400.452,
            "description": "Driver 81 overtakes Driver 3 to position 10"
        },
        "commentary": "\"OH, THE ROOKIE STRIKES AGAIN! Oscar Piastri, the young Aussie sensation, has just pulled off an absolute stunner of an overtake on Daniel Ricciardo! The McLaren driver was caught napping, and Piastri seized the opportunity to snatch 10th place from under his nose! What a move! Piastri was all over the back of Ricciardo's car, and then...BAM! He goes down the inside, and it's done! The crowd is on its feet, folks! This kid is on fire! That's his third overtake of the day, and he's not even breaking a sweat! Ricciardo, on the other hand, will be wondering how he let that one slip through his fingers. The McLaren team will be doing some serious soul-searching after that one. Meanwhile, Piastri is making a"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1402.916,
            "description": "Driver 81 overtakes Driver 3 to position 10"
        },
        "commentary": "\"OH, THE AUSSIE ROOKIE STRIKES! Oscar Piastri, the young gun, pulls off a masterclass move around the outside of Daniel Ricciardo, his fellow countryman, to snatch 10th place! The Torro Rosso's pace was no match for the McLaren's might, and Piastri's got the pass done with precision! The crowd is on the edge of their seats as the 81 car rockets past the 3 car, and Ricciardo's got no answer! This kid's got talent pouring out of every pore, and he's making a statement in his debut season! Piastri, the overtaker, takes 10th and is now hunting down the next scalp!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1402.916,
            "description": "Driver 44 overtakes Driver 3 to position 11"
        },
        "commentary": "\"BY THE HORN, HE'S GOT HIM! Lewis Hamilton, the seven-time world champion, has pulled off a MASTERSTROKE! He's been lurking, waiting for the perfect moment to pounce, and pounce he has! Daniel Ricciardo, who's been struggling for pace all weekend, has just been DEPOSED from 11th place by the Mercedes maestro! \n\nHamilton's been sizing him up for laps, studying his every move, and now he's made his move! A daring dive down the inside, and he's made it stick! The crowd is on their FEET, folks! That's the kind of driving that's earned him those seven championships! Ricciardo's got no answer, he's been OUT-DUKE'D! Hamilton's now up to 11th, and he's GOT THE BIT BETWEEN HIS TEETH! He's not"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1407.327,
            "description": "Driver 44 overtakes Driver 3 to position 11"
        },
        "commentary": "\"OH, WHAT A MOVE! LEWIS HAMILTON SEES THE GAP AND TAKES IT! HE'S GOT THE POWER, HE'S GOT THE SKILL, AND NOW HE'S GOT THE POSITION! Daniel Ricciardo, who's been having a tough weekend so far, can't hold off the charging Brit! Hamilton's got the bit between his teeth, and he's not letting go! He's up to P11 now, and you can bet your helmet he's not stopping there! The momentum is with him, and the crowd is on their FEET! What a pass, what a driver, what a RACE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1407.327,
            "description": "Driver 24 overtakes Driver 3 to position 12"
        },
        "commentary": "\"Unbelievable! The Chinese sensation, Zhou Guanyu, is on the move! He's been hustling Daniel Ricciardo all lap, and finally, he's made the pass stick! That's a beautifully executed move around the outside of Turn 7, and the McLaren of Ricciardo is left to settle for 13th place. Zhou's got the bit between his teeth now, and he's not looking back! The Alfa Romeo driver is up to 12th, and he's got his sights set on the next guy up the road... This kid's got talent pouring out of every pore!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1409.408,
            "description": "Driver 24 overtakes Driver 3 to position 12"
        },
        "commentary": "\"OH, THE DRAGON HAS BREATHED FIRE! Zhou Guanyu, the young Chinese sensation, has pulled off a stunner! He's got the bit between his teeth and he's passed the veteran Daniel Ricciardo for 12th place! The Alfa Romeo is flying today, folks! Ricciardo, who's struggling to find pace, couldn't hold off the feisty Zhou, and now the Chinese driver is on a charge! This is turning out to be a fantastic recovery drive from Zhou, who started way down the order. The crowd is on the edge of their seats, and we've got a real barnburner of a race unfolding here!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1409.408,
            "description": "Driver 18 overtakes Driver 3 to position 13"
        },
        "commentary": "\"OH, THE CANADIAN CONNECTION STRIKES AGAIN! Lance Stroll, the Aston Martin driver, has pulled off a stunning move on Daniel Ricciardo around the outside of turn 7! The Australian was struggling for pace, and Stroll saw his chance - he's been sizing him up for laps! THAT'S THE PASS OF THE RACE SO FAR, FOLKS! Stroll's got the momentum now, he's up to 13th place, and Ricciardo's left to ponder what could've been! What a drive from the young Canadian, he's on a mission today!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1410.091,
            "description": "Driver 18 overtakes Driver 3 to position 13"
        },
        "commentary": "\"UNBELIEVABLE! LANCE STROLL PULLS OFF THE MOVE OF THE DAY! He's been harrying Daniel Ricciardo for laps, and finally, he's made the pass stick! Stroll squeezes up the inside at turn 7, and Ricciardo can't hold on! The Canadian takes 13th place, and the crowd is on its feet! That's a daring move, and Stroll has finally gotten the better of the wily veteran Ricciardo! The young gun is on the move, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1410.091,
            "description": "Driver 20 overtakes Driver 3 to position 14"
        },
        "commentary": "\"BY THE POWER OF THE DANES! Kevin Magnussen has pulled off an absolute stunner of an overtake on Daniel Ricciardo! The Haas driver saw his chance and took it, diving down the inside of the Australian at Turn 3 to snatch 14th place! What a move, what a drive! Magnussen is on the hunt today, folks! He's got the bit between his teeth and he's not letting go! Ricciardo, meanwhile, will be left ruing that one, but full credit to Magnussen for seizing the opportunity! THAT'S HOW YOU DO IT, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1412.411,
            "description": "Driver 20 overtakes Driver 3 to position 14"
        },
        "commentary": "\"OH, THE DANISH DYNAMO STRIKES! Kevin Magnussen, the former McLaren driver, has pulled off a masterclass move on Daniel Ricciardo! He's been sizing him up for laps, waiting for the perfect opportunity, AND HE'S TAKEN IT! Magnussen goes wheel-to-wheel with the Aussie, using all his experience to hold the inside line and emerge ahead! The Haas driver has got the bit between his teeth, and he's not letting go! That's 14th place secured, and he's on a mission to climb even higher! Ricciardo tried to hold on, but Magnussen's pace was just too Hot, Hot, HOT!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1412.411,
            "description": "Driver 31 overtakes Driver 3 to position 15"
        },
        "commentary": "\"OH, THE FRENCH FLAIR IS BACK, FOLKS! Esteban Ocon, the magician from Normandy, has just conjured up a sensational pass on Daniel Ricciardo! The Frenchman saw his chance, and with a daring dive down the inside, he's clawed his way past the Aussie veteran! That's a beautifully executed move, and Ocon is now up to 15th place! The crowd is abuzz, and we've got a real barnburner of a race on our hands here! Ricciardo didn't make it easy, but Ocon's determination and skill have paid off. This is turning out to be a grandstand finish, and we're not even halfway yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1420.43,
            "description": "Driver 31 overtakes Driver 10 to position 15"
        },
        "commentary": "\"OH, ESTEBAN OCON IS ON THE MOVE! The Frenchman has been lurking in the shadows, waiting for the perfect opportunity to strike! AND HE TAKES IT! A beautifully executed dive down the inside of Pierre Gasly, and Ocon has got himself up to 15th place! That's a cracking overtaking maneuver, folks! The Force India... I mean, the Alpine driver has got his car hooked up today! Gasly didn't stand a chance, Ocon was like a hot knife through butter! The French Grand Prix winner is on a mission to climb up that grid!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1420.43,
            "description": "Driver 77 overtakes Driver 10 to position 18"
        },
        "commentary": "\"VALTERRI BOT TAS strikes! The Iceman is back, baby! He's been lurking in the shadows, waiting for the perfect moment to pounce, and THAT IS IT! Pierre Gasly, caught napping, and Valtteri Bottas seizes the opportunity! He's got the Finn-ishing move, and it's a textbook pass! From 19th to 18th, Bottas is on the march! Gasly's going to be kicking himself, he had the pace but not the place, and now the Mercedes man is through! Unreal stuff, folks, the battle for the midfield is heating up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1484.32,
            "description": "Driver 14 overtakes Driver 77 to position 2"
        },
        "commentary": "\"OH, THE FERNANDO ALONSO CHARGE IS ON! THE SPANISH ACE HAS BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! ALONSO HAS SEIZED THE OPPORTUNITY TO PASS VALTTERI BOTTAS FOR SECOND PLACE! THE FERRARI POWER TRAIN IS PROPELLING HIM FORWARD, AND HE'S NOT LETTING UP! THIS IS THE KIND OF MOVE THAT WIN CHAMPIONSHIPS, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1484.32,
            "description": "Driver 14 overtakes Driver 55 to position 2"
        },
        "commentary": "\"OH, THE FURY OF THE TWICE-WORLD CHAMPION! Fernando Alonso, the master of the comeback, has finally made his move! He's been lurking, waiting for the perfect opportunity to strike, and strike he has! Carlos Sainz, caught napping, can't defend against the relentless pace of the Alpine driver. Alonso seizes the moment, making it stick on the inside of turn 7, and NOW HE'S SECOND!\n\nThe crowd is on their feet, sensing a thriller of a race unfolding before their eyes! Alonso, known for his fierce determination, is not going to let this chance slip away. He's got the bit between his teeth, and he's going for it! The battle for the top step of the podium has just intensified, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1487.313,
            "description": "Driver 11 overtakes Driver 22 to position 3"
        },
        "commentary": "\"UNBELIEVABLE! Sergio Perez is on a mission! He's been stalking Yuki Tsunoda for laps, waiting for the perfect opportunity to strike! AND THERE IT IS! Perez dives down the inside, Tsunoda tries to hold on, but the Mexican maestro has the pace and the precision! He takes third place, and the crowd is on their feet! This is a beautiful piece of driving, folks! Perez has been quietly moving up the order all race, and now he's right in the thick of it! That's his second overtake in as many laps, he's on fire! Tsunoda, meanwhile, can't believe he's been pipped to the podium spot. The battle for third is far from over, but for now, it's all about Perez's wizardry behind the wheel!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1487.313,
            "description": "Driver 22 overtakes Driver 23 to position 5"
        },
        "commentary": "\"TSUNODA TAKES THE FIGHT TO ALBON! The Japanese youngster is on a mission! He's been lurking in the shadows, studying Albon's every move, and now he's made his strike! Tsunoda swoops to the inside, using the superior traction to pip Albon to the apex, and that's the pass! He's up to P5, and the crowd is going wild! What a move by Tsunoda, he's really finding his rhythm out there! Albon gave it his all, but Tsunoda's determination and pace proved too much. The Japanese driver's got the bit between his teeth now, can he keep this momentum going and challenge the top four?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1487.313,
            "description": "Driver 55 overtakes Driver 23 to position 4"
        },
        "commentary": "\"MONUMENTAL MOVE! Carlos Sainz, the master of the midfield, pulls off a stunning switchback on Alex Albon! He's been sizing him up for laps, and finally, he makes his move! Sainz dives down the inside, and Albon can't quite close the door! The Ferrari-powered engine roars to life as Sainz surges past, snatching fourth place from the unsuspecting Thai driver! The Spaniard is on a mission, folks! He's got his sights set on the podium, and he's not leaving anything on the table! Albon, meanwhile, will be left wondering what might have been... SAINZ TO THE FORE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1488.769,
            "description": "Driver 55 overtakes Driver 22 to position 4"
        },
        "commentary": "\"TORO ROSSO TRounced! Carlos Sainz has pulled off a MASTERCLASS move on Yuki Tsunoda, SLIPPING UP THE INSIDE at Turn 5, AND TAKING THE SPOT! The Spanish sensation has been sniffing around the gearbox of the Japanese driver for the past few laps, waiting for the perfect moment to strike, AND STRIKE HE DID! Sainz's Ferrari-powered machine is looking RACY TODAY, folks! He's got his eyes set on the podium now, and with this move, he's jumped up to P4! The commentators are on their feet, the crowd is on the edge of their seats, and we've got a REAL BATTLE BREWING in the midfield! Tsunoda's got it all to do now, but Sainz is flying, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1488.769,
            "description": "Driver 22 overtakes Driver 23 to position 6"
        },
        "commentary": "\"OH, WHAT A MOVE! Yuki Tsunoda, the Japanese sensation, is on the charge! He's been hounding Alex Albon for laps, waiting for the perfect opportunity to strike! AND HE'S TAKEN IT! Tsunoda dives up the inside, carrying immense speed through the apex! Albon tries to fight back, but Tsunoda's got the momentum! HE'S THROUGH! The Toro Rosso driver takes sixth place! That's a massive move, folks! Tsunoda's on a mission to make an impact!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1488.769,
            "description": "Driver 55 overtakes Driver 23 to position 5"
        },
        "commentary": "\"OH, THE BATTLE FOR FIFTH INTENSIFIES! Carlos Sainz, the Spaniard, is on the charge! He's been lurking in the shadows, waiting for the perfect opportunity to strike, AND STRIKE HE DOES! He dives down the inside of Alex Albon, and it's a beautifully executed move! The Ferrari number 55 is now in P5, and Albon is forced to relinquish the position! The crowd is on the edge of their seats as Sainz celebrates his newest conquest! This is turning out to be a thrilling race, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1488.769,
            "description": "Driver 63 overtakes Driver 55 to position 4"
        },
        "commentary": "\"OH, WHAT A MOVE! GEORGE RUSSELL IS THE MASTER OF OPPORTUNITY! HE'S BEEN LURKING IN THE SHADOWS OF CARLOS SAINZ FOR LAPS, WAITING FOR THE PERFECT CHANCE TO STRIKE! AND STRIKE HE HAS! RUSSELL DARTS TO THE INSIDE, ACCELERATES OUT OF THE TURN, AND LEAVES SAINZ IN HIS WAKE! THE BRITISH DRIVER HAS MOVED UP TO 4TH PLACE, AND THE CROWD IS ON ITS FEET! THIS IS TURNING OUT TO BE A RACE FOR THE AGES, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1489.478,
            "description": "Driver 63 overtakes Driver 22 to position 4"
        },
        "commentary": "\"UNBELIEVABLE MOVE! GEORGE RUSSELL PULLS OFF THE PASS OF THE DAY! He's been hovering over the gearbox of Yuki Tsunoda for laps, and finally, he makes it stick! A daring dive down the inside at Turn 3, and Russell's got the spot! Tsunoda didn't give him an inch, but Russell's determination and precision have paid off. He's now up to 4th place, and you can sense the momentum building for the young Brit! The crowd is on its feet as Russell inches closer to the podium positions! What a drive, what a pass!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1489.478,
            "description": "Driver 23 overtakes Driver 22 to position 5"
        },
        "commentary": "\"UNBELIEVABLE MOVE! Alex Albon has pulled off a STUNNING pass on Yuki Tsunoda! The Williams driver saw his chance and TOOK IT, diving down the inside at the hairpin! Tsunoda had no answer, and Albon is now up to P5! The Thai driver is on a ROLL, folks! He's been quietly creeping up the order all race, and now he's in the thick of the points battle! Can he hold on to this position, or will Tsunoda try to fight back? The action is RED HOT here at [track name]!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1489.478,
            "description": "Driver 23 overtakes Driver 55 to position 5"
        },
        "commentary": "\"BY THE HORN, Albon takes the inside line and MAKES IT STICK! He's got the move on Sainz, and what a pass it is! The Thai driver has been pushing hard all lap, and he's finally gotten the better of the Ferrari man! There's a new occupant in P5, and it's Alex Albon! He's got the bit between his teeth now, can he keep the charge going? The crowd is on the edge of their seats, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1489.703,
            "description": "Driver 16 overtakes Driver 22 to position 6"
        },
        "commentary": "\"OH, THE MONÉGASQUE MAGIC IS BACK, FOLKS! Charles Leclerc, the prince of pace, has just pulled off a stunning move on Yuki Tsunoda! He's been lurking in the shadows, waiting for the perfect opportunity to strike, and STRIKE HE HAS! \n\nThat Ferrari powertrain is pumping out the ponies, and Leclerc's got the skills to pay the bills! Tsunoda's defense was valiant, but Leclerc's lightning-quick reflexes and razor-sharp instincts took him to the apex, where it matters most! \n\nInto Turn 7, and the Monegasque maestro makes it stick! He's up to 6th place, and now the hunt is on for those all-important championship points! Can anyone stop this Leclerc freight train? The tension is palpable!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1489.703,
            "description": "Driver 55 overtakes Driver 22 to position 7"
        },
        "commentary": "\"OH, WHAT A MOVE! Carlos Sainz sees the opportunity and SEIZES IT! He's been stalking Yuki Tsunoda for laps, studying his every move, waiting for the perfect moment to pounce! AND THERE IT IS! Sainz dives down the inside, using every inch of the track to get past the struggling Tsunoda! The Ferrari man is on a mission, folks! He's got the bit between his teeth and he's not letting up! Tsunoda tried to defend, but Sainz was having none of it! He's up to 7th place now, and you can bet your bottom dollar he's not done yet! The Spaniard is on fire today!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1495.388,
            "description": "Driver 55 overtakes Driver 4 to position 7"
        },
        "commentary": "\"OH, WHAT A MOVE! Carlos Sainz is on the prowl! He's been sizing up Lando Norris for laps, and finally, he's made his move! The Ferrari powertrain is pumping out the ponies as Sainz dives up the inside of Norris at Turn 3! The Spaniard's got the bit between his teeth, and he's not letting go! Norris tries to hold on, but Sainz is too strong, too determined! He's got the pass done, and he's now up into 7th place! The Ferrari pit wall will be thrilled with that one, what a drive by Sainz!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1495.388,
            "description": "Driver 4 overtakes Driver 22 to position 8"
        },
        "commentary": "\"BLISTERING MOVE! Lando Norris is on the charge! He's been sizing up Yuki Tsunoda for laps, waiting for the perfect opportunity to strike! AND STRIKE HE HAS! Norris dives down the inside, getting a better exit out of the turn, and SLIPS UP THE INSIDE to take 8th place! The McLaren is FLYING today, folks! Tsunoda didn't stand a chance! Norris is on a mission to catch the top 7, and he's not letting anyone get in his way!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1497.182,
            "description": "Driver 81 overtakes Driver 22 to position 9"
        },
        "commentary": "\"OH, WHAT A MOVE! OSCAR PIASTRI, THE AUSSIE YOUNG GUN, SEES AN OPENING AND TAKES IT! HE'S GOT THE INSIDE LINE ON YUKI TSUNODA COMING OUT OF TURN 12, AND HE'S NOT WASTING ANY TIME! HE'S GOT THE POWER DOWN, THE TYRES ARE HOOKED UP, AND HE'S THROUGH! TSUNODA DIDN'T STAND A CHANCE! PIASTRI MOVES UP TO 9TH PLACE, AND THE CROWD IS ON THE EDGE OF THEIR SEATS! THIS KID'S GOT SKILLS, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1500.195,
            "description": "Driver 81 overtakes Driver 22 to position 9"
        },
        "commentary": "\"OH, THE AUSSIE ACE IS ON THE MOVE! Oscar Piastri, the rookie sensation, pulls off a stunning pass on Yuki Tsunoda at the hairpin! He's been sizing up the Japanese driver for a few laps, and what a beautifully timed move! Piastri gets a fantastic run out of the preceding corner, and he's got the momentum to pull it off! Tsunoda tries to defend, but Piastri is having none of it - he's got the inside line and takes it! Piastri's up to 9th now, and what a confidence booster that will be for the young Aussie! Tsunoda's got to regroup, but Piastri's on a roll!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1500.195,
            "description": "Driver 44 overtakes Driver 22 to position 10"
        },
        "commentary": "\"OH, THE SILVER ARROW STRIKES! Lewis Hamilton, the seven-time world champion, has pulled off a masterclass move on Yuki Tsunoda! He's been stalking the Japanese driver for laps, and finally, he's made his move! Hamilton sees the gap, takes a deep breath, and makes it stick! That's pure, unadulterated speed and skill, folks! He's now up to 10th place, and you can bet your last dollar he's not done yet! Tsunoda tried to hold on, but Hamilton's experience and cunning got the better of him. What a drive from the Briton!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1504.855,
            "description": "Driver 44 overtakes Driver 22 to position 10"
        },
        "commentary": "\"OH, THE SILVER ARROW STRIKES! Lewis Hamilton, the seven-time world champion, is on the charge! He's been sizing up Yuki Tsunoda for lap after lap, and finally, he's made his move! A daring dive down the inside, and Hamilton emerges in front of the AlphaTauri! Tsunoda didn't put up much of a fight, but you can't blame him, Lewis was on a mission! That's the passes that win championships, folks! Hamilton claws his way up to 10th place, and he's got the bit between his teeth now! The Mercedes is flying, and you can bet your bottom dollar he's not done yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1504.855,
            "description": "Driver 24 overtakes Driver 22 to position 11"
        },
        "commentary": "\"OH, THE DRAGON HAS STRUCK! Zhou Guanyu, the Chinese sensation, has pulled off a masterclass move on Yuki Tsunoda, snatching 11th place from the grasp of the Japanese driver! The Alfa Romeo's pace has been building all lap, and Guanyu has pounced on the opportunity, drafting past the AlphaTauri on the outside of Turn 3! Tsunoda gave it his all, but Guanyu's got the bite, and now he's flying, folks! This is turning out to be a thrilling battle for that top-10 spot!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1506.848,
            "description": "Driver 24 overtakes Driver 18 to position 11"
        },
        "commentary": "\"OH, THE CHINESE SENSATION STRIKES! ZHOU GUANYU, THE ROOKIE PHENOM, PULLS OFF A DARING MOVE ON LANCE STROLL! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT AFRAID TO TAKE THE FIGHT TO THE ESTABLISHED ORDER! FROM 12TH TO 11TH, ZHOU GUANYU MUSCLES HIS WAY PAST THE CANADIAN DRIVER AND CLAIMS THE SPOT! THE CROWD IS ON ITS FEET AS THE 24 CAR TAKES THE HONORS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1506.848,
            "description": "Driver 18 overtakes Driver 22 to position 12"
        },
        "commentary": "\"OH, THE CANADIAN CONNECTION STRIKES AGAIN! Lance Stroll, the young gun from the Great White North, PULLS OFF A MASTERCLASS MOVE ON YUKI TSUNODA! Stroll's been lurking in the shadows, waiting for the perfect opportunity, and BOOM! He seizes it! A daring dive down the inside, and Stroll emerges victorious, snatching 12th place from the grasp of the Japanese driver! Tsunoda didn't stand a chance, folks! Stroll's got the bit between his teeth, and he's not letting go! What a thrilling overtake to shake up the midfield battle!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1583.086,
            "description": "Driver 11 overtakes Driver 22 to position 2"
        },
        "commentary": "\"BLISTERING MOVE! Sergio Perez is on the charge! He's been sizing up Yuki Tsunoda for laps, and finally, he makes his move stick! A daring dive down the inside, and the Mexican mastermind emerges in second place! The crowd is on its feet as Perez gets the better of Tsunoda, and now he's got his sights set on the leader! This is turning out to be a thrilling race, folks! Perez has been known for his lightning-quick reflexes, and that's exactly what he needed to pull off this gutsy overtake!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1583.086,
            "description": "Driver 11 overtakes Driver 14 to position 2"
        },
        "commentary": "\"OH, WHAT A MOVE! Sergio Perez is ON IT! He's been hounding Fernando Alonso for lap after lap, and finally, he sees his chance! A blistering run down the straight, and Perez slipsstreaming the Ferrari, he's GOT THE DRIVE! Alonso tries to hold on, but Perez is having NONE OF IT! He's got the pace, he's got the skill, and HE'S GOT THE POSITION! Perez takes second place, and the crowd is going WILD! That's some serious driving from the Mexican maestro, and he's now right on the tail of Verstappen for the lead! This is turning out to be a RACE TO REMEMBER!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1585.342,
            "description": "Driver 63 overtakes Driver 14 to position 3"
        },
        "commentary": "\"OUT OF NOWHERE! GEORGE RUSSELL PULLS OFF THE MOVE OF THE DAY! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT LETTING GO! HE'S GOT FERNANDO ALONSO IN HIS SIGHTS AND HE'S TAKEN HIM! RUSSELL ROUND THE OUTSIDE, THAT WAS A MASTERCLASS! HE'S UP INTO P3 NOW, AND THE brit is on a charge! THE MERCEDES POWER UNIT IS ROARING AS HE TAKES THE CHEQUERED FLAG, THE CROWD IS ON ITS FEET AS RUSSELL CELEBRATES THAT STUNNING OVERTAKE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1586.227,
            "description": "Driver 63 overtakes Driver 14 to position 3"
        },
        "commentary": "\"BY THE THINnest of MARGINS! GEORGE RUSSELL HAS PULLED OFF THE MOST AUDACIOUS MOVE! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S GONE FOR IT! Fernando Alonso, the wily veteran, was thought to be safe in third, but Russell's had other ideas! He's been hounding him for laps, studying his every move, and finally, he's seen his chance! A dart to the inside, a puff of smoke from the tires, and RUSSELL'S THROUGH! THE BRIT'S GOT THE PASS! HE'S UP TO THIRD NOW! THE CROWD IS ON ITS FEET! THIS IS TURNING INTO A RACE FOR THE AGES, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1586.227,
            "description": "Driver 16 overtakes Driver 14 to position 4"
        },
        "commentary": "\"MONUMENTAL MOVE! Charles Leclerc, the Monegasque maestro, has just pulled off a stunning pass on Fernando Alonso at the apex of turn 7! Leclerc has been clawing at the gearbox of the Alpine, searching for an opening, and he's finally found it! A beautifully executed move, using the tow to perfection, and he's THROUGH! Alonso had no answer to the pace and precision of the Ferrari pitbull! Leclerc rockets up to 4th place, and the paddock is abuzz! What a drive, what a moment!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1586.227,
            "description": "Driver 16 overtakes Driver 23 to position 4"
        },
        "commentary": "\"BY THE HAIR ON HIS CHIN, LECLERC HAS PULLED OFF THE MOVE OF THE RACE SO FAR! He's been stalking Albon for laps, waiting for the perfect opportunity to strike, AND STRIKE HE HAS! The Monegasque maestro has dispatched the Thai driver with a daring dive down the inside, leaving Albon to settle for fifth! The French fans are going wild, but Leclerc isn't celebrating just yet - he's got his eyes fixed on the podium places! The Ferrari is looking fierce today, can he make it a reality?!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1586.672,
            "description": "Driver 14 overtakes Driver 23 to position 6"
        },
        "commentary": "\"OH, WHAT A MOVE! Fernando Alonso, the wily veteran, has just pulled off an absolute stunner! He's been lurking, waiting for the perfect opportunity, and it's come! He's got the better of Alex Albon, going around the outside of Turn 12! The crowd is on their feet here!\n\n Alonso's got the pace, he's got the skill, and now he's got the position! He's up to 6th, and the Spanish maestro is on the march! Albon didn't stand a chance, outbraked and outmaneuvered, Alonso's got the move of the day so far!\n\nThis is vintage Alonso, folks! He's got the fire in his belly, and he's going for it! The Renault is handling beautifully, and Alonso's got the bit between his teeth! What can he do from here?"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1586.672,
            "description": "Driver 55 overtakes Driver 23 to position 5"
        },
        "commentary": "\"OH, THE BATTLE FOR FIFTH IS ON! Carlos Sainz, the Ferrari charger, is on the move! He's been sizing up Alex Albon's AlphaTauri for laps, and NOW HE MAKES HIS MOVE! SAINZ SENSATIONALLY SNEAKS PAST ALBON AT TURN 3! The Spaniard's exceptional exit speed out of the previous corner gave him the momentum to make the pass stick! Albon didn't put up much of a fight, but you can't blame him, Sainz was UNSTOPPABLE! The Ferrari number 55 is now up to fifth, and you've got to wonder, how high can he climb?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1591.916,
            "description": "Driver 55 overtakes Driver 4 to position 5"
        },
        "commentary": "\"BY THE HORN, SPANISH FURY UNLEASHED! Carlos Sainz, the master of momentum, has just pulled off a daring dive down the inside of Lando Norris! The McLaren was struggling to find pace, and Sainz seized the opportunity, capitalizing on the tiny gap! The Ferrari is now up to 5th, and the Spaniard is on a mission! Norris, caught napping, was powerless to respond as Sainz snatched the position with precision and panache! The undercut, the outbrake, the acceleration - it was a masterclass in overtaking, folks! Sainz is on the charge, and the top 4 are now firmly in his sights!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1591.916,
            "description": "Driver 4 overtakes Driver 14 to position 6"
        },
        "commentary": "\"OH, THE MCFLURRY MOVE! Lando Norris is the master of the midfield, and he's just pulled off a stunning pass on Fernando Alonso! The McLaren ace has been sizing up the Spaniard for laps, and he's finally made his move stick! The gap was there, and Norris has taken it with both hands! Alonso was struggling to get out of the chicane, and Norris pounced on the opportunity. The McLaren's superior pace and Norris's cunning driving have paid off, and he's up to 6th place! Alonso is now relegated to 7th, and Norris is right in the mix for a strong points finish. What a drive from the young Brit!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1591.916,
            "description": "Driver 14 overtakes Driver 23 to position 7"
        },
        "commentary": "\"THE ALONSO ANGEL HAS SPREAD HIS WINGS! Fernando Alonso, the master of precision, has pulled off a stunner! He's gone around the outside of Alex Albon at Turn 12, using every inch of track to claim 7th place! The Spaniard's years of experience and guile have paid off, as he outmuscles the Red Bull junior to take the spot! That's Alonso's 3rd overtaking maneuver of the race, and it's clear he's not done yet! The McLaren garage will be buzzing, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1593.55,
            "description": "Driver 14 overtakes Driver 23 to position 8"
        },
        "commentary": "\"OH, THE FERNANDO FLAIR! Alonso is on the march, folks! He's been sizing up Albon for laps, waiting for the perfect moment to strike! AND STRIKE HE HAS! The two-time world champion slips past the Williams driver with a beautifully judged move around the outside of Turn 7! The crowd is on its feet as Alonso claims 8th place! That's textbook stuff from the Spaniard, who's now got his sights set on the cars ahead! What a drive from Alonso, and what a scrap we've got unfolding behind him!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1593.55,
            "description": "Driver 81 overtakes Driver 23 to position 7"
        },
        "commentary": "\"OH, THE AUSSIE ASSASSIN STRIKES AGAIN! Oscar Piastri, the rookie sensation, has just pulled off a masterclass move on Alex Albon into Turn 12! He's been lurking in the shadows, waiting for the perfect opportunity, and when it presented itself, he pounced like a hungry shark! Albon didn't stand a chance, Piastri's got the skill and the speed to make it stick! He's up to 7th position now, and you can bet your bottom dollar he's not done yet! What a drive from the young gun, Piastri!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1597.31,
            "description": "Driver 81 overtakes Driver 14 to position 7"
        },
        "commentary": "\"OH, WHAT A MOVE! Oscar Piastri, the Aussie youngster, is MAKING IT HAPPEN! He's been lurking in the shadows, waiting for the perfect opportunity, and NOW HE STRIKES! Fernando Alonso, the wily veteran, didn't see it coming, but Piastri's got the pace and the precision! He's gone around the outside, carried the speed, and AROUND HE GOES! From 8th to 7th, the ROOKIE SENSATION is on the march! Alonso, caught napping, couldn't defend the position, and Piastri's seized the chance! This kid's got the skills, he's got the confidence, and he's GOT THE PASS! 7th place is his, and we've got a NEW PLAYER IN THE GAME!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1597.31,
            "description": "Driver 14 overtakes Driver 23 to position 9"
        },
        "commentary": "\"OH, THE MASTERSTROKE! Fernando Alonso, the wily veteran, seizes the opportunity! He's been lurking, waiting for the perfect moment, and he's pounced! Alex Albon, caught napping, and Alonso snatches ninth place from his grasp! That's the kind of guile and experience that's earned Alonso two World Championships, folks! He's got the bit between his teeth now, and you can bet your bottom dollar he won't be surrendering that position anytime soon! The Fernando Alonso express is on the move, and it's gaining momentum!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1597.31,
            "description": "Driver 44 overtakes Driver 23 to position 8"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS! Lewis Hamilton has pulled off an absolute stunner! He's been lurking in the shadows, waiting for the perfect opportunity, and when Alex Albon left the door open, Hamilton seized it! A lightning-quick move on the inside, and the 7-time world champion has snatched 8th place from the Thai driver! The crowd is on their feet here, folks! What a drive from the Mercedes man!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1602.608,
            "description": "Driver 44 overtakes Driver 14 to position 8"
        },
        "commentary": "\"OH, THE HAMMER DROPS! Lewis Hamilton, the master of the midfield, HAS DONE IT AGAIN! He's been lurking, waiting for the perfect opportunity to strike, and STRIKE HE HAS! Fernando Alonso, the wily veteran, had no answer for the Mercedes steamroller as Hamilton DIVES UP THE INSIDE at Turn 12, taking the spot and moving up to 8th place! The crowd is ON ITS FEET as Hamilton's pace and precision pay off, and Alonso is left to ponder what could've been! It's a battle for the ages, folks, and WE. ARE. HOOKED!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1602.608,
            "description": "Driver 14 overtakes Driver 23 to position 10"
        },
        "commentary": "\"OH, THE MASTER AT WORK! Fernando Alonso, the wily veteran, has pulled off a textbook move on Alex Albon! He's been sizing him up for laps, waiting for the perfect opportunity to strike, and STRIKE HE HAS! Alonso's got the grunt from that Renault power unit, and he's made it count, swooping past Albon on the outside of Turn 3! The Spanish maestro takes 10th spot, and he's got the bit between his teeth now! This could be the start of a charge up the order for Alonso, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1602.608,
            "description": "Driver 24 overtakes Driver 23 to position 9"
        },
        "commentary": "\"UNBELIEVABLE! ZHOU GUANYU WITH THE MOVE OF THE RACE SO FAR! HE'S BEEN STALKING ALEX ALBON FOR LAP AFTER LAP, WAITING FOR THE PERFECT MOMENT TO STRIKE... AND NOW HE'S DONE IT! A MASTERCLASS OF BRAKING AND TURN-IN, GUANYU GETS AROUND THE OUTSIDE OF ALBON AT TURN 7! THE CHINESE DRIVER TAKES 9TH PLACE, AND THE CROWD IS ON ITS FEET! THIS KID'S GOT TALENT, FOLKS! HE'S BEEN KNOCKING ON THE DOOR ALL SEASON, AND NOW HE'S BURST THROUGH IT! THE FERRARI ENGINEER'S GOT TO BE SMILING, THAT WAS A FEARLESS MOVE BY GUANYU!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1604.91,
            "description": "Driver 24 overtakes Driver 18 to position 9"
        },
        "commentary": "\"BLISTERING MOVE! Zhou Guanyu is on the charge! He's been hounding Lance Stroll for laps, and finally, he's made the pass! The Chinese driver has got the measure of the Canadian, diving down the inside at Turn 3! Stroll had no answer to that, Guanyu's got the pace and the precision! He's up to 9th now, and you can bet he's not done yet! The Alfa Romeo is flying, and Guanyu's got the bit between his teeth! What a drive!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1604.91,
            "description": "Driver 18 overtakes Driver 23 to position 11"
        },
        "commentary": "\"OH, THE COURAGEOUS MOVE! Lance Stroll, the young Canadian, SEES AN OPENING AND TAKES IT! He's been lurking, waiting for the perfect moment to pounce, and now he's made his move! He's got the better exit out of Turn 3, and he's managed to slip up the inside of Alex Albon! The Thai driver was struggling to find pace, and Stroll has capitalized! He's through to 11th place, and now he's got his sights set on the top 10! Albon, meanwhile, drops back to 12th, but he'll be looking to regroup and fight back. THE BATTLE FOR POSITIONS IS HEATING UP, FOLKS! Stroll's on the charge, and we can't wait to see what he does next!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1605.374,
            "description": "Driver 22 overtakes Driver 23 to position 12"
        },
        "commentary": "\"BY THE HORNLOADERS, TSUNODA'S GOT THE MOVE! YUKI'S BEEN LINGERING BEHIND ALBON FOR LAPS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! WITH A DARING LATE BRAKE, TSUNODA SNEAKS UP THE INSIDE AND SNATCHES 12TH PLACE FROM THE THAI DRIVER! THE CROWD IS ON THE EDGE OF THEIR SEATS AS TSUNODA CELEBRATES WITH A FIST PUMP! THAT'S THE KIND OF RACING WE LOVE TO SEE, FOLKS! TSUNODA NOW SETS HIS SIGHTS ON THE NEXT TARGET, WHILE ALBON IS LEFT TO WONDERS WHAT COULD'VE BEEN!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1606.161,
            "description": "Driver 20 overtakes Driver 23 to position 13"
        },
        "commentary": "\"FLYING FINNISH FLAIR! Kevin Magnussen, the Haas hotshot, is on the move! He's been sizing up Alex Albon all lap, waiting for the perfect moment to strike... AND THERE IT IS! Magnussen sees the gap, grabs the opportunity, and MAKES THE PASS! He's up to 13th place, putting the pressure on the midfield! That's a beautifully executed overtake, folks, Magnussen's got the bit between his teeth!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1608.104,
            "description": "Driver 31 overtakes Driver 23 to position 14"
        },
        "commentary": "\"UNBELIEVABLE! Esteban Ocon, THE FRENCH FURY, PULLS OFF THE MOVE OF THE RACE SO FAR! He's been lurking, he's been waiting, and he's finally made his move! He dives down the inside of Alex Albon, and it's a beautifully executed pass! Ocon's got the better exit out of the corner, and he's up to 14th! The Frenchman's on a charge, folks! That's the kind of driving that gets you out of the midfield and into the points!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1682.184,
            "description": "Driver 16 overtakes Driver 31 to position 5"
        },
        "commentary": "\"OH, MON DIEU! Charles Leclerc has pulled off a masterclass move on Esteban Ocon! The Monegasque magician has conjured up a stunning pass on the Frenchman, sweeping around the outside of turn 7 to snatch 5th place! The Ferrari powertrain is purring like a contented cat, and Leclerc's got the bit between his teeth! Ocon didn't stand a chance, he was a sitting duck on the inside, and Leclerc's precision and pace have yielded the desired result! The Ferrari charging bull is on the move, folks, and he's hunting down the top 4!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1682.184,
            "description": "Driver 55 overtakes Driver 16 to position 4"
        },
        "commentary": "\"UNBELIEVABLE! Sainz SEEES the gap and TAKES IT! He's been lingering, waiting for the perfect opportunity, and BOOM! He slips past Leclerc like he's not even there! That's the Carlos Sainz we know, the one who's got the mettle for the big moves! From fifth to fourth, the Ferrari man is on the march! The crowd is on their FEET!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1700.084,
            "description": "Driver 55 overtakes Driver 14 to position 4"
        },
        "commentary": "\"CARLOS SAINZ, THE SPANIARD ON THE MARCH! HE'S BEEN LURKING BEHIND FERNANDO ALONSO FOR LAP AFTER LAP, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! SAINZ AROUND THE OUTSIDE OF TURN 7, USING THE FRESH RUBBER TO HIS ADVANTAGE! HE'S GOT THE DRIVE, HE'S GOT THE SKILL, AND NOW HE'S GOT THE POSITION! SAINZ UP TO 4TH, ALONSO DROPS TO 5TH! THE FERRARI DRIVER IS ON A MISSION, FOLKS! HE'S NOT FINISHED YET! THE BATTLE FOR THE PODIUM IS HEATING UP!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1700.084,
            "description": "Driver 14 overtakes Driver 24 to position 9"
        },
        "commentary": "\"OH, FERNANDO FURY! Alonso is on the charge! He's been sizing up Zhou Guanyu for laps, and finally, he's made his move! A daring dive down the inside at Turn 3, and he's pulled it off! Fernando Alonso takes 9th place, dropping Zhou Guanyu to 10th! That's vintage Alonso, folks! He's still got the magic! The Renault is looking racy today, and the two-time world champ is making the most of it! What a pass, what a driver!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1702.756,
            "description": "Driver 24 overtakes Driver 18 to position 10"
        },
        "commentary": "\"BY THE HORN! ZHOU GUANYU WITH THE MOVE OF THE DAY! He's been stalking Lance Stroll for laps, waiting for the perfect moment to pounce, AND HE'S DONE IT! The Chinese rookie sensation takes the inside line, gets the job done, and climbs up to 10th place! Stroll didn't know what hit him! The rookie's got the bit between his teeth, folks, and he's not looking back! What a pass! What a drive!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1702.756,
            "description": "Driver 22 overtakes Driver 18 to position 11"
        },
        "commentary": "\"OH, TSUNODA'S ON THE MOVE! The AlphaTauri driver sees an opportunity and SEIZES IT! He's been stalking Stroll for laps, waiting for the perfect moment to pounce, and NOW IS THE TIME! Tsunoda takes the inside line, gets a brilliant run out of the turn, and makes it STICK! He's got the pass done, and he's into P11! That's a beautifully executed move, folks! Tsunoda's got the crowd on their feet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1706.194,
            "description": "Driver 22 overtakes Driver 23 to position 11"
        },
        "commentary": "\"UNBELIEVABLE! Tsunoda with the MOVE of the race so far! The Japanese sensation has finally made the pass stick on Albon! He's been all over the Thai driver's gearbox for laps, and that's the reward for his patience! \n\nTsunoda dives down the inside, Albon tries to defend, but the Toro Rosso driver has got the pace and the skill! He's through to 11th spot, and the crowd is on its feet! What a moment for Yuki Tsunoda, he's on a mission today! The youngster is showing the world what he's capable of, and that's a fabulous piece of driving!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1706.194,
            "description": "Driver 23 overtakes Driver 31 to position 14"
        },
        "commentary": "\"OH, WHAT A STUNNER! Albon's got the move of the day so far, folks! He's been lurking in the shadows, waiting for the perfect opportunity to pounce, and POUNCE HE HAS! Esteban Ocon didn't stand a chance, Albon's got the skills to pull off the impossible! He's taken the inside line, gotten alongside, and BAM! He's through! Albon takes 14th place, leaving Ocon to fight for scraps!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1778.251,
            "description": "Driver 55 overtakes Driver 31 to position 3"
        },
        "commentary": "\"OH, WHAT A MASTERCLASS MOVE BY SAINZ! He's been sizing up Ocon for laps, studying his every move, waiting for the perfect moment to strike! And STRIKE HE HAS! Sainz dives down the inside at Turn 12, getting alongside Ocon and then...HE'S THROUGH! The Ferrari power train takes him past the Alpine, and Sainz claims P3 for himself! The crowd is on its feet, and rightly so, this was a textbook pass! Ocon didn't put up much of a fight, but you can't blame him, Sainz was just too clinical! The Spaniard's pace has been phenomenal all race, and now he's right in the mix for a podium finish! This could be the making of Sainz's day!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 1778.251,
            "description": "Driver 55 overtakes Driver 63 to position 3"
        },
        "commentary": "\"OH, THE FIGHT FOR THE PODIUM SPOTS IS ON! Carlos Sainz, the wily veteran, has just PULLED OFF A STUNNER! He's got the move done, he's taken the spot! George Russell had been holding on to that third place for dear life, but Sainz has finally found the gap and EXPLOITED IT TO PERFECTION! That Ferrari is REALLY SHOWING ITS PACE NOW! The tifosi will be DELIRIOUS! Russell tried to hold on, but Sainz was having NONE OF IT! He's got the skill, he's got the pace, and now he's got the position! An absolutely rip-roaring move, folks, and we've got a new occupant in P3 - CARLOS SAINZ!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2007.085,
            "description": "Driver 63 overtakes Driver 27 to position 4"
        },
        "commentary": "\"UNBELIEVABLE MOVES! George Russell is taking it to the limit! He's been stalking Nico Hülkenberg for laps, waiting for the perfect opportunity to strike! AND THERE IT IS! Russell dives down the inside at Turn 12, Hülkenberg tries to hold on around the outside, BUT RUSSELL'S GOT THE INSIDE LINE! He's got the speed, he's got the skill, and he's got the position! Russell takes 4th place from Hülkenberg! The crowd is on their feet, what a pass!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2007.085,
            "description": "Driver 77 overtakes Driver 27 to position 17"
        },
        "commentary": "\"OH, THE ICEMAN STRIKES AGAIN! Valtteri Bottas, the master of subtlety, has pulled off a textbook move on Nico Hülkenberg! The Finn's patience was rewarded as he snatched 17th place from the German's grasp! Bottas has been quietly building momentum, and now he's making his presence felt on the track! Hülkenberg was defending hard, but Bottas' silky smooth driving did the trick. The Williams driver is now leveraging all his experience to climb up the ranks! This is Bottas at his best, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2007.63,
            "description": "Driver 77 overtakes Driver 10 to position 17"
        },
        "commentary": "\" Valerie, Valerie, Valtteri! Bottas is back on the move! He's been stalking Pierre Gasly for laps, and now he's made the pass! The Finn has finally found a way past the Frenchman! A beautifully executed move around the outside of Turn 12, and Bottas takes 17th place! The crowd is on their feet as Valtteri Bottas makes it stick! Gasly had no answer for the pace of the Alfa Romeo, and now Bottas sets his sights on the next target... The battle is on!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2007.63,
            "description": "Driver 10 overtakes Driver 27 to position 18"
        },
        "commentary": "\"OH, THE FRENCH CONNECTION STRIKES AGAIN! Pierre Gasly, the man on the move, has finally found a way past Nico Hülkenberg! He's been lurking, waiting for the perfect opportunity, and BOOM! He's taken it! A beautifully executed maneuver around the outside of Turn 7, and Gasly has snatched 18th place from the German's grasp! The Toro Rosso is flying, and Pierre's got his sights set on the next scalp! The crowd is on their feet, folks, what a drive from the Frenchman!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2099.798,
            "description": "Driver 3 overtakes Driver 27 to position 15"
        },
        "commentary": "\"OH, THE HONEY BADGER STRIKES AGAIN! Daniel Ricciardo, the master of late braking, has pulled off a magnificent maneuver around the outside of Nico Hülkenberg! He's been stalking the German for laps, waiting for the perfect opportunity to pounce, and boy, did he ever seize it! The Aussie ace has snatched 15th place from Hülkenberg's grasp, and the crowd is on their feet! That's the kind of daring, wheel-to-wheel action that gets the heart racing! Ricciardo's Renault is looking feisty today, and he's not done yet, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2099.798,
            "description": "Driver 3 overtakes Driver 31 to position 15"
        },
        "commentary": "\"OH, RICCIARDO ROARS BACK INTO CONTENTION! THE HONEY BADGER BITES BACK! Daniel Ricciardo, the master of making it happen, seizes the opportunity to pounce on Esteban Ocon's struggling Renault! He's been lurking in the shadows, waiting for the perfect moment to strike, and STRIKE HE HAS! The Australian ace dives down the inside of Turn 7, and IT'S A DONE DEAL! Ricciardo's McLaren is propelled past Ocon's Renault, and he's up to 15th place! That's a massive momentum shift for Daniel, and he'll be looking to build on this overtake to make even more progress up the order! Esteban Ocon, on the other hand, will be ruing that mistake, but he can't afford to dwell on it – he needs to regroup and"
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2685.003,
            "description": "Driver 18 overtakes Driver 31 to position 13"
        },
        "commentary": "\"SPECTACULAR MOVE! Lance Stroll is on the charge! He's been sizing up Esteban Ocon for laps, and finally, he's made the pass stick! Stroll goes up the inside at Turn 7, and Ocon has no answer! That's a beautifully executed move, folks! Stroll takes 13th place, and he's still got the bit between his teeth! Can he keep this momentum going and catch the pack ahead?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2685.003,
            "description": "Driver 20 overtakes Driver 18 to position 12"
        },
        "commentary": "\"OH, THE KINGS ROAD BLOCKBUSTER! Kevin Magnussen is the architect of this stunning move, and Lance Stroll is the unfortunate victim! The Haas driver saw his chance and took it, diving down the inside of the Aston Martin at Turn 3, and he's made it stick! Magnussen's got the momentum, he's got the skill, and now he's got the position! Stroll was struggling to match the pace, and Magnussen pounced, grabbing 12th place for himself! What a drive, what a move, what a moment! The Haas team will be buzzing with this one, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2778.438,
            "description": "Driver 22 overtakes Driver 20 to position 10"
        },
        "commentary": "\"OH, YUKI'S GOT THE MOVE ON! The AlphaTauri driver, Yuki Tsunoda, has pulled off an absolute stunner on the Haas of Kevin Magnussen! He's been hunting him down for laps, and finally, he's made the pass stick! Tsunoda's got the bite on the brakes, and he's gone around the outside of Magnussen at Turn 7! What a brave move! That's Tsunoda into 10th place, and Magnussen is dropped to 11th! The Japanese youngster is on a mission today, and this overtake is a testament to his growing confidence and skill!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2778.438,
            "description": "Driver 22 overtakes Driver 24 to position 10"
        },
        "commentary": "\"YESSSSSS! TSUNODA TAKES THE SPOT! Oh, what a fantastic move by the young Japanese sensation! He's been stalking Zhou Guanyu for laps, waiting for the perfect opportunity to strike, and STRIKE HE DID! A precision-pass around the outside of Turn 3, and Tsunoda is up to 10th place, demoting the Alfa Romeo to 11th! The Honda-powered drivetrain is firing on all cylinders today, folks! Tsunoda's got the pace, and he's got the guts to go with it! That's a statement move, and AlphaTauri's got to be thrilled with that one!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2783.928,
            "description": "Driver 24 overtakes Driver 18 to position 11"
        },
        "commentary": "\"BY THE HORN OF THE GOAT! Zhou Guanyu has pulled off the impossible! He's gone around the outside of Lance Stroll at Turn 12 and stolen 11th place! The Chinese driver has been lurking in the shadows all race, waiting for the perfect opportunity to strike, and BOY, did he take it! Stroll was caught napping, and Guanyu seized the moment, carrying more speed through the corner and making it stick! The Alfa Romeo is flying today, folks! Guanyu is making a name for himself, and that pass will be replayed for ages to come! 11th place, and the points are within reach!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2783.928,
            "description": "Driver 23 overtakes Driver 18 to position 13"
        },
        "commentary": "\"WOWZA! ALBON'S ON THE MOVE! The Thai driver has been lurking in the shadows, waiting for the perfect opportunity to strike, AND STRIKE HE HAS! Alex Albon, with a daring move on the outside, SLIPS PAST LANCE STROLL AND TAKES 13TH PLACE! The crowd is on their feet, folks! That's what we call a CLEAN, GREEN OVERTAKE! Albon's got the momentum, can he keep it going? Stroll, meanwhile, will be left wondering what could've been... THE BATTLE FOR 13TH IS HEATING UP, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2785.275,
            "description": "Driver 23 overtakes Driver 3 to position 13"
        },
        "commentary": "\"UN-BE-LIEVABLE! Alex Albon PULLS OFF THE MOVE OF THE DAY! He's been lurking in the shadows, waiting for the perfect moment to strike, and STRIKE HE HAS! Daniel Ricciardo, caught napping, and Albon SEIZES the opportunity! That's some SERIOUS skill, folks! Albon's got the bit between his teeth, and he's not letting go! He's UP TO 13th, and Ricciardo's left to ponder what could've been! What a pass, what a driver, WHAT A MOMENT!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2785.275,
            "description": "Driver 3 overtakes Driver 18 to position 14"
        },
        "commentary": "\"Oh, what a masterclass move! Daniel Ricciardo, the honey badger, has finally pounced on Lance Stroll! He's been stalking him for laps, waiting for the perfect moment to strike, and STRIKE HE HAS! With a daring dive down the inside, Ricciardo takes position 14, leaving Stroll in his wake! That's the kind of skill that earned him those seven GP wins, folks! The Aussie ace is on the move, can he keep climbing the order?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2790.684,
            "description": "Driver 31 overtakes Driver 18 to position 15"
        },
        "commentary": "\"OH, WHAT A MOVE! Esteban Ocon, the French phenom, SEES THE GAP AND TAKES IT! He's been lurking in the shadows, waiting for the perfect opportunity to pounce, and NOW HE'S DONE IT! Ocon gets the better of Lance Stroll, darting past the Canadian on the inside, and suddenly he's up to 15th! The Renault engine roars in delight as Ocon makes the pass stick! That's the kind of driving that'll get the crowd on their feet, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2792.563,
            "description": "Driver 31 overtakes Driver 18 to position 15"
        },
        "commentary": "\"ESTEBAN OCON TO THE FORE! THE FRENCHMAN SEEING HIS CHANCE AND TAKING IT! HE'S GOT THE MOVE DONE, FOLKS! OCON Squeezes past LANCE STROLL at Turn 7 and steals 15th place! That was a beautifully crafted overtake, folks! Ocon sizing up the opportunity and executing it to perfection! Stroll didn't put up much of a fight, but you can't blame him, Ocon was on a mission! The Alpine driver is on the move, and he's got his eyes set on the top 10!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2792.563,
            "description": "Driver 77 overtakes Driver 18 to position 16"
        },
        "commentary": "\"BY THE HORN! Valtteri Bottas squeezes past Lance Stroll at the apex of Turn 7! The Finnish flyer has been hounding the Canadian's gearbox for the past three laps, and finally, he's made the move stick! Stroll was struggling for grip, and Bottas pounced on the opportunity, using his superior pace to snatch 16th place! The Alfa Romeo is now in the hunt, folks, and Bottas is on a mission to climb the order!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2793.428,
            "description": "Driver 77 overtakes Driver 10 to position 16"
        },
        "commentary": "\"OH, THE ICEMAN STRIKES! Valtteri Bottas, the flying Finn, makes his move on Pierre Gasly! A beautifully executed pass on the Frenchman, and he takes the 16th spot! Bottas was lingering, waiting for the perfect moment to pounce, and when Gasly's tires started to fade, he saw his chance. A masterclass in patience and precision, and now Bottas is in prime position to start making his way up the order! The #77 car is on the move, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2793.428,
            "description": "Driver 10 overtakes Driver 18 to position 17"
        },
        "commentary": "\"PIERRE GASLY PULLS OFF THE MOVE OF THE DAY SO FAR! He's been lurking behind Lance Stroll for laps, waiting for the perfect opportunity to strike, AND STRIKE HE HAS! Gasly's got the bit between his teeth, he's got the pace, and he's got the skills! He's got around the outside of Stroll at Turn 5, and that's a Carbonell-esque move if I've ever seen one! Gasly's up to 17th place, and he's not done yet, he's got the momentum now! Stroll's got to regroup, he can't let Gasly get away that easily! But for now, it's Pierre Gasly, the master of the midfield, making his way up the order!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2881.074,
            "description": "Driver 20 overtakes Driver 18 to position 11"
        },
        "commentary": "\"Oi, what a opportunist! Kevin Magnussen, the Haas driver, SEES HIS CHANCE! He's been all over the gearbox of Lance Stroll, and NOW HE MAKES HIS MOVE! A beautifully-executed pass, perfect timing, and Magnussen SWOOPS past the Aston Martin! That's position 11 for the Danish driver! He's having a storming race, the Haas VF-23 looking like a rocket ship out there! And for Stroll, it's a bit of a blow, he was really struggling to hold on to that spot. BUT CREDIT TO MAGNUSSEN, he's been quietly working his way up the order, and now he's got his reward! The crowd is on their feet, folks, THAT WAS A BEAUTY!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2881.074,
            "description": "Driver 20 overtakes Driver 24 to position 11"
        },
        "commentary": "\"OH, THE DANES ARE GOING WILD! Kevin Magnussen is on the charge! He's been hounding Zhou Guanyu for the past few laps, and finally, he's made his move! A beautifully executed pass around the outside of turn 7, and Magnussen takes 11th place! The Haas driver has been quietly having a solid race, and this overtake is the icing on the cake! Zhou Guanyu didn't make it easy for him, but Magnussen's determination and skill have paid off. The crowd is on their feet, and Magnussen is pumping his fist in celebration! What a move, what a drive!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2881.826,
            "description": "Driver 23 overtakes Driver 24 to position 12"
        },
        "commentary": "\"OH, WHAT A MOVE! Alex Albon, the Thai sensation, pulls off a stunner! He's been hounding Zhou Guanyu for laps, and finally, he sees his chance! A daring dive down the inside, and he makes it stick! That's a beautifully executed pass, folks! Albon's taken the spot, and Zhou's left to rue what could've been! The Red Bull junior driver is on a mission, and he's not letting anyone get in his way! He's up to 12th now, and you can bet your life he's got his sights set on the top 10! The crowd is on the edge of their seats, and we're loving every minute of it!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2883.437,
            "description": "Driver 3 overtakes Driver 24 to position 13"
        },
        "commentary": "\"UNBELIEVABLE MOVE! Daniel Ricciardo, the Honey Badger, strikes again! He's been hounding Zhou Guanyu for laps, and finally, he makes the pass stick! That was a masterclass in braking and commitment, folks! Ricciardo swoops in, late on the brakes, and slips down the inside of the Alfa Romeo at Turn 9. Zhou tried to hold on, but the McLaren was too hot to handle. And just like that, Ricciardo snatches 13th place! The Aussie's on the charge, and that pass is going to give him a huge boost of momentum!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2889.294,
            "description": "Driver 31 overtakes Driver 24 to position 14"
        },
        "commentary": "\"OH, THE FRENCH FLAIR! Esteban Ocon, the man from Normandy, has pulled off a STUNNING move on Zhou Guanyu! He's been stalking the Alfa Romeo for laps, waiting for the perfect opportunity, and IT'S HERE! Ocon dives down the inside at Turn 7, GETS THE JOB DONE, and takes P14! The Renault driver has been quietly building momentum all race, and this is the payoff! He's now got his sights set on the cars ahead, and you can bet he's got the bit between his teeth! Zhou, on the other hand, will be left ruing that one, as he drops to P15!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2891.373,
            "description": "Driver 31 overtakes Driver 24 to position 14"
        },
        "commentary": "\"AND THERE IT IS! ESTEBAN OCON PULLS OFF A MASTERCLASS MOVE! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE DOES! THE FRENCHMAN SLIPS UP THE INSIDE OF ZHOU GUANYU, TAKING ADVANTAGE OF A MOMENTARY LAPSE IN CONCENTRATION! OCON TAKES 14th PLACE, AND THE CROWD IS ON ITS FEET! THIS IS TURNING OUT TO BE A RACE FOR THE AGES, FOLKS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2891.373,
            "description": "Driver 77 overtakes Driver 24 to position 15"
        },
        "commentary": "\"UNBELIEVABLE! Valtteri Bottas, the Finn on a mission, has just pulled off a STUNNING move on Zhou Guanyu! He's been stalking the Chinese driver for laps, waiting for the perfect opportunity to strike, AND STRIKE HE HAS! Bottas dives down the inside, using every inch of the track to get alongside, and then makes the pass STICK! The crowd is on its FEET as Bottas takes 15th place! That's what we call a TEXTBOOK OVERTAKE, folks! Bottas is on a ROLL!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2891.997,
            "description": "Driver 77 overtakes Driver 10 to position 15"
        },
        "commentary": "\"OH, WHAT A MOVE! Valtteri Bottas, the Ice Man from Finland, has pulled off a stunner! He's been lurking in the shadows, waiting for the perfect opportunity, and he's pounced! Pierre Gasly, caught napping, is left in the wake as Bottas slices past him to claim 15th position! The Alfa Romeo's pace has been impressive all weekend, and now it's paying dividends! Gasly, struggling to keep up, is going to have to regroup and reassess if he wants to stay in the hunt. BUT WHAT A DRIVE FROM BOTTAAS! THE ICE MAN IS BACK IN BUSINESS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2891.997,
            "description": "Driver 10 overtakes Driver 24 to position 16"
        },
        "commentary": "\"OH, THE FRENCH FLAIR IS BACK! Pierre Gasly with a MASTERCLASS move on Zhou Guanyu, squeezing past the Alfa Romeo on the outside of Turn 7! The crowd is on their feet as Gasly takes the 16th spot! He's been lurking, waiting for the perfect opportunity, and BOOM! He's made it count! That's Gasly's third overtake of the race, and he's not done yet! The AlphaTauri is flying, and Pierre is driving like a man possessed! Zhou tries to hold on, but Gasly's got the pace, the skill, and the determination to get ahead! What a move, what a drive! Gasly's on the charge, folks, and you don't want to miss this!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2990.808,
            "description": "Driver 10 overtakes Driver 24 to position 15"
        },
        "commentary": "\"OH, WHAT A MOVE! Pierre Gasly, the master of midfield mayhem, pulls off a dazzling dive down the inside of Zhou Guanyu! The Frenchman's been lingering in the gearbox of the Alfa Romeo, waiting for the perfect opportunity to strike... AND STRIKE HE DOES! Gasly's got the precision of a Swiss watch, timing his move to perfection to snatch 15th place from the Chinese driver! Zooming past with the pace of a rocket, Gasly's gotten his elbows out and isn't afraid to get his wheels dirty! This is vintage Gasly, folks - the AlphaTauri ace has finally found his mojo!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 2990.808,
            "description": "Driver 10 overtakes Driver 77 to position 15"
        },
        "commentary": "\"OH, WHAT A MOVE! Pierre Gasly, the French flyer, SEIZES THE OPPORTUNITY! He's been sizing up Valtteri Bottas for Lap after Lap, and FINALLY, he makes his play! Gasly DARTS down the inside, using every inch of the track, and TAKES THE SPOT! Bottas didn't stand a chance! Gasly's AlphaTauri is ON THE MARCH, up to 15th place now! The crowd is on their FEET, folks! This is TURNING POINT RACING at its finest!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3040.697,
            "description": "Driver 16 overtakes Driver 77 to position 4"
        },
        "commentary": "\"BY THE HORN, CHARLES LECLERC WITH THE MOVES! He's been sizing up Valtteri Bottas all lap, and finally, he pounces! A daring dive down the inside, and LECLERC SNATCHES FOURTH PLACE! The Monegasque maestro has got the better of the Finnish flyer! Bottas was struggling to match the pace, and Leclerc capitalized in style! That's the kind of drive that wins championships, folks! The papaya-orange car of Leclerc is on the march, and the crowd is on its feet! What a masterclass in overtaking!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3040.697,
            "description": "Driver 16 overtakes Driver 63 to position 4"
        },
        "commentary": "\"AND THERE IT IS! LECLERC MAKES THE PASS! MONACO MAGIC IS BACK, FOLKS! Charles Leclerc, the Monegasque maestro, has finally found a way past George Russell's stubborn defense! That Ferrari power is unleashed, and he's catapulted himself up to P4! \n\nRussell put up a valiant fight, but Leclerc's persistence paid off. That's the kind of skill that earned him those two pole positions in Monaco, you know! The Ferrari squad will be ecstatic about this one. Can he continue his charge towards the podium?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3088.879,
            "description": "Driver 63 overtakes Driver 10 to position 5"
        },
        "commentary": "\"SHOT ACROSS THE BOW! George Russell, the young Brit, is on the charge! He's been hounding Pierre Gasly for laps, and finally, he's made the move stick! Russell dives up the inside of Gasly at Turn 3, and he's got the spot! The Mercedes-powered Williams is flying, and Russell's taken fifth place! That's a massive momentum shift for the Brit, who's looking to recover from a tough qualifying yesterday. Gasly, on the other hand, will be cursing his luck - he was holding on for dear life, but Russell's pace was just too much. This could be a turning point in the race, folks! Russell's got the bit between his teeth, and he's not letting up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3088.879,
            "description": "Driver 24 overtakes Driver 10 to position 14"
        },
        "commentary": "\"BY THE HORN, ZHOU GUANYU'S GOT THE MOMENTUM! He's been hovering, waiting for the perfect opportunity, and IT'S NOW! The Chinese sensation dives down the inside of Pierre Gasly, and HE MAKES IT STICK! Gasly tries to hang in there, but Zhou's got the pace, the precision, and the patience! FROM 15th TO 14th, THE DRAGON ROARS! That's a masterclass move, folks! Zhou Guanyu's on the march, and he's not done yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3088.879,
            "description": "Driver 24 overtakes Driver 31 to position 14"
        },
        "commentary": "\"OH, THE CHINESE ACE STRIKES! ZHOU GUANYU, THE YOUNG GUN, PULLS OFF A STUNNING MOVE ON ESTEBAN OCON! HE'S GOT THE BIT BETWEEN HIS TEETH NOW, FOLKS! Zhou's been sizing up Ocon for laps, waiting for the perfect moment, AND HE'S TAKEN IT! A brilliant piece of driving, using the KERS to blast past the Frenchman on the inside of Turn 7! Ocon didn't stand a chance, Zhou's got the momentum now! He's up to 14th, and with this pace, he might not be done yet! WHAT A MOVE, ZHOU FANS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3088.879,
            "description": "Driver 31 overtakes Driver 77 to position 15"
        },
        "commentary": "\"OH, THE FRENCH FLAIR! Esteban Ocon with a daring move on Valtteri Bottas! He's been stalking the Finn for laps, waiting for the perfect opportunity to strike, and STRIKE HE HAS! Ocon slips up the inside at Turn 5, and Bottas can't quite hold on! The Renault man takes position 15, and what a vital overtake that is! The crowd is on their feet as Ocon celebrates with a little wiggle of the rear tyres! That's the kind of drive that gets the team principal buzzing, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3089.861,
            "description": "Driver 18 overtakes Driver 10 to position 15"
        },
        "commentary": "\"BY THE HORN, LANCE STROLL IS ON THE MOVE! HE'S GOT THE BIT BETWEEN HIS TEETH, FOLKS! The Aston Martin driver has been lurking in the shadows, waiting for the perfect moment to strike, AND STRIKE HE HAS! Pierre Gasly didn't see it coming, but Stroll has executed a masterclass of precision and bravery to claim 15th place! The Canadian's got the momentum now, can he keep the pressure on and make further gains? The crowd is on the edge of their seats as Stroll makes his way up the order!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3089.861,
            "description": "Driver 18 overtakes Driver 31 to position 15"
        },
        "commentary": "\"OH, THE STROLL SHOW CONTINUES! Lance Stroll, the young Canadian, has got the measure of Esteban Ocon! He's been lurking in the shadows, waiting for the perfect moment to pounce, and POUNCE HE HAS! Up the inside, brilliant braking, and Stroll takes 15th place from the Frenchman! That's a silky smooth move, folks! Stroll's been quietly building momentum all race, and now he's reaping the rewards. Ocon won't be happy about that one, but Stroll's got the pace and the panache to back it up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3089.861,
            "description": "Driver 31 overtakes Driver 77 to position 16"
        },
        "commentary": "\"OH, THE FRENCH FLAIR IS ON FULL DISPLAY! Esteban Ocon, the man on the move, slides past Valtteri Bottas with a daring dive down the inside! The force is with Ocon, as he muscles his way into 16th position! Bottas didn't know what hit him! Ocon's been quietly building momentum all race, and now he's making his presence felt! That's the kind of move that gets the heart racing, folks! The rear wheels of the Alfa Romeo were smoking, but Ocon kept his cool to pull off the pass! The Frenchman's on a mission, and he's not done yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3091.184,
            "description": "Driver 10 overtakes Driver 77 to position 16"
        },
        "commentary": "\"OH, THE FRENCH FURY UNLEASHED! Pierre Gasly, the master of precision, PULLS OFF A STUNNING PASS ON VALTTERI BOTTAS! He goes around the outside, using every inch of the track, and makes it stick! Gasly now up to 16th, what a fantastic piece of driving! Bottas didn't stand a chance, he was a sitting duck on the inside. Gasly's got the bit between his teeth, and he's on the move!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3091.184,
            "description": "Driver 10 overtakes Driver 31 to position 16"
        },
        "commentary": "\"OH, THE FRENCH FANCY! Pierre Gasly, the man on the move! He's been stalking Esteban Ocon for laps, and finally, he's made his way past! Gasly dives down the inside at Turn 3, and Ocon can't hold him off! That's a masterclass of braking and precision from the AlphaTauri driver! He's up to 16th place now, and he's got the bit between his teeth! The crowd is on their feet, folks, this is what we came to see! Gasly's got the momentum, and he's not stopping anytime soon!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3095.012,
            "description": "Driver 27 overtakes Driver 31 to position 17"
        },
        "commentary": "\"OH, WHAT A MOVE! Nico Hülkenberg is on the charge, folks! He's been stalking Esteban Ocon for lap after lap, waiting for the perfect opportunity to strike... AND STRIKE HE HAS! Hülkenberg dives down the inside, Ocon leaves the door open just a crack, and the German takes full advantage! He's through! Hülkenberg takes 17th place, and that's some seriously hard racing! He's got the bit between his teeth, and he's gunning for more! The crowd is on their feet, what an overtake!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3095.012,
            "description": "Driver 31 overtakes Driver 77 to position 18"
        },
        "commentary": "\"OH, THE CRAFTY FRENCHMAN STRIKES AGAIN! Esteban Ocon, with a masterclass of braking and acceleration, slips past Valtteri Bottas on the inside of Turn 7! The Renault's superior pace pays off as Ocon gains 18th place! Bottas was struggling with grip, and Ocon pounced on the opportunity, proving why he's one of the most underrated drivers on the grid. The papaya orange car is on the move, folks! Esteban Ocon, making his way up the order, one position at a time!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3140.409,
            "description": "Driver 4 overtakes Driver 77 to position 5"
        },
        "commentary": "\"BLISTERING MOVE! Lando Norris is on a mission! He's been sizing up Valtteri Bottas for laps, and finally makes his attack stick! A daring dive down the inside at Turn 12, and the McLaren bullets past the Mercedes-powered Alfa Romeo! Norris snatches 5th place from Bottas, and the crowd is going WILD! That's a statement of intent from the young Briton, who's been quietly building momentum all race long! Norris is on the charge, folks, and you can't count him out of the points haul just yet!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3140.409,
            "description": "Driver 4 overtakes Driver 63 to position 5"
        },
        "commentary": "\"BLISTERING MOVE! Lando Norris is on a mission! He's been hounding George Russell for laps, and finally, he's made the pass stick! Norris gets a fantastic run out of the last chicane, and he's got the momentum to take it to the inside of Russell at Turn 1! The McLaren is perfectly placed, and Russell can't defend! Norris takes the apex, and he's through to P5! The crowd is going wild! This kid's got skills, folks! Norris has been quietly building up his pace all race, and now he's making it count!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3144.542,
            "description": "Driver 81 overtakes Driver 63 to position 6"
        },
        "commentary": "\"WHAT A MOVE, OSCAR! Piastri, the young gun, making his presence felt! He's been hounding Russell's gearbox for the past three laps, and finally, he's made the pass stick! The Australian rookie squeezes down the inside of George at Turn 7, and it's a beautifully executed move! Russell had no answer, no defense, as Piastri swoops by to claim sixth place! The crowd is on the edge of their seats, and Piastri's team is erupting in joy! This kid's got talent pouring out of every pore!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3146.561,
            "description": "Driver 81 overtakes Driver 44 to position 6"
        },
        "commentary": "\"OH, THE AUSSIE ASSAULT! OSCAR PIASTRI PULLS OFF THE MOVE OF THE RACE SO FAR! HE'S BEEN LURKING IN THE WINGS, WAITING FOR THE PERFECT MOMENT TO STRIKE, AND NOW HE'S MADE HIS MOVE! HE'S GOT THE BETTER OF LEWIS HAMILTON, THE SEVEN-TIME WORLD CHAMPION, AND TAKEN THE SIXTH SPOT! THIS KID'S GOT TALENT, FOLKS! THE CROWD IS ON THE EDGE OF THEIR SEATS AS PIASTRI CONTINUES TO IMPRESS IN HIS ROOKIE SEASON!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3146.561,
            "description": "Driver 44 overtakes Driver 63 to position 7"
        },
        "commentary": "\"BY THE HORN, HAMMER TIME! Lewis Hamilton, the seven-time champ, is on the move! He's been sizing up George Russell for laps, and finally, he makes the pass stick! That was a masterclass of patience and opportunism! Hamilton slots into seventh, and the Brit's on the charge! Russell, struggling to keep pace, couldn't hold off the relentless pressure from the Mercedes machine. The gap was mere millimeters, but Hamilton pounced on the opportunity like a predator! Russell's pace has been questioned all weekend, and now he's been dispatched by the wily veteran. This could be the spark that ignites Hamilton's charge up the order! The crowd is on their feet, and we've got a race on our hands!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3157.912,
            "description": "Driver 14 overtakes Driver 63 to position 8"
        },
        "commentary": "\"OH, THE SPANISH MATADOR HAS STRUCK AGAIN! Fernando Alonso, the master of the mid-field, has pulled off a daring move on George Russell, snatching 8th place from the Mercedes junior! The French Grand Prix winner of 2008 still has the skills, folks, and he's not afraid to use them! Alonso has been lurking in Russell's shadow for the past few laps, waiting for the perfect moment to pounce, and POUF! He's done it! The Renault is ahead, and the crowd is on its feet! What a drive from the two-time world champion, and what a disappointment for Russell, who was looking comfortable in 8th. The battle for the top 10 just got a whole lot more interesting, and Alonso is right in the thick of it!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3176.088,
            "description": "Driver 63 overtakes Driver 20 to position 9"
        },
        "commentary": "\"OH, WHAT A MOVE! George Russell is on the charge! He's been hounding Kevin Magnussen for laps, and finally, he's made it stick! Russell dives down the inside, using every inch of the track, and makes it out of the corner ahead of the Haas! The Brit's got the pace, and he's making it count! That's Russell into 9th, and Magnussen relegated to 10th! The midfield battle is heating up, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3176.088,
            "description": "Driver 23 overtakes Driver 20 to position 11"
        },
        "commentary": "\"OH, THE THAI TORPEDO STRIKES AGAIN! Alex Albon, driving with the precision of a surgeon, has sliced past Kevin Magnussen to claim 11th position! The Red Bull junior team driver is unstoppable, folks! He's been lurking in the shadows, waiting for the perfect moment to pounce, and boy, did he ever! Magnussen, caught napping, was powerless to resist the onslaught from the determined Thai driver. Albon's got his eyes fixed on the top 10, and with this move, he's getting closer by the lap! The crowd is on their feet, and we're witnessing something special here, folks! Alex Albon, the master of the midfield, is on the march!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3177.538,
            "description": "Driver 23 overtakes Driver 3 to position 11"
        },
        "commentary": "\"Get in, Albon! The Thai driver has finally made his move! He's been lurking in the shadows, waiting for the perfect opportunity to strike, and STRIKE HE HAS! Albon slips up the inside of Ricciardo at Turn 7, and the Aussie can't do anything about it! The crowd is on their feet as Albon wheelspins his way past the McLaren, taking P11 in the process! What a drive by the Williams man, he's having a blinder of a race so far! Ricciardo, on the other hand, will be disappointed to have lost a spot, but he can't afford to get too caught up in this tussle, he needs to focus on reclaiming that position and getting back in the hunt!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3177.538,
            "description": "Driver 3 overtakes Driver 20 to position 12"
        },
        "commentary": "\"OH, THE HONEY BADGER STRIKES AGAIN! Daniel Ricciardo, the man known for his cunning overtakes, has pulled off a masterclass move on Kevin Magnussen! The Australian ace has been lurking in the shadows, waiting for the perfect moment to pounce, and POUNCE HE DID! \n\nRicciardo saw his chance, diving down the inside of Turn 5, and Magnussen had no answer! The McLaren driver's superior pace and precision paid off, as he swooped past the Haas to claim 12th place! What a drive, Daniel! He's got the bit between his teeth now, and you can bet your life he'll be pushing for more!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3191.866,
            "description": "Driver 20 overtakes Driver 10 to position 13"
        },
        "commentary": "\"UNBELIEVABLE! KEVIN MAGNUSSEN WITH THE MOVE OF THE RACE SO FAR! He's been sizing up Pierre Gasly for laps, waiting for the perfect opportunity to strike! AND STRIKE HE HAS! Magnussen gets a blistering run out of the final chicane, gets himself in the slipstream, and then makes the pass on the inside of Turn 1! Gasly had no answer, NO DEFENSE AGAINST THE MAGNUSSEN ATTACK! The Danish dynamo takes 13th place, and the crowd is going WILD!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3191.866,
            "description": "Driver 27 overtakes Driver 10 to position 16"
        },
        "commentary": "\"UN-BE-LIEVABLE! Nico Hülkenberg has pulled off a STUNNING move on Pierre Gasly! He's been lurking in the shadows for the past few laps, waiting for the perfect moment to strike! AND STRIKE HE HAS! Hülkenberg dives down the inside, and Gasly is left with no option but to yield! The German driver takes the spot, and he's up to 16th place! The crowd is on their feet as Hülkenberg celebrates his first pass of the day! What a MASTERCLASS in overtaking!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3206.646,
            "description": "Driver 27 overtakes Driver 10 to position 16"
        },
        "commentary": "\"UNBELIEVABLE! Nico Hülkenberg has found the sweet spot! He's been lurking in the shadows, waiting for the perfect moment to strike, and STRIKE HE HAS! He's muscled his way past Pierre Gasly, taking the 16th spot! What a move, what a drive! The crowd is on their feet, folks! Hülkenberg's got the pace, he's got the skill, and he's got the determination to make it happen! Gasly didn't stand a chance, he was caught sleeping, and Hülkenberg has pounced! This is turning out to be one heck of a race, and we're only just getting started!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3206.646,
            "description": "Driver 31 overtakes Driver 10 to position 17"
        },
        "commentary": "\"OH, THE FRENCH FLAIR TAKES THE SPOT! Esteban Ocon, with a daring dive down the inside, gets the better of Pierre Gasly! The Alpine charger makes it stick, and he's up to 17th place! What a move, what a drive! Ocon's been lurking in the shadows, waiting for the perfect opportunity, and he's pounced! Gasly, meanwhile, will be ruing that slight hesitation, which proved all the difference. This is turning out to be a thrilling midfield battle, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3282.16,
            "description": "Driver 18 overtakes Driver 31 to position 13"
        },
        "commentary": "\"OH, THE STROLL SHOW HAS ARRIVED! LANCE STROLL WITH THE MOVE OF THE DAY, FOLKS! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE, AND STRIKE HE HAS! ESTEBAN OCON, THE DEFENDING DRIVER, COULDN'T HOLD OFF THE CHARGING CANADIAN ANY LONGER! STROLL SLIDES UP THE INSIDE, USING EVERY OUNCE OF BRAKING ZONE TO GET THE JOB DONE! HE'S UP TO 13TH NOW, AND THIS COULD BE THE START OF SOMETHING SPECIAL FOR THE Aston Martin DRIVER! THE CROWD IS ON THE EDGE OF THEIR SEATS, AND WE'VE GOT A BATTLE BREWING!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3282.16,
            "description": "Driver 18 overtakes Driver 20 to position 13"
        },
        "commentary": "\"OH, WHAT A MOVE! Lance Stroll, the Canadian young gun, sees an opportunity and SEIZES IT! He's been lurking behind Kevin Magnussen all lap, waiting for the perfect moment to pounce, and POW! He takes it on the outside of Turn 7! The Aston Martin's superior pace pays off as Stroll effortlessly glides past the Haas, snatching 13th place from the grasp of Magnussen! That's the kind of bold, aggressive driving that gets the crowd on their feet! Stroll's on the march, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3282.16,
            "description": "Driver 20 overtakes Driver 24 to position 14"
        },
        "commentary": "\"OH, THE DENMARK DYNAMO STRIKES! Kevin Magnussen, the veteran of 150-plus Grands Prix, SENSES BLOOD! He's been sizing up Zhou Guanyu for laps, and finally, he makes his MOVE! Magnussen gets a TOE-CURLING run out of Turn 3, and he's GOT THE DRIVE! Zhou defends, but Magnussen is UNRELenting! He slips up the inside, and IT'S A DONE DEAL! The Haas VF-23 flashes past the Alfa Romeo, and Magnussen takes 14th place! That's a STUNNING piece of driving from the experienced Dane!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3282.865,
            "description": "Driver 24 overtakes Driver 20 to position 14"
        },
        "commentary": "\"UN-BE-LIEVABLE! ZHOU GUANYU PULLS OFF A MASTERCLASS MOVE! The Chinese sensation slices through the gap, and Kevin Magnussen is left in his wake! The Alfa Romeo driver was hounding the Haas for laps, waiting for the perfect moment to strike, AND WHAT A STRIKE IT IS! Zhou Guanyu takes the 14th spot, leaving Magnussen to regroup and reassess! This is the kind of racing that gets the pulse racing, folks! Zhou Guanyu, the rookie, is making a name for himself in this championship!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3288.792,
            "description": "Driver 24 overtakes Driver 20 to position 14"
        },
        "commentary": "\"OH, WHAT A MOVE! ZHOU GUANYU, THE CHINESE SENSATION, SEES THE Gap AND TAKES IT! HE'S GOT THE BETTER OF KEVIN MAGNUSSEN AROUND THE OUTSIDE OF TURN 7! THE CROWD IS ON ITS FEET AS ZHOU MOVES UP TO 14TH PLACE! \n\nThat's the kind of opportunistic driving that gets you noticed in Formula 1! Zhou's got the pace, he's got the skill, and now he's got the position! Kevin Magnussen, he's got some work to do to get that spot back!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3288.792,
            "description": "Driver 27 overtakes Driver 20 to position 15"
        },
        "commentary": "\"OH, THE HÜLKENBERG EXPRESS IS ON THE MOVE! Nico Hülkenberg, the veteran German driver, has been quietly stalking Kevin Magnussen for laps, and NOW HE STRIKES! A beautifully judged move around the outside of Turn 7, and Hülkenberg has got the better of the Haas driver! Magnussen had no answer to the pace and precision of the Alpine driver, and Hülkenberg takes 15th spot! What a masterclass in overtaking, folks! The crowd is on its feet, and we're witnessing a driving masterclass out there!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3340.693,
            "description": "Driver 4 overtakes Driver 27 to position 6"
        },
        "commentary": "\"Lando Norris, the McLaren maestro, is on the PROWL! He's been sizing up Nico Hülkenberg's Haas for laps, and FINALLY, he's made the MOVE! A daring dart down the inside at Turn 7, and Norris has GOT AROUND HÜLKENBERG! The young Brit executes the pass to perfection, picking up P6 in the process! That's some serious pace and precision from the McLaren driver, folks! Hülkenberg put up a good fight, but Norris was NOT TO BE DENIED! We've got a real barnburner of a race developing here, and Lando Norris is RIGHT IN THE MIX!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3340.693,
            "description": "Driver 81 overtakes Driver 4 to position 5"
        },
        "commentary": "\"UN-BE-LIEVABLE! THE AUSSIE ACE STRIKES AGAIN! Oscar Piastri, the rookie sensation, is on a mission! He's been hounding Lando Norris for laps, and finally, he's made the move! A daring pass around the outside of turn 7, and Piastri snatches 5th place from the McLaren! The crowd is on its feet, folks, this kid's got talent pouring out of every pore! Norris, caught napping for a split second, can't respond to the rookie's blistering pace. Piastri's made it stick, and he's now firmly planted in the top 5! What a drive, what a move, WHAT A MOMENT!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3350.34,
            "description": "Driver 81 overtakes Driver 4 to position 5"
        },
        "commentary": "\"OH, THE AUSSIE ASSAULT! Oscar Piastri, the young gun, slices past Lando Norris at Turn 10! What a move! The McLaren defense was solid, but Piastri's got the pace and the precision to make it stick! He's got the bit between his teeth, and he's not letting go! Piastri takes P5, and suddenly he's right in the mix!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3350.34,
            "description": "Driver 4 overtakes Driver 14 to position 7"
        },
        "commentary": "\"OH, THE YOUNG GUN STRIKES AGAIN! Lando Norris, the 4-car, has just pulled off a masterclass move on the experienced Fernando Alonso! Norris has been lurking, waiting for the perfect opportunity to pounce, and that's exactly what he's done! He's got the tyres, he's got the pace, and he's got the confidence! Norris swoops down the inside of Alonso at Turn 3, and the McLaren gets ahead of the Alpine! Norris is now up to 7th place, and Alonso is relegated to 8th! What a drive from the 22-year-old Brit! He's making a name for himself in this Formula 1 championship!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3350.34,
            "description": "Driver 44 overtakes Driver 14 to position 8"
        },
        "commentary": "\"BY THE Hairs on the back of our necks, FOLKS! LEWIS HAMILTON, THE SEVEN-TIME WORLD CHAMPION, IS ON THE PROWL! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! HE'S GOT THE BETTER OF FERNANDO ALONSO, THE WILY VETERAN, AND TAKEN 8TH PLACE FROM HIM! THE CROWD IS ON ITS FEET AS HAMILTON PUTS THE PEDAL TO THE METAL AND MAKES IT STICK! THE SHIFT IN MOMENTUM IS PALPABLE, FOLKS! THIS COULD BE THE TURNING POINT IN HAMILTON'S RACE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3350.34,
            "description": "Driver 63 overtakes Driver 44 to position 6"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS! George Russell has pulled off an absolute stunner! He's been hounding Lewis Hamilton for lap after lap, and finally, he's made his move stick! That was a beautifully calculated pass, folks! Russell saw his chance on the inside of Turn 3 and took it, leaving Hamilton to rue what could have been. HE'S GOT THE BIT BETWEEN HIS TEETH NOW! Russell is on a roll, and the crowd is on its feet! He's muscled his way into 6th position, and you can bet your bottom dollar he won't be satisfied until he's reached the top step of that podium!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3352.685,
            "description": "Driver 63 overtakes Driver 4 to position 6"
        },
        "commentary": "\"OH, WHAT A MOVE! George Russell, the British sensation, is on a mission! He's been hunting Lando Norris for laps, and finally, he's pulled off the pass! Russell swoops down the inside, and Norris can't hold on! The Mercedes power is too much, and Russell takes the position! He's up to 6th now, and you can't count him out of the points! Norris tried to defend, but Russell was having none of it! That's the kind of aggression we've come to expect from the young Brit! And look at that, he's now right on the gearbox of Fernando Alonso, this could get interesting!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3352.685,
            "description": "Driver 14 overtakes Driver 4 to position 7"
        },
        "commentary": "\"UNBELIEVABLE! Fernando Alonso, the master of the comeback, has done it again! He's been lingering in the shadow of Lando Norris for lap after lap, waiting for the perfect moment to strike. AND STRIKE HE HAS! Alonso dives down the inside of Norris at Turn 12, and the McLaren is powerless to resist! The Ferrari-powered pace of the Alpine has given Alonso the edge he needed to finally make the pass! Norris tried to hold on, but Alonso's experience and guile have won the day! Fernando Alonso, up to 7th place, making his way through the field like a hot knife through butter! Norris, meanwhile, drops to 8th, his pace beginning to fade slightly. What a move by Alonso, the fans are going wild!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3352.685,
            "description": "Driver 14 overtakes Driver 44 to position 7"
        },
        "commentary": "\"OH, THE TWO-TIME WORLD CHAMPION GETS OUTFOXED! Fernando Alonso, the wily veteran, has pulled off a stunning move on Lewis Hamilton! The Spaniard saw an opportunity and seized it, diving down the inside of the Mercedes and emerging in seventh place! The crowd is on its feet here at the circuit!\n\nHamilton, who's been struggling for pace all weekend, couldn't defend against the attacking Alonso. The Alpine driver's pace has been exceptional today, and he's making the most of it. That's a crucial move, folks, as Alonso looks to salvage a decent points haul from what's been a difficult season so far.\n\nAnd what about Hamilton? He's got his work cut out to get back ahead of the feisty Alonso. This is turning out to be a mouth-watering battle for seventh, with plenty of laps still to run!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3446.133,
            "description": "Driver 16 overtakes Driver 44 to position 5"
        },
        "commentary": "\"BLINDING MOVE! Charles Leclerc has pulled off an absolute stunner! He's been hounding Lewis Hamilton for laps, and finally, he's made the pass stick! The Monegasque maestro has got the Ferrari fired up and he's flying! He's got the momentum, he's got the pace, and he's got the guts to go for it! Hamilton tried to defend, but Leclerc was having none of it! He's swooped around the outside, and now he's up to P5! What a drive, what a move, what a moment! The crowd is on their feet, and we're on the edge of our seats! Leclerc is on a mission, and he's not going to let anyone stand in his way!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3446.133,
            "description": "Driver 63 overtakes Driver 16 to position 4"
        },
        "commentary": "\"UNBELIEVABLE! GEORGE RUSSELL PULLS OFF THE MOVE OF THE RACE SO FAR! HE'S BEEN LURKING IN THE SHADOWS OF CHARLES LECLERC FOR LAPS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE HAS! Russell dives down the inside, using every inch of the road to get past the Ferrari! LECLERC HAD NO ANSWER TO THAT ONE, FOLKS! Russell's pace has been lightning quick all weekend, and now he's making it count! UP TO 4TH PLACE FOR THE BRITON, AND HE'S GOT HIS SIGHTS SET ON THE PODIUM!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3446.133,
            "description": "Driver 63 overtakes Driver 81 to position 4"
        },
        "commentary": "\"OH, WHAT A MOVE! GEORGE RUSSELL IS ON THE PROWL! He's been sizing up Oscar Piastri for laps, and NOW HE STRIKES! A beautifully executed pass around the outside of Turn 3, and Russell takes the position! Piastri didn't put up much of a fight, but Russell's pace and precision did all the talking! The young Brit is now up to 4th, and he's got his sights set on the podium!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3449.896,
            "description": "Driver 14 overtakes Driver 81 to position 5"
        },
        "commentary": "\"Oh, what a masterclass! Fernando Alonso, the wily veteran, has pulled off a stunning move on Oscar Piastri! The Spaniard's years of experience have paid off, as he's sniffed out the opportunity and taken it with both hands! Alonso's trajectory around the outside of Turn 3 was perfect, and Piastri just couldn't defend against the attack! The two-time world champion is now up to P5, and you can't count him out of the podium hunt yet! That's a big, big move, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3449.896,
            "description": "Driver 14 overtakes Driver 16 to position 5"
        },
        "commentary": "\"BY THE HORN! Fernando Alonso has pulled off a masterclass move! He's been stalking Charles Leclerc for laps, waiting for the perfect moment to strike, AND HE'S DONE IT! A beautifully executed pass around the outside of Turn 3, and Alonso takes the spot! The Spaniard is on the move, up to P5! That's the experience and guile of a two-time World Champion right there! Leclerc didn't put up much of a fight, but you can't blame him - Alonso was just too hot to handle! The Alpine is flying today, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3449.896,
            "description": "Driver 16 overtakes Driver 81 to position 6"
        },
        "commentary": "\"Oh, what a move! The Monegasque maestro strikes! Charles Leclerc, the prince of pace, swoops past Oscar Piastri on the outside of turn 7! That's a daring pass, folks, and it's all about the precision and bravery of the Ferrari driver! Piastri was defending hard, but Leclerc's superior pace and cunning tactics won out in the end! He's now up to 6th place, and that's a massive leap forward in this high-stakes game of cat and mouse! The crowd is going wild, and we can't blame them - that was a silky-smooth overtake, executed to perfection!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3451.329,
            "description": "Driver 4 overtakes Driver 81 to position 7"
        },
        "commentary": "\"OH, WHAT A MOVE! Lando Norris is the master of midfield mayhem! He's been hunting Oscar Piastri for laps, and finally, he's made the pass stick! Norris dives down the inside at Turn 3, and Piastri can't hold on! The McLaren man takes seventh place, and the crowd is on its feet! That's Norris's third overtake of the race, and he's on a mission to crack the top five! Piastri's got some work to do to reclaim that spot, but Norris is in the zone right now!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3456.768,
            "description": "Driver 44 overtakes Driver 81 to position 8"
        },
        "commentary": "\"WE'VE GOT A MOVE! LEWIS HAMILTON IS ON THE PROWL! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR HIS CHANCE TO STRIKE, AND STRIKE HE HAS! THE SEVEN-TIME WORLD CHAMPION slipstreams past OSCAR PIASTRI, THE ROOKIE SENSATION, AND TAKES THE EIGHTH SPOT! Hamilton's got the pace, he's got the skill, and now he's got the position! Piastri didn't put up much of a fight, but you can't blame him, Hamilton was unstoppable! The Brit's on a mission, folks! He's got his sights set on the top five, and we can't wait to see what he's got in store for us!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3469.93,
            "description": "Driver 81 overtakes Driver 22 to position 9"
        },
        "commentary": "\"OH, THE AUSSIE ROOKIE STRIKES! Oscar Piastri with the move of the day so far, slipping past Yuki Tsunoda at the hairpin! That's precision driving, folks! The young gun from Down Under is on a mission, and he's not letting anyone stand in his way! He's got the bit between his teeth, and he's not looking back! Tsunoda didn't put up much of a fight, but you can't blame him, Piastri was like a hot knife through butter! The McLaren junior is making his mark, and he's now up to P9! What a drive, what a move, what a talent!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3469.93,
            "description": "Driver 23 overtakes Driver 22 to position 10"
        },
        "commentary": "\"OH, THE SILVER ARROW STRIKES! Alex Albon, the Thai sensation, has pulled off a daring move on Yuki Tsunoda! He's been sizing him up for laps, waiting for the perfect moment to pounce, AND HE'S DONE IT! Albon goes wheel-to-wheel with the Japanese driver, and his Williams takes the spoils! Tsunoda had no answer to the pace of the Williams, and Albon seizes the opportunity to snatch 10th place! The crowd is on the edge of their seats as Albon celebrates his hard-fought gain!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3474.398,
            "description": "Driver 23 overtakes Driver 3 to position 10"
        },
        "commentary": "\"BLAST OFF, ALEX ALBON! What a move! He's been sizing up Daniel Ricciardo for laps, and finally, he's made it stick! Albon's got the momentum, he's got the guts, and he's got the pace! He dives down the inside, and Ricciardo can't hold him off! THAT'S THE PASS OF THE RACE SO FAR, FOLKS! Albon's up to 10th, and Ricciardo's got to settle for 11th! Unbelievable stuff from the Thai driver! He's been on the charge all afternoon, and that's why he's earned himself a spot in the top 10!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3474.398,
            "description": "Driver 3 overtakes Driver 22 to position 11"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS! Daniel Ricciardo, the Honey Badger, has pulled off an absolute stunner! He's gone around the outside of Yuki Tsunoda, and oh, what a brave move that is! The Australian's got the bit between his teeth, and he's not letting go! He's taken the 11th spot, and that's a massive haul of points on the line!\n\nRicciardo's been sniffing around the gearbox of Tsunoda for the past few laps, waiting for the perfect moment to pounce. And boy, has he timed it to perfection! A beautifully judged move, and he's through into 11th! The McLaren crew will be doing the happy dance in the pits, that's for sure! What a drive from Ricciardo, he's really starting to find his rhythm now!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3474.672,
            "description": "Driver 18 overtakes Driver 22 to position 12"
        },
        "commentary": "\"OH, WHAT A MOVE! LANCE STROLL, THE CANADIAN CHARGER, SEES AN OPENING AND TAKES IT! HE'S GOT THE BETTER OF YUKI TSUNODA AROUND THE OUTSIDE OF TURN 7! THAT'S THE KIND OF AGGRESSIVE DRIVING WE'VE COME TO EXPECT FROM THE ASTON MARTIN DRIVER! Tsunoda was struggling for pace, and Stroll pounced, taking advantage of the opportunity to snatch 12th place! The crowd is on their feet here at the circuit, and we've got a real battle brewing in the midfield!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3475.947,
            "description": "Driver 24 overtakes Driver 22 to position 13"
        },
        "commentary": "\"UNBELIEVABLE! ZHOU GUANYU WITH THE MOVE OF THE RACE SO FAR! HE'S BEEN HOUNDING TSUNODA FOR LAPS, AND FINALLY, HE'S MADE IT STICK! THE CHINESE DRIVER WITH A MASTERFUL TRADEMARK OVERTAKE AROUND THE OUTSIDE OF TURN 7, LEAVING TSUNODA TO FIGHT FOR BREATH! ZHOU TAKES 13TH, AND THAT'S ONE STEP CLOSER TO THE POINTS! TSUNODA, MEANWHILE, IS LEFT TO PONDER WHAT COULD'VE BEEN!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3482.289,
            "description": "Driver 24 overtakes Driver 22 to position 13"
        },
        "commentary": "\"OH, THE DRAGON'S BREATH! Zhou Guanyu with a STUNNING MOVE on Yuki Tsunoda! He's been lurking, waiting for the perfect opportunity, and NOW HE STRIKES! A courageous dive down the inside, and the Chinese sensation takes the 13th spot! Tsunoda was caught napping, and Zhou's got the Skill-O-Meter turned up to MAXIMUM!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3482.289,
            "description": "Driver 27 overtakes Driver 22 to position 14"
        },
        "commentary": "\"OH, THE HULK HAS STRUCK! Nico Hülkenberg, the veteran German driver, has pulled off a masterclass move on Yuki Tsunoda, snatching 14th place from the Japanese youngster! It was a beautifully executed pass, Hülkenberg saw the opportunity and seized it with both hands! Tsunoda didn't put up much of a fight, but he couldn't match the pace of the experienced Hülkenberg. The Hulk is on the move, folks, and he's hungry for more!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3544.475,
            "description": "Driver 14 overtakes Driver 27 to position 6"
        },
        "commentary": "\"OH, THE FERNANDO FLAIR IS BACK, FOLKS! Alonso, the two-time world champion, is on the charge! He's been sizing up Hülkenberg for laps, and finally, he makes his move! A daring dive down the inside, and he's got it! The McLaren is now up to 6th, and that's a massive boost for the team! Hülkenberg didn't put up much of a fight, but you can't blame him - Alonso was on a mission! The Spaniard's got his eyes on the top 5 now, and with this pace, who's to say he can't pull it off?!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3544.475,
            "description": "Driver 16 overtakes Driver 14 to position 5"
        },
        "commentary": "\"WHAT A MOVE! CHARLES LECLERC, THE MONÉGASQUE MASTER, UNLEASHES THE FURY! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE DOES! FERNANDO ALONSO, THE VETERAN, IS LEFT IN HIS DUST AS LECLERC SENSATIONALLY SNATCHES 5TH PLACE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3546.969,
            "description": "Driver 16 overtakes Driver 4 to position 5"
        },
        "commentary": "\"SENSATIONAL MOVE! Charles Leclerc is on a mission! He's been hounding Lando Norris for laps, and finally, he's made it stick! A daring dive down the inside, and he's taken the fifth spot! Norris had no answer to the Monegasque maestro's pace! Leclerc's got the bit between his teeth, and he's not letting up! He's got his sights set on the podium now, and you wouldn't bet against him reaching it! Norris, meanwhile, will be ruing that slight mistake that allowed Leclerc to pounce. What a pass, what a drive!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3546.969,
            "description": "Driver 4 overtakes Driver 14 to position 6"
        },
        "commentary": "\"BY THE HORNSpoons! Lando Norris has pulled off a crucial pass on Fernando Alonso! The McLaren man has been lurking in the shadows, waiting for the perfect opportunity to strike, and strike he has! He's got the better of the two-time world champion, and now finds himself in sixth place! Norris has been on a charge all race, and this overtake is the culmination of some fantastic pace and clever strategy! Alonso, meanwhile, will be ruing that slight mistake that allowed Norris to pounce. The Spaniard's pace has been waning in the last few laps, and Norris has capitalized in style! What a drive from the young Brit, folks! He's got the bit between his teeth now, and you can bet your bottom dollar he'll be pushing for more!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3570.668,
            "description": "Driver 14 overtakes Driver 3 to position 7"
        },
        "commentary": "\"OH, THE MASTER OF DEFENSE FALLS! Fernando Alonso, the wily veteran, has been sensationally outmaneuvered by Daniel Ricciardo! But wait, NO! It's the other way around! The Spaniard has pulled off a stunner, swooping past the Australian with a daring move on the outside! Alonso's Ferrari-powered machine has found the sweet spot, and he's propelled himself into 7th place! The crowd is on its feet, folks, as the two-time World Champion shows he's still got it! Ricciardo's struggles continue, but Alonso is the man on the move here at the midpoint of the race!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3570.668,
            "description": "Driver 18 overtakes Driver 3 to position 11"
        },
        "commentary": "\"Oh, what a move! Lance Stroll, the young Canadian, is on the charge! He's been hounding Daniel Ricciardo for laps, and finally, he's made the pass! Stroll gets a better exit out of the hairpin and drags Ricciardo down to the next turn. The crowd is on the edge of their seats as these two battle for 11th place! AND THERE IT IS! Stroll gets the job done, taking the position with a beautifully executed switch to the inside! Ricciardo had no answer for that one, folks! Stroll's pace has been impressive all weekend, and now he's making it count! Up to 11th place he goes, and he's got the bit between his teeth! Can he make further progress in this Grand Prix?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3573.061,
            "description": "Driver 18 overtakes Driver 3 to position 11"
        },
        "commentary": "\"WHAT A MOVE! Lance Stroll is on the charge! He's been hounding Daniel Ricciardo for laps, and finally, he's made the pass stick! Stroll slices past the Aussie's rear wing and takes the spot! That's 11th place for the Canadian, and he's got the bit between his teeth now! Ricciardo didn't make it easy, but Stroll was relentless - he's got the momentum, and he's not letting up! The crowd is on their feet here, folks! Stroll is on the hunt for more!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3573.061,
            "description": "Driver 24 overtakes Driver 3 to position 12"
        },
        "commentary": "\"OH, THE CHINESE ROOKIE STRIKES! ZHOU GUANYU WITH THE MOVE OF THE DAY SO FAR! HE'S BEEN LURKING BEHIND DANIEL RICCIARDO FOR LAP AFTER LAP, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND WHAT A MOVE IT IS! HE SEES THE GAP, TAKES A DEEP BREATH, AND SLIPS UP THE INSIDE OF THE AUSSIE! RICCIARDO HAS NO ANSWER! ZHOU TAKES 12TH PLACE! THE CROWD IS ON ITS FEET, FOLKS! THIS KID'S GOT SKILLS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3579.152,
            "description": "Driver 24 overtakes Driver 3 to position 12"
        },
        "commentary": "\"UNBELIEVABLE! ZHOU GUANYU PULLS OFF THE MOVE OF THE RACE SO FAR! THE CHINESE DRIVER SEES AN OPENING AND TAKES IT, GETTING AROUND DANIEL RICCIARDO'S DEFENDING HONDA! RICCIARDO THOUGHT HE HAD THE INSIDE LINE LOCKED DOWN, BUT ZHOU GUANYU WAS HAVING NONE OF IT! HE OUTBRAKES THE AUSSIE AND TAKES THE POSITION! ZHOU MOVES UP TO 12TH, WHILE RICCIARDO FALLS TO 13TH! WHAT A DRIVE FROM THE ALFA ROMEO DRIVER!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3579.152,
            "description": "Driver 27 overtakes Driver 3 to position 13"
        },
        "commentary": "\"UNBELIEVABLE! Nico Hülkenberg with the move of the race so far! He's been stalking Daniel Ricciardo for laps, waiting for the perfect moment to strike, AND HE'S TAKEN IT! The German driver pulls out of the slipstream, gets a better exit out of turn 12, and SLIPS UP THE INSIDE of Ricciardo at turn 13! The crowd is going WILD here! Hülkenberg's got the pace, he's got the skill, and now he's got the position! Ricciardo's been shuffled back to 14th, and Hülkenberg's up to 13th! What a drive from the 27 car!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3581.492,
            "description": "Driver 27 overtakes Driver 3 to position 13"
        },
        "commentary": "\"FANTASTICO! Nico Hülkenberg with the move of the day so far, folks! He's been lurking in the shadows, waiting for the perfect opportunity, and finally, he's pounced! Daniel Ricciardo, the Aussie battler, couldn't hold him off, and Hülkenberg has snatched 13th place from his grasp! That's some superb driving from the German veteran, proving he's still got the skills to pay the bills! The crowd is on their feet, and we've got a new player in the midfield battle!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3581.492,
            "description": "Driver 20 overtakes Driver 3 to position 14"
        },
        "commentary": "\"OH, WHAT A MOVE! Kevin Magnussen, the Danish dynamo, has seized the opportunity! He's been lurking behind Daniel Ricciardo, waiting for the perfect moment to pounce, AND HE'S TAKEN IT! With a daring dive down the inside, Magnussen has wrestled 14th place away from the Aussie veteran! Ricciardo tried to defend, but Magnussen was having none of it - he's got the pace, the skill, and the determination to get the job done! The Haas driver is on a mission to climb the order, and this is just the start!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3581.492,
            "description": "Driver 20 overtakes Driver 22 to position 14"
        },
        "commentary": "\"BY THE HORN OF THE RHINO! Kevin Magnussen has pulled off the most daring of moves, switching back to the inside at Turn 9 to steal 14th place from Yuki Tsunoda! The Haas driver has been lurking in the shadows, waiting for the perfect opportunity to pounce, and what a time to do it! Tsunoda was struggling to find traction on the outside, and Magnussen seized the moment, darting to the inside and making it stick! The Danish dynamo is on the move, folks, and the crowd is going wild! That's a massive boost for Magnussen's confidence, and he'll be looking to build on this momentum as the race wears on!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3582.464,
            "description": "Driver 22 overtakes Driver 3 to position 15"
        },
        "commentary": "\"UNBELIEVABLE! YUKI TSUNODA PULLS OFF THE MOVE OF THE DAY! HE'S BEEN LURKING IN THE SHADOWS, WAITING FOR THE PERFECT MOMENT TO STRIKE, AND STRIKE HE HAS! DANIEL RICCIARDO, CAUGHT OFF GUARD, CAN'T DEFEND AGAINST THE YOUNG JAPANESE DRIVER'S LIGHTNING QUICK REFLEXES! TSUNODA TAKES THE INSIDE LINE, GETS THE BETTER EXIT, AND NOW HE'S UP INTO 15TH PLACE! THE CROWD IS ON ITS FEET, FOLKS, THIS IS RACING AT ITS FINEST!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3666.629,
            "description": "Driver 18 overtakes Driver 22 to position 10"
        },
        "commentary": "\"OH, THE CANADIAN CONNECTION STRIKES AGAIN! Lance Stroll, the young gun from North America, has pulled off a stunning move on Yuki Tsunoda! He's been sizing him up for laps, waiting for the perfect opportunity to pounce, and BOOM! He's taken it! Stroll's got the pace, he's got the skill, and now he's got the position! Tsunoda didn't stand a chance, he was a sitting duck as Stroll blew past him on the outside of Turn 7! What a move, what a drive! Stroll is up to 10th place now, and you can bet he's not stopping there! He's got the bit between his teeth and he's hungry for more!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3666.629,
            "description": "Driver 18 overtakes Driver 23 to position 10"
        },
        "commentary": "\"OH, THE FORCE IS STRONG WITH STROLL! Lance Stroll, the young Canadian, is on the move! He's been sizing up Alex Albon for what feels like an eternity, and finally, he makes his move! Stroll takes the outside line, carries the speed, and SLIPS AHEAD! That's a masterclass, folks! He's up to 10th place, and Albon is left to ponder what could've been! The battle for the top 10 just got a whole lot more interesting!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3669.723,
            "description": "Driver 24 overtakes Driver 23 to position 11"
        },
        "commentary": "\"BY THE HORN! Zhou Guanyu has pulled off a stunner of an overtake on Alex Albon! The Chinese driver has been lurking in the shadows, waiting for the perfect opportunity to strike, and STRIKE HE HAS! With a beautifully timed move, Guanyu has dispatched Albon and claimed 11th place for himself! The crowd is on the edge of their seats as Guanyu's Alfa Romeo surges past the Williams of Albon on the outside of Turn 7! What a drive from the young Chinese sensation, who's been making waves all season with his daring maneuvers! Albon didn't put up much of a fight, but you can't blame him - Guanyu was determined to get past and get past he did! The Chinese Dragon roars on, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3675.918,
            "description": "Driver 24 overtakes Driver 23 to position 11"
        },
        "commentary": "\"BY THE HORN, ZHOU GUANYU IS ON THE MARCH! HE'S GOT THE BIT BETWEEN HIS TEETH AND HE'S NOT LETTING GO! Alexa Albon, caught napping, and Zhou takes advantage! A beautifully judged move, using the slipstream to perfection! The Chinese youngster slices past Albon on the outside, and he's up to 11th! The crowd is on their feet, folks! Zhou Guanyu, the rookie sensation, making a statement! Albon, meanwhile, will be ruing that mistake, he's got to get his head back in the game!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3675.918,
            "description": "Driver 27 overtakes Driver 23 to position 12"
        },
        "commentary": "\"INCOMING! Hülkenberg is on the charge! The German ace has been sizing up Albon for laps, and now he's made his move! A daring dive down the inside at Turn 7, and he's through! Nico Hülkenberg takes 12th place from Alex Albon! What a magnificent move! The Hulk has been known for his tenacity, and he's proved it once again! Albon gave it his all, but Hülkenberg's experience and determination won the day! Unbelievable stuff, folks! The midfield battle is heating up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3677.136,
            "description": "Driver 27 overtakes Driver 20 to position 12"
        },
        "commentary": "\"UNBELIEVABLE! HÜLKENBERG WITH THE MOVE OF THE RACE SO FAR! He's been sniffing around the gearbox of Magnussen for laps, and finally, he's made the pass stick! A masterclass in late braking, Nico takes the apex beautifully and swoops past the struggling Haas! The German driver is on a mission, and he's not done yet! From 13th to 12th, Hülkenberg is on the charge! And Magnussen, who's been struggling with tire wear all race, has to settle for 13th... but what a fight he's putting up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3677.136,
            "description": "Driver 20 overtakes Driver 23 to position 13"
        },
        "commentary": "\"UNBELIEVABLE! The Dane is on the move! Kevin Magnussen has pulled off a stunner, swooping past Alex Albon at the apex of turn 7! The Haas driver has been lurking in the shadows, waiting for the perfect opportunity to strike, and boy, did he ever! That was a beautifully executed move, maximizing the grip and momentum to take the spot! Albon thought he had it defended, but Magnussen was having none of it! He's up to 13th now, and the momentum is on his side! Can he keep pushing and make further gains?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3678.35,
            "description": "Driver 22 overtakes Driver 23 to position 14"
        },
        "commentary": "\"TORPEDO MOVE! Yuki Tsunoda has unleashed the beast, folks! The Japanese sensation has nailed it, sneaking up on Alex Albon's gearbox and BAM! He's through! The inside line at Turn 5 proves to be the perfect ticket for Tsunoda to claim 14th spot! Albon didn't see it coming, and now Tsunoda is flying high! That's the kind of aggression we've come to expect from the young AlphaTauri charger! What a move, what a driver!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3686.735,
            "description": "Driver 3 overtakes Driver 23 to position 15"
        },
        "commentary": "\"OH, THE HONEY BADGER STRIKES! Daniel Ricciardo, the master of late braking, has pulled off a stunner! He's been all over the gearbox of Alex Albon for the past few laps, and finally, he's made the move stick! Ricciardo dives down the inside, door-to-door with Albon, and takes the spot! He's up to 15th, and the crowd is on its feet! That's vintage Ricciardo, folks! He's like a shark that's smelled blood, and he won't stop until he's in the points! Albon didn't make it easy for him, but in the end, the Australian's experience and guile won out. This could be the spark Ricciardo needs to kickstart his season!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3773.38,
            "description": "Driver 20 overtakes Driver 23 to position 12"
        },
        "commentary": "\"OH, THE DANES ARE DELIGHTED! Kevin Magnussen has pulled off a stunner! He's gone wheel-to-wheel with Alex Albon, and the Haas driver has come out on top! Magnussen's been hunting Albon down for the past few laps, and finally, he's made his move stick! The pass is complete, and Magnussen takes 12th place! The K-Mag fans are going wild, and why not? That was a masterclass in overtaking! He's got the momentum now, can he keep pushing forward?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3773.38,
            "description": "Driver 20 overtakes Driver 27 to position 12"
        },
        "commentary": "\"OH, WHAT A MOVE! Magnussen is on the charge! He's been sizing up Hülkenberg for laps, and finally, he's made the pass! A beautifully timed dive down the inside at Turn 12, and the Haas takes the place! Hülkenberg had no answer to that, he was left to defend, but Magnussen was having none of it! Up to 12th place for the Dane, and what a boost for the Haas team! That's the kind of aggression we love to see in Formula 1! MAGNUSSEN MAKES THE PASS!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3775.398,
            "description": "Driver 22 overtakes Driver 27 to position 13"
        },
        "commentary": "\"OH, THE BATTLE FOR 13th INTENSIFIES! Yuki Tsunoda, the Japanese sensation, is on the charge! He's been hounding Nico Hülkenberg for lap after lap, and finally, he makes his move! A daring dive down the inside, and Tsunoda takes 13th from Hülkenberg! The crowd is on the edge of their seats as the Japanese driver makes it stick! The Hondas are revving loud, and Tsunoda's strategy is paying off! He's got the bit between his teeth, and he's not letting up! 22 goes to 13, and the midfield is heating up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3837.415,
            "description": "Driver 14 overtakes Driver 27 to position 8"
        },
        "commentary": "\"UNBELIEVABLE! Fernando Alonso, the master of the mid-pack, strikes again! He's got the bit between his teeth, and he's not letting go! He's been hounding Nico Hülkenberg for lap after lap, and FINALLY, he sees his chance! Down the inside, using every ounce of skill and experience, Alonso SLIPS AHEAD of the German! That's an overtake for the age, folks! Alonso up to 8th, and Hülkenberg relegated to 9th. The Spaniard is ON A MISSION!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3837.415,
            "description": "Driver 44 overtakes Driver 14 to position 7"
        },
        "commentary": "\"OH, THE KING OF COMEBACKS STRIKES AGAIN! Lewis Hamilton, the seven-time world champion, is on the move! He's been clawing his way up the order, and NOW HE'S GOT THE BIT BETWEEN HIS TEETH! Hamilton dives down the inside of Fernando Alonso, and makes the pass STICK! The crowd is on their feet as the number 44 car takes seventh place from the Spanish veteran! That's the kind of drive that reminds us all why Lewis is a master of this sport! Alonso put up a good fight, but Hamilton's determination and skill won out in the end. This is getting GOOD, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3935.635,
            "description": "Driver 44 overtakes Driver 14 to position 7"
        },
        "commentary": "\"OH, WHAT A MOVE! LEWIS HAMILTON WITH THE PATIENCE OF A PANTHER, WAITING FOR THE PERFECT MOMENT TO STRIKE! AND STRIKE HE DOES! HE'S AROUND THE OUTSIDE OF FERNANDO ALONSO, THE FORMER CHAMPION NO MATCH FOR THE SEVEN-TIME CHAMP'S RACING CRAFT! HAMILTON now seventh, and Alonso forced to settle for eighth! That's the kind of move that gets the crowd on their feet, folks! Hamilton's been biding his time, studying Alonso's every move, and then...BAM! THE PASS OF THE RACE SO FAR! He's got the momentum now, can he keep it up and push into the top six?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 3935.635,
            "description": "Driver 81 overtakes Driver 14 to position 8"
        },
        "commentary": "\"OH, THE AUSSIE ASSAULT! Oscar Piastri, the rookie sensation, is making his move! He's been lurking in the shadows, waiting for the perfect opportunity to strike, and STRIKES HE HAS! Fernando Alonso, the wily veteran, couldn't defend against the young gun's onslaught! Piastri's got the pace, he's got the skill, and NOW HE'S GOT THE POSITION! Alonso's been relegated to 9th, and Piastri is up to 8th! The crowd is on the edge of their seats, folks, as the rookie takes another scalp in this thrilling F1 encounter!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4068.851,
            "description": "Driver 81 overtakes Driver 3 to position 8"
        },
        "commentary": "\"BY THE EXILES OF THE PITS! Oscar Piastri has pulled off a STUNNING move on Daniel Ricciardo! The Aussie young gun has been applying the pressure lap after lap, and finally, he's made it stick! Piastri's got the pace, the patience, and the precision - he's slotted in beautifully on the inside of Ricciardo, and that's all she wrote! The McLaren's dropped to 9th, and Piastri's up to 8th! The rookie's on a ROLL, folks! This kid's got the skills, and he's not afraid to use 'em!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4068.851,
            "description": "Driver 3 overtakes Driver 27 to position 14"
        },
        "commentary": "\"OH, THE HONEY BADGER STRIKES AGAIN! Daniel Ricciardo, the master of late-braking maneuverability, has pulled off a stunner on Nico Hülkenberg! He's been sizing him up for laps, waiting for the perfect opportunity, AND THERE IT IS! The Australian ace dives down the inside, gets the job done, and takes 14th place! The Renault is looking RACY today, folks! Ricciardo's got his sights set on the top 10, and he's not going to let anyone stand in his way!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4148.652,
            "description": "Driver 14 overtakes Driver 27 to position 10"
        },
        "commentary": "\"BY THE HORN OF FORTUNE, FERNANDO ALONSO MAKES THE MOVE! The wily Spaniard has been stalking Nico Hülkenberg for laps, and finally, he's pounced! Alonso's got the bit between his teeth and he's Not. Letting. Go! That's a masterclass of patience and precision, folks! He's taken Hülkenberg to the cleaners, and snatched P10 from under his nose! The Ferrari-powered McLaren is a force to be reckoned with today, and Alonso is driving like a man on a mission! The crowd is on its feet as the double-world champ makes his move, and we can't get enough of this action! Fernando Alonso, up to P10, and breathing down the necks of the top 9!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4148.652,
            "description": "Driver 18 overtakes Driver 14 to position 9"
        },
        "commentary": "\"OH, THE STROLL SHOW HAS ARRIVED! Lance Stroll, the young Canadian, is on the charge! He's been lurking in the shadows, waiting for the perfect moment to strike, and strike he has! Fernando Alonso, the seasoned veteran, couldn't hold off the feisty 18 car! Stroll takes the initiative, and with a daring move, he swoops past the 14 car of Alonso to snatch 9th place! The crowd is on the edge of their seats as Stroll celebrates his hard-earned pass! This is turning out to be a thrilling mid-field battle, folks! Who's next on Stroll's hit list?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4153.181,
            "description": "Driver 18 overtakes Driver 14 to position 9"
        },
        "commentary": "\"OH, THE CANADIAN CONNECTION! Lance Stroll is on the move! He's been sizing up Fernando Alonso for laps, and finally, he makes his move! A brilliant dive down the inside, and Stroll takes the position! Alonso didn't put up much of a fight, but Stroll wasn't having it! He's got the momentum now, can he keep pushing forward? The Aston Martin is looking racy today, folks! Stroll is up to 9th, Alonso relegated to 10th! What a pass!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4153.181,
            "description": "Driver 24 overtakes Driver 14 to position 10"
        },
        "commentary": "\"OH, THE DRAGON STRIKES! Zhou Guanyu, the young Chinese sensation, HAS FOUND A WAY PAST THE WISE VETERAN, Fernando Alonso! The Alfa Romeo driver has been hounding the Alpine for laps, and finally, he's made his move stick! A beautifully judged pass around the outside of Turn 7, and now Guanyu finds himself in 10th place! Alonso didn't make it easy, but Zhou's pace and determination have paid off. This is a massive confidence booster for the Alfa Romeo team, and a reminder that Zhou is a force to be reckoned with!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4167.368,
            "description": "Driver 24 overtakes Driver 23 to position 10"
        },
        "commentary": "\"OH, THE DRAGON BREATHES FIRE! Zhou Guanyu, the young Chinese sensation, has pulled off a stunning move on Alex Albon! He's been lurking in the shadows, waiting for the perfect moment to strike, and STRIKE HE HAS! Around the outside, he takes the line, and Albon can't respond! Guanyu's got the pace, he's got the skill, and now he's got the position! Up to 10th place, the Alfa Romeo driver celebrates a magnificent pass! The crowd is on its feet, and we've got a thriller of a race unfolding here! Guanyu's on the move, and you can bet your bottom dollar he's hungry for more!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4167.368,
            "description": "Driver 23 overtakes Driver 27 to position 15"
        },
        "commentary": "\"BY THE HORN, HE'S THROUGH! Alex Albon with a daring dive down the inside of Nico Hülkenberg! The Thai driver saw his chance and took it, seizing the moment to snatch 15th place from the German veteran! Albon's been pushing hard all race, and that move showcases his tenacity and skill. He's not giving up on those championship points just yet! Hülkenberg didn't put up much of a fight, but you can't blame him - Albon was simply the faster man in that exchange. NOW WE'RE COOKING, FOLKS! The battle for the lower midfield is heating up!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4172.889,
            "description": "Driver 31 overtakes Driver 27 to position 16"
        },
        "commentary": "\"BY THE FRENCHMAN! Esteban Ocon with a daring move on the outside of Nico Hülkenberg! He's been hunting him down for laps, and finally, he's made the pass stick! Ocon's got the pace, Ocon's got the skill, and now he's got the position! Up to 16th place for the French driver, and he's not done yet! The crowd is on their feet as Ocon celebrates with a punch in the air! What a move, what a drive, MON DIEU, what an overtake!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4176.48,
            "description": "Driver 31 overtakes Driver 10 to position 16"
        },
        "commentary": "\"OH, MON DIEU! Esteban Ocon has pulled off an audacious move on Pierre Gasly! He's been stalking him for laps, and finally, he's made the pass stick! Ocon's got the bit between his teeth, and he's not letting up! That's a masterclass in overtaking, folks! He's picked his spot perfectly, using the KERS to blast past Gasly on the inside of Turn 3! Ocon now moves up to 16th, and Gasly's left to ponder what could've been! This is turning out to be a thriller of a race!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4176.48,
            "description": "Driver 10 overtakes Driver 27 to position 17"
        },
        "commentary": "\"OH, WHAT A MOVE! Pierre Gasly, the French flair on full display! He's been licking his lips, waiting for the perfect opportunity, and he's seized it! Gasly gets the better of Nico Hülkenberg, slipping up the inside at Turn 12, and he's through! The AlphaTauri rockets past the Haas, and Gasly takes 17th place! That's textbook, folks! The Gasly gamble pays off, and he's on the charge! Hülkenberg didn't put up much of a fight, but you can't blame him – Gasly was determined to make it stick! The crowd is on their feet, and we've got a new dynamic in the midfield battle!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4345.645,
            "description": "Driver 14 overtakes Driver 27 to position 10"
        },
        "commentary": "\"OH, THE SPANISH MAESTRO STRIKES AGAIN! Fernando Alonso, the two-time world champion, PULLS OFF A MASTERCLASS MOVE! He's been stalking Nico Hülkenberg for laps, waiting for the perfect opportunity to pounce, and now he's made his way past! \n\nFrom 11th to 10th, Alonso gets the job done! Hülkenberg didn't stand a chance, Fernando's got the pace and the precision, and he's not afraid to use it! The Renault is flying, and Alonso's experience is paying off big time! That's the kind of driving that's earned him 32 Grands Prix wins, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4345.645,
            "description": "Driver 14 overtakes Driver 24 to position 10"
        },
        "commentary": "\"AND FERNANDO ALONSO SEES HIS CHANCE! THE TWO-TIME WORLD CHAMPION POUNCES ON ZHOU GUANYU DOWN THE BACK STRAIGHT! WITH A SLIPSTREAM LIKE THAT, YOU'D BE CRAZY NOT TO HAVE A GO! ALONSO'S GOT THE BIT BETWEEN HIS TEETH NOW, DRIVING LIKE A MAN POSSESSED! AND THERE IT IS, FOLKS! ALONSO UP INTO 10TH PLACE, LEAVING ZHOU TO FIGHT OVER THE SCRAPS! THAT'S THE EXPERIENCE TALKING, FOLKS! ALONSO'S BEEN IN THIS POSITION BEFORE, AND HE KNOWS EXACTLY HOW TO CAPITALIZE! THE CROWD IS ON ITS FEET HERE AT [TRACK NAME], WITNESSING GREATNESS UNFOLD BEFORE THEIR VERY EYES!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4377.522,
            "description": "Driver 24 overtakes Driver 10 to position 11"
        },
        "commentary": "\"OH, THE CHINESE SENSATION STRIKES! ZHOU GUANYU WITH A MASTERFUL MOVE ON PIERRE GASLY! THE ALFA ROMEO DRIVER SEES AN OPENING AND TAKES IT WITH BOTH HANDS, SLIPPING UP THE INSIDE OF TURN 7! THAT WAS A HIGH-RISK, HIGH-REWARD MANEUVER, FOLKS! ZHOU'S GOT THE BIT BETWEEN HIS TEETH NOW, AND HE'S GOT THE PASS DONE! GASLY LEFT THE DOOR OPEN, AND ZHOU TOOK ADVANTAGE! THE CROWD IS ON ITS FEET AS ZHOU TAKES 11TH PLACE!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4377.522,
            "description": "Driver 27 overtakes Driver 10 to position 17"
        },
        "commentary": "\"OH, THE HULK HAS STRUCK! Nico Hülkenberg, the experienced German, has pulled off a masterclass move on Pierre Gasly! He's been lurking, waiting for the perfect moment to pounce, and POUNCE HE HAS! Hülkenberg's got the McLaren's tyres screaming in protest as he takes the outside line, and GASLY CAN'T DEFEND! The Frenchman thought he had it covered, but Hülkenberg's got the pace and the precision to take it! And just like that, the Hulk snatches 17th place! The crowd is on the edge of their seats here, folks!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4494.521,
            "description": "Driver 16 overtakes Driver 27 to position 4"
        },
        "commentary": "\"OH, THE MONÉGASQUE MAGIC IS BACK! Charles Leclerc, the Monegasque marvel, has just pulled off a stunning move on Nico Hülkenberg! Leclerc, with his Ferrari fired up, saw the opportunity to pounce on the German driver and snatched it with both hands! That's a beautifully executed overtake, folks! He's now up to P4, and you can bet your helmet he's got his sights set on the podium! The crowd is going wild, and so are we! What a drive, Charles, what a drive!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4494.521,
            "description": "Driver 16 overtakes Driver 63 to position 4"
        },
        "commentary": "\"OH, WHAT A MOVE! Leclerc, the Monegasque maestro, has pulled off the pass of the century on Russell! He's been lingering in the shadows, waiting for the perfect opportunity to strike, and STRIKE HE HAS! With a beautifully executed dive down the inside, Leclerc has seized fourth place from Russell's grasp! The Ferrari is looking rampant today, folks! Russell, unfortunately, had no answer to that lightning-quick move. We've got a new top four, and it's Leclerc who's the man on the move! The pace is scintillating, the intensity is palpable, and we're witnessing greatness unfold before our very eyes!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4725.126,
            "description": "Driver 63 overtakes Driver 14 to position 5"
        },
        "commentary": "\"ANOTHER ONE! George Russell, the rookie sensation, is making his move! He's been sizing up Fernando Alonso for laps, and now he's made the pass! A beautifully executed move around the outside of Turn 3! Russell's got the pace, he's got the skill, and now he's got the position! Alonso didn't put up much of a fight, but you can't blame him, Russell was just too quick! The Briton is now up to P5, and he's got his sights set on the top four! This kid's on fire!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4725.126,
            "description": "Driver 14 overtakes Driver 18 to position 9"
        },
        "commentary": "\"BY THE SEAT OF HIS PANTS, FERNANDO ALONSO HAS DONE IT! THE TWO-TIME WORLD CHAMPION HAS PULLED OFF A STUNNING MOVE ON LANCE STROLL, SLIPPING UP THE INSIDE AT TURN 7 TO TAKE 9TH PLACE! \n\nAlonso, renowned for his razor-sharp instincts, has been stalking Stroll for the past few laps, waiting for the perfect moment to strike. And what a move it was! He outbraked the Canadian into the corner, leaving Stroll with no option but to yield. \n\nThe Spaniard's determination to climb up the order is palpable, and with this overtake, he's now firmly in the points-paying positions. Can he continue this momentum to catch up with the drivers ahead?\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4948.559,
            "description": "Driver 18 overtakes Driver 27 to position 10"
        },
        "commentary": "\"BY THE SLIMEST OF MARGINS! Lance Stroll PULLS OFF THE MOVE OF THE RACE SO FAR! He's been lurking in Nico Hülkenberg's shadow for the past few laps, and finally, he sees his chance! The young Canadian driver DARTS down the inside, and Hülkenberg can't hold on! Stroll IS THROUGH! He's up to 10th place, and the crowd is on their feet! That's some serious skill and bravery from Stroll, folks! Hülkenberg didn't make it easy, but Stroll wasn't having it! The battle for the top 10 just got a whole lot more interesting!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 4948.559,
            "description": "Driver 27 overtakes Driver 31 to position 16"
        },
        "commentary": "\"OH, THE HULK IS ON THE MOVE! Nico Hülkenberg, the veteran German, has just pulled off a stunning move on Esteban Ocon at Turn 12! He's been hunting him down for laps, studying his prey, and finally, he's made it count! The Renault's superior pace on the soft tires has given Hülkenberg the edge he needed to snatch 16th place from Ocon's grasp! That's a masterclass in overtaking, folks! The battle for the lower midfield positions is heating up, and Hülkenberg is right in the thick of it!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 5125.991,
            "description": "Driver 3 overtakes Driver 31 to position 13"
        },
        "commentary": "\"BY THEBOARD! Daniel Ricciardo, the Honey Badger, is on the move! He's been stalking Esteban Ocon for laps, and finally, he's made his move! A beautifully executed pass on the inside of turn 12, and Ricciardo is THROUGH! He's up to 13th place now, and Ocon is forced to concede! That's some serious racing nous from the Aussie, folks! He's got the bit between his teeth, and he's not done yet! The crowd is loving it, and we're loving it too! RICCIARDO ON THE MARCH!\""
    },
    {
        "event": {
            "type": "Overtake",
            "timestamp": 5125.991,
            "description": "Driver 3 overtakes Driver 22 to position 13"
        },
        "commentary": "\"BLISTERING MOVE! Daniel Ricciardo is on the charge! He's been hounding Yuki Tsunoda for the past few laps, and finally, he makes his move! The Honey Badger dives down the inside of Turn 12, and Tsunoda can't defend against the Aussie's brutal aggression! Ricciardo snatches 13th place, and the crowd is on their feet! That's vintage Ricciardo, folks! He's got the bit between his teeth, and he's not letting up!\""
    }
]